Repository: frogatto/Cube_Trains_Redux
Catalog: modules/frogatto/po/*.po
Languages: it

source: Level Design and Object Scripting
it: Level Design e Object Scripting

source: Devil's Advocacy
it: Avvocato del Diavolo

source: Programmer, Lead Content Wrangler and Lead Object Scripter
it: Programmatore, Direttore Organizzativo dei Contenuti e Principale Scripter degli Oggetti

source: Artist • Characters, Monsters, Props, Terrain
it: Artista • Personaggi, Mostri, Oggetti scenici, Terreni

source: Writer • Wrote Main Story and Most Dialogue
it: Scrittore • Ha scritto la Storia principale e gran parte del dialogo

source: Level Designer • seaside, town, and forest
it: Designer dei Livelli • mare, città e foresta

source: Musician
it: Musiche

source: Sound Effect Designer
it: Effetti Sonori

source: SPECIAL THANKS:
it: RINGRAZIAMENTI SPECIALI:

source: So let me get this straight...
it: Quindi, fammi capire bene...

source: What you're saying, is that the elder borrowed all this money from you,
it: Mi stai dicendo che il sindaco ha preso in prestito tutto il suo denaro da te,

source: and it was meant to be used on civil projects for the town?
it: e doveva usarlo per progetti civili a favore della città?

source: Exactly!
it: Esattamente!

source: In fact, I came to him with the idea. It was meant to be philanthropy.
it: In effetti, lo abbiamo deciso insieme. Era un opera filantropica.

source: I thought a 'mayor' would be responsible, but instead he's spending it all on himself!
it: Ho pensato che un 'sindaco' sarebbe stato responsabile, ma invece ha speso tutto per sé!

source: And now he's refusing to repay you?
it: E ora si rifiuta di ripagarti?

source: That's right!
it: Giusto!

source: You know, I really think there are some big misunderstandings that need to get cleared up.
it: Sai, credo davvero ci siano alcune grandi incomprensioni che hanno bisogno di essere chiarite.

source: Almost all of which are his fault.
it: E praticamente tutto è colpa sua.

source: This might not be obvious from talking to him, but that elder guy is really just ... crazy.
it: Questo potrebbe non essere evidente parlardo con lui, ma quell'anziano è in realtà solo ... pazzo.

source: He's just plain nuts. He's got a lot of bizarre delusions about things...
it: E' solo un folle. Ha un sacco di strane illusioni sulle cose...

source: ...and mostly we just humor him, because he's pretty harmless.
it: ... E soprattutto facciamo gli spiritosi con lui, perché è abbastanza innocuo.

source: We've trumped him up with a pointless job as the gatekeeper on the east side of town.
it: Gli abbiamo inventato un lavoro inutile come portinaio del lato est della città.

source: Which plays to his ego, and keeps him out of trouble.
it: Che quieta il suo ego, e lo tiene fuori dai guai.

source: Sounds like a perfect place for him!
it: Suona come un luogo perfetto per lui!

source: Yes, he's our official 'greeter'.
it: Sì, lui è il nostro 'anfitrione' ufficiale.

source: But I guess he really could cause some issues if other people, like yourself, aren't aware of his background.
it: Ma credo che potrebbe davvero causare alcuni problemi se altre persone, come te, non sono a conoscenza della sua storia.

source: Intriguing. That'd certainly explain a few things.
it: Intrigante. Quello spiegherebbe certamente alcune cose.

source: For starters, uh ... he's NOT our mayor.
it: Per cominciare, uh ... Non è il nostro sindaco.

source: So I don't know what the elder talked you into, but it's almost guaranteed to be lunacy.
it: Quindi non di cosa l'anziano ti abbia parlato, ma è preticamente sicuro che sia una follia.

source: Yes. No wonder we were confused!
it: Sì. Non c'è da stupirsi che eravamo confusi!

source: Ah, there we are...
it: Ah, eccoci...

source: Fetch some for our guest, would you, kindly?
it: Portane un po' per il nostro ospite, gentilmente.

source: So where was I?
it: Allora, cosa stavo dicendo?

source: What did the elder actually tell you?
it: Che ti disse l'anziano in realtà?

source: Uhm... so, I'm not even sure what that project was supposed to be, at this point.
it: Uhm ... Beh, a questo punto non sono nemmeno sicuro di come quel progetto avrebbe dovuto essere.

source: Might've been something about a bridge, Fergus was heading that one up.
it: Doveva essere qualcosa su un ponte, Fergus se ne stava occupando.

source: He's one of my kitties. Heads up one of our engineering divisions.
it: Lui è uno dei miei gattini. Comanda una delle nostre divisioni di ingegneria.

source: I honestly have no involvement in stuff like this; I delegate all of it out.
it: Onestamente non ho alcun coinvolgimento in cose come queste, ho delegato tutto.

source: Which sometimes doesn't work out as expected?
it: E a volte non sembra funzionare come dovrebbe?

source: Yeah. I don't know a lot about Crevice Village, but if you'll forgive me, I had the impression it was a bit of a backwater, so I thought we'd do something to help out.
it: Già. Non so molto sul Villaggio Lancia, ma se me lo concedi, ho avuto l'impressione che fosse un po 'arretrato, così ho pensato di fare qualcosa per dare una mano.

source: We thought we'd actually hire you guys as labor, to do whatever you could.
it: In realtà abbiamo pensato di ingaggiarvi come lavoratori, per tentare di fare qualcosa.

source: It's always better that way; gets money flowing around, makes the new owners proud of what they built, feels less like charity, et cetera.
it: E 'sempre meglio così; vedere scorrere il denaro rende i nuovi proprietari orgogliosi di ciò che hanno costruito, si sente meno come fosse carità, eccetera.

source: But, apparently we just got conned.
it: Ma, a quanto pare siamo appena stati truffati.

source: And once they figured that out, some of our security guys were a little overzealous about recovering assets.
it: E una volta compreso, alcuni dei nostri ragazzi della sicurezza divennero un po' troppo zelanti con il recupero dei beni.

source: Uh... That's a pretty spectacular euphemism, there...
it: Uh ... Quello è un eufemismo alquanto spettacolare, ci ...

source: Yes, okay ... they were just thugs, plain and simple.
it: Sì, va beh ... erano solo delinquenti, punto.

source: I didn't authorize that operation, but I will take responsibility for it!
it: Non ho autorizzato l'operazione, ma me ne prenderò la responsabilità!

source: Those cats are turning into bullies. Sooner or later, they're going to cause me some serious problems!
it: Quei gatti si stanno trasformando in bulli. Prima o poi mi causeranno seri problemi!

source: I haven't given you a chance to apologize, but no need. Thank you for embarrassing them.
it: Non ti ho dato la possibilità di chiedere scusa, ma non è necessario. Grazie per averli imbarazzati.

source: I hope they've learned a lesson from this.
it: Spero che abbiano imparato la lezione questa volta.

source: Regarding THIS incident, I will need to have a talk with them about common sense.
it: Per quanto riguarda questo incidente, ho bisogno di avere un colloquio con loro sul senso comune.

source: Any fool could guess that the money had long since been spent.
it: Ogni sciocco potrebbe dire che il denaro è stato speso molto tempo fa.

source: Thank you Jeeves, that will do nicely.
it: Grazie Ambrogio, andrà benissimo.

source: Anyhow, I'm quite unsure where to go from here.
it: Comunque, ora non so che cosa fare.

source: I'd like to do something to make amends with the town...
it: Mi piacerebbe fare qualcosa per fare ammenda con la città ...

source: ... what the kitties did there was decidedly impolite.
it: ... ciò che fecero là i gattini è stato decisamente maleducato.

source: Then again, I'm almost tempted to cut my losses and leave you guys well enough alone.
it: Poi di nuovo, sono quasi tentato di tagliare le spese e lasciarvi arrangiare.

source: Would you have any suggestions?
it: Hai qualche suggerimento?

source: One or two.
it: Uno o due.

source: Probably the craziest and most helpful is... I actually think he still has that money.
it: Probabilmente la più pazza e più utile è ... credo che in realtà abbia ancora quei soldi.

source: I know it sounds completely nuts, but I honestly think that when he was given it...
it: So che suona completamente fuori di testa, ma onestamente penso che quando gli è stato dato ...

source: ...he didn't have a clue what to do with it, so he just ... hid it.
it: ... Non aveva idea di cosa farne, così semplicemente... li ha nascosti.

source: We've all known him for years, and he's a hoarder, and a miser.
it: Lo conosciamo da anni ormai, ed è un monopolista, e un avaro.

source: We've never seen him suddenly having more money to spend; so it's crazy, but it fits.
it: Non lo abbiamo mai visto iniziare a spendere più soldi del solito, è folle, ma a senso.

source: I ... didn't see that coming.
it: Io ... non l'aspettavo.

source: When he was getting shaken down by that kitty, we turned our back on him for a second.
it: Quando quel gattino lo stava perquisendo, abbiamo tolto lo sguardo solo per un'attimo.

source: It turned out he'd hidden in some sort of secret passage.
it: Poi si è scoperto che era nascosto in una sorta di passaggio segreto.

source: He may have used some of the money to build it, but his house has some sort of safe room.
it: Può aver utilizzato parte del denaro per costruirlo, ma la sua casa ha una sorta di cassetta di sicurezza.

source: It's just a guess, but I honestly think he might have hidden the rest right inside it.
it: E' solo una supposizione, ma onestamente credo che potrebbe avere nascosto il resto nell'interno.

source: Incredible.
it: Incredibile.

source: Knowing that, you could probably just walk in and take it.
it: Sapendlo, si potrebbe probabilmente andare a prenderlo.

source: We may. In fact I believe we will!
it: Noi potremmo. Credo, In effetti, che lo faremo!

source: If I may be so bold, I think it's safe to say on behalf of the town...
it: Se posso permettermi, credo che sia giusto dire in nome della città ...

source: ...the rest of us would still appreciate some sort of public-works project.
it: ... Il resto di noi saprebbe ancora apprezzare una sorta di progetto per dei lavori pubblici.

source: You probably should hear what others are interested in, but I for one really wish there was a road of any kind between here and there.
it: Probabilmente si dovrebbe sentire ciò che gli altri vogliono, ma per una volta desidererei che ci fosse una strada di qualsiasi genere tra i due luoghi.

source: I'm dreading the trip back.
it: Ho paura per il viaggio di ritorno.

source: Really? Where's your ship parked?
it: Davvero? Dov'è la tua nave?

source: I ... didn't ... use a vehicle. I walked.
it: Io ... non ho ... utilizzato un veicolo. Ho camminato.

source: ... I'm amazed that's even possible.
it: ... Sono stupito che sia ancora possibile.

source: I like you, little frog! You're quite bold.
it: Mi piaci, piccola rana! Sei molto audace.

source: Well, I can certainly at least guarantee transportation for you!
it: Beh, che possa certamente garantirti almeno il trasporto!

source: And I'd be happy to consider some kind of project. You yourself could be my paid liaison.
it: E sarei ben lieto di prendere in considerazione altri tipi di progetto. Potresti essere pagato a contratto.

source: We should keep in touch - hopefully, through you, I can meet some of the more 'level-headed' members of your town.
it: Dovremmo restare in contatto - sperio che, grazie a te, io possa incontrare alcuni delle più "ragionevoli" persone nella tua città.

source: So ... all's well that ends well?
it: Quindi ... tutto è bene quel che finisce bene?

source: Yes, I do think everyone will have an equitable outcome to this whole mess.
it: Sì, io credo che tutti avranno un equo guadagno per tutto questo casino.

source: Except the elder.
it: Tranne il sindaco.

source: The End
it: Fine

source: Each machine has a different arcade-style challenge.
it: Ogni macchina ha una diversa sfida di tipo arcade.

source: Show us what you can do!
it: Facci vedere cosa sai fare!

source: EXIT
it: ESCI

source: Select a level:
it: Seleziona un livello:

source: (cancel)
it: (annulla)

source: CLIMB
it: SALITA

source: RUN
it: CORSA

source: Coin Race
it: Gara delle monete

source: COIN RACE
it: CORSA DELLE MONETE

source: LOAD GAME
it: CARICA GIOCO

source: NEW GAME
it: NUOVO GIOCO

source: Walk in front of a door or person, and press
it: Cammina davanti a una porta o una persona, e premi

source: the button that appears to interact with them.
it: il pulsante che compare per interagire con loro.

source: Hey Nene, what's cooking?
it: Hey Nene, cosa stai cucinando?

source: I'm making a cake. Would you like to have some?
it: Sto preparando una torta. Ne vuoi un pezzo?

source: Nah, I'd better get to town.
it: Nah, devo andare in città.

source: I have serious business to attend to.
it: Ho una questione urgente che mi attende.

source: Oh, well maybe before you go you could look at my basement.
it: Oh, magari prima di andare potresti dare un occhiata alla mia cantina.

source: Your basement?
it: La tua cantina?

source: Yes, here's the key. There're some ants down there.
it: Sì, ecco le chiavi. Ci sono alcune formiche laggiù.

source: How much were you figuring on paying for a pest exterminator?
it: Quanto sei disposta a pagare per questa disinfestazione?

source: Well sheesh, I thought you'd do it for free for a friend!
it: Beh, pensavo tu potessi farlo gratis per un'amica!

source: But if you're going to be like that I think I left a health capsule down there. If you can clear it out, it's yours.
it: Ma se può farti piacere credo di aver lasciato una capsula di vita laggiù. Se riesci a ripulire tutto, è tua.

source: Of course. I don't disappoint!
it: Certo. Io non deludo!

source: And thanks for the gift, by the way.
it: Ed a proposito, grazie per il regalo.

source: You're welcome.
it: Prego.

source: Well, dangit, this door is locked.
it: Accidenti, questa porta è chiusa.

source: Can't a guy sneak into his neighbor's basement uninvited these days?
it: Può uno non imbucarsi nella casa del vicino di questi giorni?

source: Nene's House
it: Casa di Nene

source: There's Nene's house, right up there!
it: Lassù c'è la casa di Nene.

source: A moment of your time sir?
it: Un attimo del vostro tempo signore?

source: Sorry, I'm off to town! Not interested!
it: Mi dispiace, sto andando in città! Non sono interessato!

source: But the town, you see ...
it: Ma la città, vede...

source: Not. Interested. Buzz off.
it: Non. Sono. Interessato. Sparisci.

source: I don't care what you're preaching, go sell it to someone else.
it: Non mi importa cosa stai svendendo, vallo a vendere a qualcun'altro.

source: Very well.
it: Molto bene.

source: Someday, those door-to-door people will realize that kind of hard-sell tactic just annoys people.
it: Un giorno o l'altro, i venditori porta-a-porta si renderanno conto che le loro tattiche invasive seccano le persone.

source: The sooner, the better.
it: Prima avverrà, meglio sarà.

source: To Nene's House
it: Verso Casa di Nene

source: Twisted Trees
it: Gli Alberi Ritorti

source: Underground Pool
it: La Piscina Sotterranea

source: Wandering Passage
it: Il Passaggio del Vagabondo

source: Watery Alley
it: Il Vicolo Lacrimante

source: You don't have enough money.
it: Non hai abbastanza denaro.

source: Nope, it's locked.
it: No, è bloccata.

source: You have acquired a heart capsule. Your maximum HP has increased by one!
it: Hai trovato una capsula di vita. I tuoi punti salute aumentano di uno!

source: You've found part of a heart capsule. Collect another three to increase your maximum HP by one!
it: Hai trovato parte di una capsula di vita. Trovane altre tre per aumentare i tuoi punti salute di uno!

source: You've found part of a heart capsule. Collect another two to increase your maximum HP by one!
it: Hai trovato parte di una capsula di vita. Trovane altre due per aumentare i tuoi punti salute di uno!

source: You've found part of a heart capsule. Collect another one to increase your maximum HP by one!
it: Hai trovato parte di una capsula di vita. Trovane un'altra per aumentare i tuoi punti salute di uno!

source: You've collected enough parts to make a whole new heart capsule! Your maximum HP has increased by one!
it: Hai raccolto abbastanza parti per fare una nuova capsula di vita! I tuoi punti salute aumentano di uno!

source: gliding wings
it: ali plananti

source: The gliding wings will allow you to glide through the air.
it: Le ali plananti ti permetteranno di planare nell'aria.

source: heart
it: cuore

source: The heart will give you an extra health point.
it: Il cuore ti da un punto salute aggiuntivo.

source: The power boots will make you jump higher.
it: Gli stivali della potenza ti faranno saltare più in alto.

source: invincibility crystal
it: cristallo dell'invulnerabilità

source: The invincibility crystal unlocks invincibility powerups. Invincibility powerups will make you invincible for a short time.
it: Il cristallo dell'invulnerabilità sblocca i potenziamenti invincibilità. I potenziamenti invincibilità ti rendono invincibile per un certo periodo.

source: hyper crystal
it: iper cristallo

source: The hyper crystal unlocks hyper powerups. Hyper powerups will heighten your reflexes, making the world seem to slow down around you.
it: L'iper cristallo sblocca gli iper potenziamenti. Gli iper potenziamenti aumenteranno i tuoi riflessi, facendo sembrare il mondo circostante più lento.

source: energy crystal
it: cristallo energetico

source: The energy crystal unlocks energy powerups. Energy powerups will allow you to shoot bolts of energy.
it: Il cristallo energetico sblocca i potenziamenti energetici. I potenziamenti energetici ti permettono di sparare fulmini energetici.

source: The energy shield protects you from damage when you crouch.
it: Lo scudo energetico ti protegge dai danni quando ti accovacci.

source: The speed boots will make you faster.
it: Gli stivali della velocità ti faranno correre più veloce.

source: spit strengthener
it: potenziamento lingua

source: The spit strengthener will extend the range you can spit.
it: Il potenziamento lingua ti farà sputare più lontano.

source: tongue extender
it: allungamento lingua

source: The tongue extender will extend the length of your tongue.
it: L'allungamento lingua renderà la tua lingua più lunga.

source: Intense
it: Intenso

source: Unfair
it: Sleale

source: Milgram's Castle
it: Castello di Milgram

source: The game has been saved.
it: Il gioco è stato salvato.

source: Hi, Chopple.
it: Ciao, Chopple.

source: Hey. Welcome to the store.
it: Hey. Benvenuto nel negozio.

source: Take your time, look around.
it: Guardati pure intorno con calma.

source: Loading textures.
it: Caricamento textures.

source: Loading textures..
it: Caricamento textures ..

source: Loading textures...
it: Caricamento textures ...

source: Loading Frogatto character
it: Caricamento della sagoma di Frogatto

source: - OpenFeint and Achievement support
it: - supporto per OpenFeint e Achievement

source: Fixed The Long Haul (arcade level)
it: Corretto Il lungo raggio (livello arcade)

source: Fixed instructions on titlescreen
it: Corrette le istruzioni nella schermata principale
