Repository: frogatto/Cube_Trains_Redux
Catalog: modules/frogatto/po/*.po
Languages: it

source: I mean... on paper, that sounds like a good enough plan,
it: Voglio dire ... sulla carta, questo piano suona bene,

source: but I'm gonna be a jerk here, and poke some holes in it.
it: ti sembrerò un piantagrane, ma ci sono alcune falle.

source: Fair enough. I'm not particularly fond of it, myself.
it: Certamente. Anche io ad essere onesto non ne sono particolarmente esaltato.

source: Firstly, Milgram's got LOTS of followers. Tons of em. He runs an entire city.
it: In primo luogo, Milgram ha una truppa enorme. Miliardi di persone. Lui gestisce un'intera città.

source: I mean, even if we armed the whole town, they'd grossly outnumber us.
it: Voglio dire, anche se armiamo tutta la città, loro ci sovrasteranno comunque numericamente.

source: Plus, they're pretty mobile, too. Planes and such.
it: Oltretutto, hanno parecchi mezzi. Come Aerei e via dicendo.

source: We might get the drop on them for a bit, but we'd get surrounded in no time.
it: Potremmo sicuramente rallentarli per un po', ma verremo comunque circondati in poco tempo.

source: Brute force against brute force won't work.
it: La forza bruta contro la forza bruta non funziona.

source: We'd be like ... a bull butting heads with a freight train.
it: Saremo come ... Un toro che si scontra contro un treno merci.

source: Yes... oh dear. I see what you mean.
it: Sì... Capisco cosa vuoi dire.

source: There's got to be something we can use to our advantage, but "numerical superiority" isn't it.
it: Dobbiamo trovare qualcosa a nostro vantaggio, ma la "superiorità numerica" non è ciò che cerchiamo.

source: Anyways, about the cave ahead... it's just one guy, right?
it: Ad ogni modo, circa la grotta avanti ... E' solo un ragazzo, giusto?

source: To my knowledge, yes.
it: Per quello che ne so, sì.

source: Maybe I can talk my way around him?
it: Forse posso provare a parlargli?

source: Worse comes to worse, I can just run for it. Right?
it: Se le cose si mettono male, posso sempre scappare. Giusto?

source: I do hope so. Good luck!
it: Lo spero davvero. Buona fortuna!

source: Now what?
it: E ora cosa succede?

source: Dark Corridor
it: Corridoio Oscuro

source: Darkness Central
it: Oscurità Totale

source: Descent to Town
it: Discesa alla Città

source: It says, "Chopple's General Store, just ahead.
it: C'è scritto, "Negozio di Chopple, poco più avanti.

source: Honest trade and thrifty prices!"
it: Commercio onesto e prezzi economici! "

source: Downhill
it: Pendio

source: Dungeon Blocks
it: Ostruzione Sotterranea

source: Dungeon Crawling
it: A Carponi nel Sotterraneo

source: The Entrance
it: L'Entrata

source: Eerie Arbor
it: L'Albero Misterioso

source: Fast Lane
it: Corsia Veloce

source: Flooded Caverns
it: Caverne Sommerse

source: Foreboding Forest
it: La Foresta del Presagio

source: Ahh, what a beautiful .. ..Afternoon?!
it: Ahh, che bel .. ..pomeriggio!?

source: Oh geez! I overslept!
it: Oh cavolo! Ho dormito troppo!

source: Frogatto's Room
it: Stanza di Frogatto

source: Hey, how's breakfast coming?
it: Hey, quando si fa colazione?

source: Breakfast? ..bud, we're on lunch.
it: Colazione?..E' ora di pranzo, signorino.

source: You need to get up earlier.
it: Dovevi alzarti prima.

source: Okay, then how's lunch coming?
it: OK, allora dov'è il pranzo?

source: Getting there. It's gonna be a while, though.
it: Lo sto preparando Ci vorrà un po' comunque.

source: I'll check back later, then.
it: Allora tornerò più tardi.

source: So, what happened to lunch?
it: Allora che è successo al pranzo?

source: I got tired of waiting, and ate by myself.
it: Mi sono stancato di aspettare, e ho mangiato da solo.

source: Leftovers are in the fridge.
it: Gli avanzi sono nel frigo.

source: Okay, uhm, thanks.
it: Va bene, uhm, grazie.

source: Uhm... yes?
it: Uhm... sì?

source: At least TRY to get a job today, alright?
it: Almeno PROVA a trovare un lavoro oggi, ok?

source: We need some help around here.
it: Abbiamo bisogno di aiuto qui.

source: Yeah, I know. I'll try.
it: Sì, lo so. Proverò.

source: See to it.
it: Fallo davvero.

source: Not like I need to be up,
it: Non ho bisogno di essere sveglio,

source: but it's the principle of the thing.
it: ma almeno è un inizio.

source: Frogatto's House
it: Casa di Frogatto

source: Pato's Room
it: Stanza di Pato

source: I know!
it: Lo so!

source: I can stop in at Nene's house on the way to town!
it: Posso riposare a casa di Nene sulla via per la città!

source: Such a beautiful view from here.
it: Che bel panorama che c'è qui.

source: Nothing to see in my backyard.
it: Niente da vedere nel mio cortile.

source: Frogatto Grotto
it: Grotta di Frogatto

source: Gloomy Glade
it: La Radura Triste

source: Gnarled Knoll
it: La Collinetta Nodosa

source: Grassy Path
it: Sentiero Erboso

source: On this level, we give advice on how to play. Each question mark has its own hint.
it: In questo livello, ti diamo consigli su come giocare. Ogni punto di domanda ti darà un suggerimento.

source: If you already know how to play, then just walk to the next level.
it: Se sai già come giocare, corri semplicemente al prossimo livello.

source: To save your progress in the game, use one of these convenient restrooms.
it: Per salvare i vostri progressi nel gioco, utilizzare uno di questi comodi servizi igienici.

source: Some changes in elevation are too high to clear with just a normal jump.
it: Alcuni luoghi sono troppo alevati per essere raggiunti con un normale salto.

source: Fortunately, Frogatto can jump off of walls, too!
it: Per fortuna, Frogatto può anche saltare sui muri!

source: To do this, do a walking jump into the wall.
it: Per farlo, prendi la rincorsa e salta verso il muro.

source: If you bump into a wall at the crest of a jump, you will cling to the wall and slowly slide down.
it: Se colpisci un muro nel punto di massima altezza di un salto, Frogatto si attaccherà al muro e comincerà a scivolare lentamente.

source: If you don't get a running start, you can still cling on, if you tap the arrow toward the wall, and press jump whilst it's held down.
it: Se non ci arrivi, puoi ancora aggrapparti al muro, saltare e tieni premuto il tasto freccia nella direzione dello stesso.

source: Whilst you are clinging to the wall, pressing jump will make you rebound off.
it: Se fai un salto mentre scivoli sul muro, ti tufferai nella direzione opposta.

source: This is especially useful, if two walls are facing each other, because then you can rebound over and over between them.
it: Questo è particolarmente utile, se due pareti sono uno di fronte all'altra, perché allora puoi rimbalzare una e più volte tra loro fino a raggiungere la cima.

source: This lets you ascend vertical columns.
it: Potrai risalire sulle colonne.

source: Frogatto's world is a dangerous place.
it: Il mondo di Frogatto è pericoloso.

source: In his travels, you'll encounter many creatures who want to hurt you.
it: Nei tuoi viaggi, incontrarai molte creature che vogliono farti del male.

source: It's often fine to just avoid them, but if you have to fight, Frogatto's best defense is his tongue.
it: Spesso è meglio evitarle, ma se dovrai combattere, la miglior difesa di Frogatto è la sua lingua.

source: You can grab enemies with the tongue, and then spit them back out.
it: Puoi prendere i nemici con la lingua, per poi risputarli fuori.

source: Once spat out, they become a deadly projectile.
it: Una volta sputati, diverranno proiettili mortali.

source: If they don't hit anything, they'll be stunned momentarily, and then will flip upright again.
it: Se non colpiranno nulla, rimarranno storditi per un attimo; dopodiché torneranno in loro.

source: Whilst on their backs, they're vulnerable to being stomped on.
it: Mentre sono capovolti, puoi saltare loro sopra.

source: Sticking out the tongue and spitting, are both done with the attack key.
it: Puoi usare la lingua e sputare col tasto di attacco.

source: There are a few ants just ahead. Feel free to try this on them.
it: Poco più in là ci sono delle formiche. Sentiti libero di provare su di loro.

source: And don't worry - if you die, you'll restart right here.
it: E non preoccuparti - se muori, ricomincerai da qui.

source: A very useful fact is that you can control the direction in which enemies are spat.
it: Inoltre, cosa molto utile, puoi controllare la direzione in cui i nemici vengono sputati.

source: If you hold down the up key while pressing the attack button, you'll spit in a high arc.
it: Se premi il tasto sù mentre premi il tasto di attacco, sputerai in alto lungo un arco alto.

source: If you hold down the down key while pressing the attack button, you'll spit with very little force.
it: Se premi il tasto giù mentre premi il tasto di attacco, sputerai con pochissima forza.

source: You should also beware that not all enemies can be grabbed with the tongue.
it: Dovi tener conto che non tutti i nemici possono essere afferrati con la lingua.

source: Different enemies present different challenges, and you'll need to get creative to deal with them.
it: Diversi nemici presentano differenti sfide, e per avere a che fare con loro avrai bisogno di essere creativo.

source: Also, the tongue can grab useful items, like keys. This is how you carry them to the lock they open.
it: Inoltre, la lingua può afferrare oggetti con svariate utilità, ad esempio le chiavi. Questo è il modo in cui si portano con te per apre le svariate serrature.

source: Fountains, and other water dispensers, are very helpful.
it: Le fontane, e altre fonti d'acqua, sono molto utili.

source: If you drink from them, you will restore all of your health!
it: Se berrai da loro, ripristinerai tutta la tua salute!

source: Certain bridges and stairways, like this one, allow you to jump up and pass through them.
it: Alcuni ponti e scale, come questa, consentono di saltare in alto e di passarvi attraverso.

source: You can also jump down through them.
it: Puoi anche buttarti di sotto.

source: A special button will appear, whenever this is possible.
it: Un apposito pulsante apparirà, ogni qualvolta sia possibile.

source: To do so, hold down the down key, and then press jump.
it: Per farlo, premi il tasto giù, e premi salto.

source: There is a store conveniently located outside of the town.
it: C'è un negozio molto comodo giusto fuori città.

source: Sometimes, you'll run into rather dangerous- looking terrain, such as these brambles.
it: Potresti incontrare porzioni di terreno piuttosto pericolose, come questi rovi.

source: As you'd expect, stepping on them would hurt a bit.
it: Come ti puoi aspettare, attraversandoli ti potresti fare male.

source: However, they also hurt your enemies!
it: Tuttavia, pure i tuoi nemici si faranno male!

source: Leading or spitting them onto harmful terrain is an excellent way to dispatch them.
it: Ci sono due ottimi modi per eliminarli uno è quello di portarli verso zone pericolose l'altro è quello di sputarli direttamente.

source: Beware also, any bottomless pits you encounter. Those are immediately fatal.
it: Fai inoltre molta attenzione ad ogni pozzo senza fondo che incontrai. Questi saranno immediatamente fatali.

source: Up ahead, you'll notice an anthill, which ants constantly come out of.
it: Proseguendo, troverai un nido di formiche, dal quale escono formiche continuamente.

source: There is no way to stop this; you can't destroy the anthill.
it: Non c'è modo di impedirlo; non puoi distruggere il nido.

source: Some hazards are like this. You simply have to work around them.
it: I pericoli come questi dovranno essere aggirati.

source: That's it for this tutorial.
it: Il tutorial è finito.

source: Although there's more to playing the game, the rest, we can safely let you learn on your own.
it: Malgrado ci sia di più a riguardo del gioco, possiamo tranquillamente lasciarti imparare da solo.

source: Feel free to come back here, if you want to read a hint again.
it: Sentiti libero di tornare qui in qualunque momento, per leggere nuovamente i consigli.

source: Have fun!
it: Divertiti!

source: If you've seen a conversation before, it might be annoying to have to read it again.
it: Se hai già visto una conversazione, ti potrebbe seccare doverla leggere nuovamente.

source: You can skip a conversation, including parts of cutscenes, by pressing the "escape" key.
it: Premendo il tasto "escape" puoi saltare una conversazione, sequenze animate incluse.

source: And yes, this applies to the question marks on this level, too.
it: E sì, questo è valido per tutti i punti di domanda presenti pure in questo livello.

source: If you haven't already noticed, the red fruits you sometimes find nestled in the grass are spittable projectiles.
it: Se non lo avete già notato, i frutti rossi che a volte si trovano nascosti nell'erba sono proiettili sputabili.

source: You'll find many such objects of similar size in different areas of the game, such as crates inside of houses, or nuts hanging from trees.
it: Troverai molti oggetti di simili dimensioni in diverse aree del gioco, come casse all'interno di case, o noci appese agli alberi.

source: These are an ample source of ammunition, that's almost always available.
it: Queste sono un'ampia fonte di munizioni, che sono quasi sempre disponibili.

source: Note that these have an unusual property; if you use them up, walk away from the screen where you found them, and then return again, there will often be a new one waiting to use.
it: Da notare che questi hanno una proprietà inusuale, se li termini, allontanatidalla posizione dove li hai trovati, e poi ritornaci, ne comparirà spesso uno nuovo in attesa di poter essere utilizzato.

source: Hanging Platforms
it: Le Piattaforme Sospese

source: I'd better be careful.
it: Farò meglio a stare attento.

source: This is a very deep chasm...
it: Questo sì che è un baratro profondo...

source: AAAAAAH! I CAN'T FLY!
it: AAAAAAH! NON SO VOLARE!

source: Hidden Depths
it: Le Profondità Nascoste

source: Killer Bunnies
it: Coniglietti Assassini

source: Hello there.
it: Hey, ciao!

source: That's nice.
it: Ottimo.

source: Hey, what's new?
it: Hey, novità?

source: Oh, just cleaning up after that ruckus.
it: Oh, sto solo mettendo tutto a posto, dopo quel putiferio.

source: So nice to have things back to normal.
it: Sono così contento che tutto sia tornato alla normalità.

source: You bet.
it: Ci puoi scommettere.

source: Speaking of which, am I imagining it or is this house actually smaller now?
it: A proposito, me lo sto solo immaginando o questa casa è diventata più piccola?

source: Of course not. That's just nutty.
it: Ovviamente no. Cosa vai a pensare?

source: Where's your sibling, by the way?
it: A proposito, dov'è il tuo gemello?

source: At the store.
it: Al negozio.

source: I see.
it: Capisco...

source: Lobby
it: Ingresso

source: World Map
it: Mappa del Mondo

source: No! You can't be...
it: No! Tu non puoi essere...

source: Hi, I'm Frogatto.
it: Ciao, sono Frogatto.

source: Oh crap, oh crap! Boss! He's here!
it: Oh merda, oh merda! Boss! Lui è qui!

source: Who's here?
it: Chi è qui?

source: Frogatto! He's RIGHT HERE!
it: Frogatto! Lui è PROPRIO QUI!

source: The intruder? How did he get in here?
it: L'intruso? Come ha fatto ad entrare?

source: We... We tried to stop him, but he's...
it: Noi... Abbiamo provato a fermarlo, ma lui...

source: Why do I have to deal with everything myself?!
it: Perché devo fare tutto da solo?!

source: Get out of the way!
it: Togliti di mezzo!

source: Ugh! You do put up quite a fight!
it: Ugh! Hai combattuto piuttosto bene!

source: Will you hear me out now?
it: Ora mi darai ascolto?

source: Yes.
it: Si.

source: What was it you wanted?
it: Cosa volevi?

source: I wanted to ask you about that incident in town.
it: Volevo chiederti di quell'incidente in città.

source: Remarkable. I really thought you'd come here to attack me.
it: Notevole. Ho pensato che saresti davvero venuto qui per attaccarmi.

source: Well, if you really are here for an audience, perhaps I could be obliged. Shall we?
it: Beh, se sei davvero qui per un udienza, forse potrei esserne obbligato. Andiamo?

source: Talk it over? Like gentlemen?
it: Parlarne? Come gentiluomini?

source: Yes, like gentlemen. Over tea.
it: Sì, come gentiluomini. Sorseggiando un thé.

source: Wait a minute, it's you, isn't it?
it: Aspetta, sei tu, vero?

source: Yup, I'm Frogatto!
it: Yup, sono Frogatto!

source: Uhh.. I was expecting something a bit more ... robust.
it: Uhh .. Mi aspettavo qualcosa di più ... robusto.

source: So you're the one who's been causing all this trouble, eh?
it: Quindi tu sei quello che ha causato tutti questi problemi, eh?

source: I am?
it: Io?

source: Yes, I've been getting some rather unpleasant reports about property damage.
it: Sì, ho ricevuto alcuni rapporti piuttosto sgradevoli sui danni alla proprietà.

source: Is there any chance I... can discuss something with you?
it: C'è qualche possibilità che io ... possa discutere di qualcosa con te?

source: Sure...
it: Certamente ...

source: ...but the subject's going to be: "What happens to trespassers."
it: ... Ma l'argomento sarà: "Cosa succede a trasgressori."

source: Milgram's Throne Room
it: Sala del Trono di Milgram

source: Pinecone Park
it: Il Parco delle Pigne

source: These crazy bombers are everywhere!
it: Questi bombardieri pazzi sono ovunque!

source: Plagued Mine
it: La Miniera Infestata

source: Rock-a-Fort
it: Rocca-Forte

source: Woah! A flying plant!
it: Wow! Una pianta volante!

source: Bleh. A locked door.
it: Bleh. Una porta chiusa.

source: There must be a way around it.
it: Ci deve essere un modo per passarla.

source: Rocky Roots
it: Radici di Pietra

source: A pleasure to meet you. I am Mortimer.
it: Piacere di conoscerti. Sono Mortimer.

source: Uhm, I hope you don't mind my asking, but what on earth ARE you, anyway?
it: Uhm, spero che la domanda non ti offenda, ma che diavolo SEI tu?

source: Ostensibly, I am a mole.
it: A quanto pare, sono una talpa.

source: ... Okay.
it: ... Ok.

source: Perhaps more importantly, I am a bit of an astronomer and biologist, by trade.
it: In ogni caso, sono in parte un astronomo e in parte un biologo.

source: That is why I live all the way up here. You can see quite a bit from this height.
it: Perciò vivo isolato a questa altitudine. Puoi vedere un sacco di cose da quassù.

source: ...and I guess you have these ants in cages to study them?
it: ... e immagino che queste formiche siano in gabbia per i tuoi studi...?

source: That's right. Unfortunately, my collection lacks the rarer golden ant.
it: Corretto. Sfortunatamente, alla mia collezione manca la rarissima formica dorata.

source: Oh, what a shame.
it: Oh, che peccato.

source: You know, you look rather well-traveled. If you could bring me a golden ant and stick it in one of my cages, I'd reward you handsomely.
it: Sai, sembri un tipo vissuto. Se tu mi portassi una formica dorata e la chiudessi in una delle mie gabbie, ti ricompenserei favolosamente.

source: Handsomely you say? I'm on it!
it: Hai detto favolosamente? Lo farò!

source: Oh! You got the golden ant for me. It's beautiful, beautiful!
it: Oh! Mi hai portato la formica dorata. Meraviglioso, meraviglioso!

source: Oh my! If that's a golden ant in your stomach, then quick, spit it out into the cage!
it: Oh mio...! Se quella è una formica d'oro nel tuo stomaco, sputala velocemente nella gabbia!

source: I don't suppose you've had any luck with getting a golden ant yet?
it: Suppongo tu non abbia ancora trovato nessuna formica dorata, giusto?

source: I'm working on it. Those things pack a pretty mean bite, you know.
it: Ci sto lavorando su. Quegli animali hanno un morso niente male, sai?

source: I do hope you are enjoying exploring the island. There are so many wonderful creatures on it.
it: Spero tu ti stia divertendo ad esplorare l'isola. Ci si possono trovare così tante meravigliose creature.

source: ... most of which seem inclined to kill me.
it: ... la maggior parte dei quali sembrano propensi ad uccidermi.

source: I say! Who's there?
it: Ehi! Chi è là?

source: Secluded Hut
it: La Capanna Isolata

source: Are you quite alright?
it: Stai bene?

source: Yeah. Who WAS that guy?!
it: Si... Chi ERA quel tizio?!

source: One of Milgram's henchmen, no doubt.
it: Senza dubbio uno scagnozzo di Milgram.

source: They may have seen me talking to you, I can't be sure.
it: Potrebbero avermi visto parlare con te, non posso essere sicuro.

source: Wait, what? Milgram?
it: Aspetta, cosa? Milgram?

source: What's he doing on this side of the island?
it: Che sta facendo su questo lato dell'isola?

source: You still haven't heard, then.
it: Dunque non sai ancora nulla.

source: Milgram's men showed up early this morning, in town. They've taken the whole place hostage!
it: Gli uomini di Milgram si sono presentati in città questa mattina presto. Hanno preso in ostaggio l'intero paese!

source: Unfortunately, I don't know the details. I just flew out of there as soon as I could, looking for anyone who could help.
it: Non conosco i dettagli. Sono scappato appena ho potuto, per cercare aiuto.

source: That certainly... changes my plans for the day.
it: Questo sicuramente... sconvolge i miei piani per oggi.

source: Wow, uhm... I'd sure like to help, but ... I just don't see what I could do.
it: Wow, uhm ... Mi piacerebbe certamente aiutare, ma ... Non vedo cosa potrei fare.

source: I don't think I can promise anything, but if the opportunity presents itself, who knows?
it: Non credo di poter promettere nulla, ma se si presenterà l'opportunità magari... Chi lo sa?

source: Yes, it's unreasonable to expect someone to just charge in there.
it: Sì, è stupido aspettarsi che qualcuno si precipiti laggiù.

source: I'm at a loss for a plan, myself.
it: Sono a corto di piani, attualmente.

source: Nevertheless, I'd better be going. Hopefully, we'll fix that bridge soon. Impressive how fast they can do that, with modular construction and all.
it: In ogni caso, farò meglio ad andare. Speriamo che riparino in fretta il ponte. Incredibile quanto possono essere veloci con la costruzione di prefabbricati.

source: In the meantime, you might benefit from visiting the fellow who lives here.
it: Intanto, ti conviene visitare il tizio che vive qui.

source: Bit of a recluse, but he's quite sharp. He lives on top of this rock column.
it: Tipo piuttosto asociale, ma molto sveglio. Vive in cima a questa colonna di roccia.

source: And I get up there... how?
it: E come diavolo ci arrivo lassù?

source: Simple, just take to the air!
it: Semplice, prendi il volo!

source: You ... do realize I can't fly?
it: Tu... capisci che non posso volare?

source: Splash, Hop
it: Tuffi e Salti

source: Starlit Cave
it: La Caverna Stellata

source: Stonepipe Meadow
it: Prato di Roccialunga

source: Programmer • Sound and iOS Code
it: Programmatore • Suono e codice iOS

source: Minor Object Scripter and Level Designer
it: Minor Object Scripter e Level Designer

source: Documentation Lead
it: Direttore della documentazione

source: Object Scripter • Props and Achievements
it: Scripter oggetto • Oggetti di Scena e Realizzazioni

source: Engine Improvements
it: Miglioramenti del motore

source: Lead Programmer
it: Capo Programmatore

source: Artist • Props
it: Artista • Oggetti di Scena

source: Artist • Characters, Monsters, and Props
it: Artista • Personaggi, Mostri e Oggetti di Scena

source: Artist • House interiors and exteriors
it: Artista • Interni ed esterni case

source: Level Designer • forest, cave, and dungeon levels
it: Designer • Livello foresta, caverna, e livelli dungeon

source: Translation Coordinator
it: Coordinatore della Traduzione

source: Translation Code
it: Traduzione Codice

source: Key Remapping Code
it: Rimappatura chiave del codice

source: Our Players
it: I nostri giocatori

source: Technical Advice
it: Avviso Tecnico
