Repository: frogatto/Cube_Trains_Redux
Catalog: modules/frogatto/po/*.po
Languages: it

source: Directions
it: Direzioni

source: Jump
it: Salto

source: Tongue
it: Lingua

source: Attack
it: Attacco

source: Back
it: Indietro

source: Achievement Unlocked!
it: Obiettivo Sbloccato!

source: Initializing custom object functions
it: Inizializzazione delle funzioni dell'oggetto personalizzato

source: Initializing tiles
it: Inizializzazione delle immagini

source: Initializing GUI
it: Inizializzazione dell'Interfaccia Grafica

source: Loading level
it: Caricamento Livello

source: Music Volume:
it: Volume Musica:

source: Sound Volume:
it: Volume Effetti:

source: Resume
it: Riprendi

source: Controls...
it: Controlli...

source: Return to Titlescreen
it: Ritorna al menu titoli

source: Exit Game
it: Esci

source: Reverse A and B
it: Inverti A e B

source: Version 1.2:
it: Versione 1.2:

source: Complete redo of attack logic; frogatto now is free to walk around whilst he attacks, and in general is much more responsive.
it: Rifacimento completo della logica d'attacco; frogatto, ora, è libero di andare in giro, mentre attacca, ed in generale è molto più reattivo.

source: Frogatto's tongue-grabbing is MUCH more forgiving
it: La presa della lingua di Frogatto è MOLTO più indulgente

source: Complete rewrite of damage handling; much more consistent now, and categorically eliminates some bugs where damage wouldn't get dealt.
it: Completa riscrittura la gestione dei danni, ora molto più coerente, e categoricamente eliminti alcuni bug dove il danno veniva ignorato.

source: Reworked some tilesets to eliminate tiling errors.
it: Rielaborato alcuni tileset per eliminare gli errori di posizionamento.

source: Further enhancements to dungeon wall graphics (added edges).
it: Ulteriori miglioramenti alla grafica dei muri del dungeon (bordi aggiunti).

source: New, more readable dialogue font.
it: Nuovo, font per un dialogo più leggibile.

source: Lots of small graphical tweaks.
it: Un sacco di piccole modifiche grafiche.

source: Maps are now strewn with spittable props within easy reach.
it: Le mappe sono ora disseminate di oggetti sputabili facilmente raggiungibili.

source: Rewrote most of the dialogue.
it: Riscritto la maggior parte dei dialogo.

source: Collectible items like coins can be collected by being touched by the tongue, besides just frogatto's body.
it: Tutti gli oggetti collettibili, come le monete, possono essere raccolti toccandoli con la lingua, oltre che con il corpo di frogatto.

source: Redrew the world map.
it: Ridisegnata la mappa del mondo.

source: Added a few new monsters, like the red hornbugs, and completely rewrote how bats behave.
it: Aggiunti alcuni nuovi mostri, come lo scarabeo rosso, completamente riscritto il comportamentono dei pipistrelli.

source: Fixed a bug that caused a black line in the seaside background during dialogues.
it: Aggiustato un bug che durante i dioaloghi mostrava una linea nera nello sfondo marino.

source: Fixed a bug that caused some tiles to incorrectly be flagged as opaque.
it: Aggiustato un bug che impostava erroneamente alcune tiles come opache.

source: Version 1.1.1:
it: Versione 1.1.1:

source: Fixed some crashing bugs.
it: Corretti alcuni crash.

source: Fixed The Long Haul (compiled mode)
it: Risolto La strada è bloccata (modalità compilata)

source: Fixed instructions on titlescreen (iOS)
it: Risolto istruzioni sul titlescreen (iOS)

source: New translation: Italian
it: Nuova traduzione: Italiano

source: Added automatic language selection for Windows
it: Aggiunta la selezione automatica della lingua per Windows

source: Complete redo of iOS controls, switching to a 2-button dpad from a 4-button. Eliminates all problems with mispressed up or down keys interrupting other actions.
it: Rifacimento completo dei comandi IOS, passaggio da un 2-pulsanti dpad an un 4-pulsanti. Eliminati tutti i problemi di interruzione delle azioni con la pressione sbagliata dei tasti alto o in basso.

source: Version 1.1:
it: Versione 1.1:

source: Added arcade mode.
it: Aggiunta la modalità arcade.

source: Redid graphics for forest trees.
it: Alberi della foresta ridisegnati.

source: Redid graphics for forest background
it: Sfondo foresta ridisegnato

source: Redid graphics for dungeon wall tiles
it: Muri del dungeon ridisegnati

source: Redid graphics for basement wall tiles
it: Muri del seminterrato ridisegnati

source: Added a bunch of interior props
it: Aggiunti parecchi oggetti di scena

source: Reworked "darkness" for improved appearance
it: Rielaborato "buio" per migliorare l'aspetto

source: Added new palettes to forest and seaside areas.
it: Aggiunte nuove tavolozze per le aree foresta e mare.

source: Added some unique enemies to the forest.
it: Aggiunti alcuni nemici unici alla foresta.

source: Refactored damage and monster type systems to make behavior more consistent and eliminate some rare buggy behavior.
it: Refactoring della gestione dei danni e del tipo di mostro per rendere il comportamento più coerente e di eliminare alcuni rari bugs.

source: Added translation support, with 4 complete translations: French, Brazilian Portuguese, Chinese (Simplified), and Japanese.
it: Aggiunto il supporto di traduzione, con 4 traduzioni complete: Francese, Portoghese Brasiliano, Cinese (semplificato) e Giapponese.

source: Version 1.0.3:
it: Versione 1.0.3:

source: Fixed crash when picking up max heart pieces.
it: Corretto il crash che avveniva quando si raccoglieva i pezzi massimo cuore.

source: Other small bug fixes.
it: Altre piccole correzioni dei bug.

source: Version 1.0.2:
it: Versione 1.0.2:

source: Added support for "darkness" in levels.
it: Aggiunto il supporto per l' "oscurità" nei livelli.

source: Added support for WVGA.
it: Aggiunto il supporto per WVGA.

source: Made player status not show on the titlescreen or world map.
it: Reso non visibile lo stato del giocatore nella schermata principale e la mappa del mondo.

source: Made golden ants less ambiguous.
it: Madalità formiche d'oro meno ambigua.

source: Fixed bug making certain music always play at full volume (iPhone).
it: Corretto il bug che impostava sempre al massimo il volume alcuni brani (iPhone).

source: Added option to reverse positions of A and B buttons (iPhone).
it: Aggiunta l'opzione per invertire le posizioni dei pulsanti A e B (iPhone).

source: Added support for repeating levels (for arcade modes).
it: Aggiunto il supporto per ripetere i livelli (per le modalità arcade).

source: Pressing jump while in the air pressing against a wall now makes you cling to the wall.
it: Ora saltando contro un muro resterai aggrappato allo stesso.

source: Made it so you can skip dialogs sequences.
it: Reso così si può saltare sequenze di dialoghi.

source: Fixed lots of z-order issues.
it: Risolti un sacco di problemi di z-order.

source: Fixed bug causing ambient sounds to not work.
it: Corretto il bug che impediva ai suoni ambientali di funzionare.

source: Improved forest background, and made it go upwards infinitely.
it: Lo sfondo della foresta è stato migliorato notevolmente portandolo ad una elevata qualità.

source: Made hearts heal a full heart, rather than just half.
it: Si è fatto in modo che i cuori di cura forniscano un cuore pieno, piuttosto che solo la metà.

source: Changed tilesets to make water look better.
it: Tileset modificato per donare all'acqua un aspetto migliore.

source: Many small bug fixes.
it: Molte piccole correzioni dei bug.

source: Version 1.0.1 (iPhone only):
it: Versione 1.0.1 (solo iPhone):

source: Significantly improved controls, both functionally and graphically (iPhone).
it: Migliorati significativamente i controlli, sia funzionale che grafico (iPhone).

source: Fixed auto-saving on iOS4 where multitasking is supported (iPhone).
it: Corretto auto salvataggio sul iOS4 dove è supportato il multitasking (iPhone).

source: Fixed bug where a dialog could repeat forever.
it: Corretto errore che poteva far ripetere all'infinito un dialogo.

source: Fixed crash in world map when you hold down while entering it.
it: Corretto il crash nella mappa del mondo quando si tiene premuto il tasto giù mentre si entra.

source: Fixed fullscreen mode (Mac/Windows).
it: Corretta modalità a schermo intero (Mac / Windows).

source: Fixed controlpad issues for computers.
it: Risolti i problemi con il ControlPad per computer.

source: Added music and sound volume controls to pause screen.
it: Aggiunti, gioco in pausa, i controlli per il volume della musica e dei suoni.

source: Added customizable controls.
it: Aggiunta personalizzazione controlli.

source: Added half-hearts.
it: Aggiunti mezzi cuori.

source: Added scons script for compiling.
it: Aggiunto scons script per la compilazione.

source: Minor level changes.
it: Cambiamenti minori ai livelli.

source: Updated music.
it: Aggiornamento musica.

source: NOW WITH BETTER CONTROLS:
it: ADESSO CON CONTROLLI MIGLIORATI:

source: Frogatto is a classic-style 2d adventure game, starring a certain quixotic frog. It's made by the same team that brought you Battle for Wesnoth, and features the same handcrafted love of high-end pixel art. Frogatto is a side-on "platformer" or "jump and run" game, where you lead our titular character on a humdrum errand that turns into a daring adventure.
it: Frogatto è un classico gioco d'avventura 2D, con una rana idealista come protagonista. È sviluppato dallo stesso team di Battle for Wesnoth e include lo stesso amore per la grafica artigianale di alto livello. Frogatto è un gioco a scorrimento "platform" o "jump and run", nel quale il nostro protagonista viene guidato in una noiosa commissione che si trasforma in un'audace avventura.

source: Frogatto's key mechanic is an unusual twist; like any frog, he jumps, swims, and snags bugs with his tongue, but unlike any frog before him, can spit those bugs out with deadly force. Not merely an action game, frogatto is a full, classic adventure game, with characters to talk to, things to buy, puzzles to solve, and a wide, complex world to explore.
it: la meccanica di Frogatto è un insolito intreccio: come tutte le rane può saltare, nuotare e acchiappare insetti con la lingua, ma diversamente da tutte le rane prima di lui, può sputare questi insetti con forza mortale. Non è un semplice gioco d'azione, Frogatto è un gioco d'avventura classico e completo, con personaggi con cui parlare, oggetti da comprare, enigmi da risolvere e un mondo ampio e complesso da esplorare.

source: Features:
it: Caratteristiche:

source: - grab enemies with your tongue and spit them to deal damage
it: - acchiappa i nemici con la tua lingua e sputali per infliggere danni

source: - buy powerups to enhance and unlock new abilities
it: - compra potenziamenti per sviluppare e sbloccare nuove abilità

source: - arcade mode, giving instant access to action-only gameplay on randomized levels
it: - modalità arcade, accesso immediato all'azione in livelli casuali

source: - forgiving savegame/respawn system so you don't have to be afraid of losing progress
it: - clemente sistema di salvataggio e rinascita, non aver più paura di perdere i progressi col gioco!

source: - playful dialogue writing that tries not to insult your intelligence
it: - dialoghi vivaci che cercano di non insultare la tua intelligenza

source: - massive soundtrack with over an hour of original music
it: - imponente colonna sonora: oltre un'ora di musiche originali

source: - sprawling, complex world with over 50 levels to explore, and tons of secrets to find
it: - un mondo tentacolare e complesso con oltre 50 livelli da esplorare e migliaia di segreti da scoprire

source: To find out more about the game please visit http://www.frogatto.com/
it: Per scoprire di più sul gioco, visitate il sito http://www.frogatto.com/

source: Reviews:
it: Recensioni:

source: - [3/4 SlideToPlay.com] "a fun and surprisingly deep platformer"
it: - [3/4 SlideToPlay.com] "un platform divertente e sorprendentemente intenso"

source: - [4/5 AppSpy.com] "boy-howdy is this an amazing visual feast!"
it: - [4/5 AppSpy.com] "Dannazione se non è una festa per gli occhi!"

source: - [n/a TouchArcade.com] "totally worth checking out."
it: - [n/a TouchArcade.com] "vale proprio la pena di dargli un'occhiata."

source: keywords:
it: parole chiave:

source: platformer,pixelart,oldschool,platform,game,pixel,arcade,action,adventure,frog
it: piattaforma,pixelart,anni 80,gioco,pixel,arcade,azione,avventura,rana

source: Pocket Money
it: Soldi

source: Collect ten coins.
it: Raccogli dieci monete.

source: Put a water beetle back in water.
it: Rimetti un coleottero in acqua.

source: Nice Try...
it: Bel tentativo...

source: But that's not a secret area.
it: Ma quella non è un area segreta.

source: Collect all the coins.
it: Raccogli tutte le monete.

source: Speed Trader
it: Commerciante Veloce

source: Playing the economy game, eh?
it: Stai per aprire un banca, eh?

source: Speedrun
it: Corri

source: Complete the game within 1 hour.
it: Completa il gioco entro 1 ora.

source: Win!
it: Vinto!

source: Congratulations, you just won the game!
it: Congratulazioni, hai appena vinto il gioco!

source: Rampage!
it: Furia!

source: Kill 5 enemies in 10 seconds.
it: Uccidi 5 nemici in 10 secondi.

source: Cube Chain
it: Catena Cubica

source: Collect 15 points cubes in a row.
it: Raccogli 15 punti cubi di fila.

source: Grudge
it: Astio

source: Kill 10 of the same type of enemy in a row.
it: Uccidi 10 nemici dello stesso tipo di fila.

source: Jackalope
it: Lepre cornuta

source: Bound, bound, bound and rebound!
it: Balzare, saltare, lanciarsi e rimbalzare!

source: Try to eat all kinds of enemies.
it: Prova a mangiare tutti i tipi di nemici.

source: Dream on...
it: Continua a sognare ...

source: That's the infinite cage.
it: Questa è la gabbia infinita.

source: Geosynchronous Orbit Achieved
it: Raggiunta orbita geosincrona

source: Now applying artificial gravity.
it: Attivazione della gravità artificiale.

source: Not Without My Hat!
it: Mai senza il mio cappello!

source: Start a level with no health left.
it: Avviare un livello senza salute rimanente.

source: Stonepipe Bridge
it: Ponte di Pietralunga

source: Ambush!
it: Imboscata!

source: Victory!
it: Vittoria!

source: This is a new high score!
it: Questo è un nuovo record!

source: Blocks Run
it: Corsa dei Blocchi

source: Down the Rabbit Hall
it: Giù nella Tana del Coniglio

source: Maintenance Shaft
it: Pozzo di Manutenzione

source: The Long Haul
it: La Lunga Camminata

source: Upper Deck
it: Ponte superiore

source: Wild New Wonder
it: Stupore Selvaggio

source: Bombing Fools
it: Buffoni al Bombardamento

source: Well, you made it!
it: Bene, ci sei riuscito!

source: If you wanted a personal audience, sneaking in is probably the best bet. I doubt the entrance guards would give you the time of day.
it: Se vuoi un'udienza personale, entrare di soppiatto è probabilmente la scelta migliore. Dubito che le guardie all'ingresso si comportino amichevolmente lasciandoti entrare.

source: Yeah... geez though. Caves, now? Are these caves long?
it: Sì ... caspita però. Ora le grotte? Quanto sono grandi queste grotte?

source: I'm afraid so.
it: Temo di sì.

source: Ugh. No sense in turning back now, though.
it: Ugh. Adesso non ha alcun senso ritornare indietro.

source: Are you really certain you want to do this? I'm afraid I can't follow you into the caverns, so this is the last you would see of me.
it: Sei veramente sicuro di volerlo fare? Temo di non poterti seguire nelle caverne, quindi questa è l'ultima che ci vediamo.

source: Yes, I am; I'd be twice the fool, to come this far and just give up.
it: Sì, ne sono certo, sarei il doppiamente sciocco, essere arrivato a questo punto e lasciar perdere.

source: Nevertheless, thank you very much for all your help!
it: Tuttavia, ti ringrazio molto per il tuo aiuto!

source: Bon Bosque
it: Il Buon Bosco

source: Bug Mining
it: A Caccia di Insetti

source: Burn and Bubble
it: Fuoco e Spuma

source: I need to go up... There must be a way to activate this elevator.
it: Devo salire... Ci deve essere un modo per attivare questo ascensore.

source: Burning Stone
it: La Roccia Bruciante

source: Caverns of Holes
it: La Caverna dei Buchi

source: Oh hey, I hadn't seen you here before.
it: Oh, hey, non ti avevo mai visto da queste parti.

source: Ah, yeah, I help Chopple at taking care of the store. He had asked me to go to the village to know what was going on, with all that noise that was coming from beyond the cave.
it: Ah, sì, aiuto Chopple a prendersi cura del negozio. Mi aveva chiesto di andare al villaggio per capire cosa stesse capitando, con tutto quel rumore che veniva da oltre la grotta.

source: Then I suppose that Milgram's guards saw you and locked you up?
it: Allora suppongo che le guardie di Milgram ti abbiano visto e poi rinchiuso?

source: Yeah! And to think that I thought that the day was going to be boring!
it: Si! E pensare che credevo che la giornata sarebbe stata noiosa!

source: Chopple's General Store
it: Il negozio di Chopple

source: Hi, again.
it: Di nuovo ciao.

source: So, how did it go?
it: Allora, com'è andata?

source: Could've been worse.
it: Sarebbe potuto andare peggio.

source: That ... uh, "captain" cat, or whoever he was, tried to dice me up.
it: Che ... uh, gatto "capitano", o chiunque fosse, ha cercato di farmi fuori.

source: Naturally, we wouldn't be having this conversation if I hadn't gotten the better of him.
it: Naturalmente, a quest'ora non starei qui a fare questa conversazione se non avesse avuto compassione.

source: So all's well that ends well, I suppose.
it: Quindi, suppongo, tutto è bene quel che finisce bene.

source: I did find out what was going on, at least, that is, what the elder *says* is going on.
it: Almeno, Ho scoperto cosa stava succedendo, che è, ciò che il vecchio *diceva* stesse capitando.

source: I wouldn't mind running this by a few people, since I have no idea what's true, or not.
it: Vorrei chiedere ad alcune di queste persone che cosa ne pensano di questo, dal momento che non ho idea di quale sia la verità.

source: Go right ahead.
it: Vai dritto.

source: So... uhm... loosely speaking, he says that Milgram loaned him money, and this whole incident was Milgram coming to shake him down.
it: Quindi ... uhm ... in senso lato, lui dice che Milgram gli ha prestato i soldi, e questo incidente si deve alla riscossione.

source: Trying to get his money back.
it: Cerca di ottenere indietro i suoi soldi.

source: So then he tells this oddball story about how it's all some plot where Milgram's gonna take over the town.
it: Allora lui racconta questa storia stravagante su come tutto sia un complotto di Milgram per ottenere la città.

source: I've never heard of any of this.
it: Non ho mai sentito parlare di nulla del genere.

source: Really? He's never talked about this?
it: Davvero? Non ha mai menzionato questo?

source: Never.
it: Mai.

source: Has he ever shown any signs of ... suddenly having way more spending money than usual?
it: Ha mai mostrato qualcosa tipo ... spendere più soldi del solito tutto all'improvviso?

source: Well, he's *bragged* about being rich, but that's just his "dignified family" schtick.
it: Beh, si è ​*vantato* di essere ricco, ma questo è dovuto al talento della sua "buona famiglia".

source: He's such a miser, you know - the man would probably burn his furniture just to save on firewood.
it: Lui è un avaro, si sa - l'uomo probabilmente brucerebbe i suoi mobili solo per risparmiare sulla legna da ardere.

source: So, no, he's never seemed to have a dime to spare.
it: Quindi, no, non è mai sembrato avere un centesimo da perdere.

source: He does brag about being known by important people, but you know how he is.
it: Egli si vanta di essere conosciuto da persone importanti, ma si sa come sia in realtà.

source: Yeah. Geez. So, uh, here's what I think we know:
it: Già. Caspita. Quindi, uhm, ecco quello che penso di sapere:

source: We know he's clearly run afoul of Milgram, somehow.
it: In un certo senso, sappiamo che è stato lui a correre da Milgram.

source: We also know Milgram's not interested in taking over the town, because he essentially just did, and gave it up.
it: Sappiamo inoltre che Milgram non è interessato a rilevare la città, perché essenzialmente lo ha appena fatto, e l'ha abbandonata.

source: We don't know if the money thing is true, but we know if it is, he certainly hasn't put it to use.
it: Non sappiamo se la storia dei soldi sia vera, ma sappiamo che se lo è, di certo non l'ha messa in pratica.

source: Oh yeah, I forgot to mention; he said it was some kind of "investment"
it: Oh sì, mi ero dimenticato, lui ha detto che era una sorta di "investimento"

source: Which I assume would be for the town. Building things.
it: Da cui, assumo, sia per la città. Per costruire cose.

source: Naturally, we know that didn't happen.
it: Naturalmente, sappiamo che non è accaduto.

source: So other than that, it's a mystery.
it: Quindi malgrado quello, è un mistero.

source: So, dare I ask: What do we do now?
it: Quindi, oserei chiedere: Che cosa facciamo ora?

source: Ah, that. I went and decided that it's probably a very good idea to do a little diplomacy.
it: Ah, quello. Sono andato e ho deciso che probabilmente, fare un po' di diplomazia, è una buona idea.

source: *Someone* needs to go talk to Milgram, and ask what was wrong, so nothing bad happens.
it: *Qualcuno* deve andare a parlare con Milgram, e chiedere che cosa c'è che non va, in modo da evitare spiacevoli conseguenze.

source: So for a lack of any other willing parties, I decided to go.
it: Così, ho deciso di andarci, vista la mancanza di volontà delle parti.

source: That's very noble of you.
it: E' molto nobile da parte tua.

source: Ha, well, we're also going to find out if it's very foolish, as well.
it: Ah, bene, pure noi stiamo andando a scoprire se è folle.

source: But nothing ventured, nothing gained, you know? I guess I'm just tired of bumming around.
it: Ma lo sai, chi non risica non rosica? Mi sa che sono solo stanco di vagabondare.

source: Speaking of which, I'd been meaning to thank you for your help thus far.
it: A tal proposito, mi era stato detto di ringraziarti per l'aiuto che hai dato finora.

source: I've really appreciated the "eyes in the sky". It's very helpful.
it: Ho molto apprezzato gli "occhi nel cielo". E' di grande utilità.

source: To spare your asking, yes, I'd be happy to continue.
it: Per risparmiarti la domanda, sì, sarei felice di continuare.

source: Hey, thanks, that's really nice of you!
it: Ehi, grazie, è davvero gentile da parte tua!

source: It's the least I can do. I'd offer to carry you, even, but I'm afraid that's physically impossible.
it: E 'il minimo che posso fare. Mi piacerebbe pure portartici, ma temo che sia fisicamente impossibile.

source: I'm as curious as you are, about this, and we're more likely to get to the bottom of things if we work together.
it: Sono curioso quanto te a riguardo e, se lavoriassimo insieme, saremo più propensi ad andare fino in fondo.

source: Awesome!
it: Impressionante!

source: Anyways, I was planning to go through the forest, to start with.
it: Comunque, stavo pensando di passare attraverso il bosco, per iniziare.

source: Does that sound like a good idea?
it: Suona come una buona idea?

source: Yes... it is the only path I know of, but be careful in there.
it: Sì ... è l'unica strada che conosco, ma fai attenzione una volta là.

source: Yeah, no kidding. Well, see you soon! Thanks again!
it: Sì, non scherziamo. Bene, ci vediamo presto! Grazie ancora!

source: Ahh, there you are!
it: Ahh, eccoti!

source: Crevice Bridge
it: Ponte della Crepa

source: What the...
it: Che cosa...

source: You!!
it: Tu!!

source: Yes
it: Si

source: You're an intruder, aren't you?!
it: Sei un intruso, giusto?!

source: I thought so!
it: Io penso di sì!
