Repository: frogatto/Cube_Trains_Redux
Catalog: modules/frogatto/po/*.po
Languages: it

source: There's no fooling me.
it: Non puoi ingannarmi.

source: You look like a very suspicious character.
it: Sembri un tipo molto sospetto.

source: Could you just step aside?
it: Perchè non ti fai da parte e basta?

source: I need to take care of something in town.
it: Devo occuparmi di una cosa in città.

source: Well, I can't let anyone past this gate.
it: Scordatelo, non posso permettere a nessuno di attraversare questa porta.

source: Without this key, you're not getting anywhere.
it: Senza questa chiave, non puoi andare da nessuna parte.

source: Okay. Will you please lend me that key?
it: OK. Allora puoi prestarmi quella chiave?

source: No way! Over my dead body!
it: Assolutamente no! Dovrai passare sul mio cadavere!

source: We can do that.
it: Possiamo farcela.

source: Crevice Village
it: Villaggio della Crepa

source: Hidden Cave
it: La Caverna Nascosta

source: Ahh, good, you made it through there in one piece!
it: Ahh, bene, sei ancora tutto di un pezzo!

source: Yeah, those goons had a little ambush set up.
it: Già, quegli stupidi hanno organizzato una piccola imboscata.

source: So, now what?
it: Ed adesso cosa c'è?

source: Well, as you know, the town is split into two halves.
it: Bene, come sai, la città è divisa in due parti.

source: Milgram has this half of the town locked down tight, and he has most of the residents held prisoner.
it: Milgram tiene questa metà della città sotto stretto controllo, e la maggior parte dei residenti sono tenuti prigionieri.

source: They're tied up inside the houses, under guard. If you free them, I'm sure they can help you.
it: Sono tenuti prigionieri nella case sotto sorveglianza. Se li lbererai, sono sicuro che ti daranno una mano.

source: Makes sense.
it: Sembra una cosa sensata.

source: Your big problem will be that the gate connecting the two halves of town has been locked.
it: Il problema maggiore è che il cancello che collega le due metà della città è stato bloccato.

source: And I don't think there's a guard next to it, whom you can steal the key from.
it: E non credo ci sia una guardia lì vicino a cui tu possa rubare la chiave.

source: Asking one of the prisoners is probably our best bet for a clue.
it: Domandare ai prigionieri è probabilmente la migliore possibilità per trovare un indizio

source: Hey! Over here!
it: Hey! Di qua!

source: Wow, so they seriously just packed up and left? That's amazing!
it: Wow, sono veramente partiti in fretta e furia? Questo è incredibile!

source: Tell me about it.
it: Parlamene.

source: So, how did you get out of your cage?
it: Quindi, come hai fatto ad uscire dalla tua gabbia?

source: Well, they just let me out.
it: Beh, fammi uscire.

source: What?! They ... as in Milgram's kitties?
it: Cosa?! Sono ... i gattini di Milgram?

source: ^Yeah.
it: ^Già.

source: Weird.. that doesn't make any sense! Why would they just let you go?
it: Strano .. non ha alcun senso! Perché avrebbero dovuto lasciarti andare?

source: That seems like an enormous waste of effort.
it: Quello sembra tutto lavoro sprecato.

source: Yeah, this whole day has just been ... bizarre.
it: Sì, l'intera giornata è stata semplicemente ... bizzarra.

source: I've been thinking about that part, and I have a hunch.
it: Ho pensato riguardo a quello, e ho un presentimento.

source: I think the rank-and-file weren't given very specific orders.
it: Penso che i ranghi non avessero ordini specifici.

source: I don't think they were told what they were looking for.
it: Non credo che gli sia stato detto che cosa cercare.

source: I think they were just told to secure the place.
it: Penso che gli fosse stato detto solamente di rendere sicuro il posto.

source: Just arresting everyone is a strange way to do it, but I guess it's not so weird if you've got lots of manpower to spare.
it: Arrestare tutti, pur essendo uno strano modo di fare, non è così strampalato se si ha a disposizione parecchi scagnozi.

source: If they were just looking for the elder and didn't care about ticking people off, it's one way to make sure he couldn't slip away.
it: Quello è stato un controllo a tappeto onde evitare che l'anziano potesse sfuggire nascondendosi tra la gente.

source: Well, is that really who they were after?
it: Beh, è ​​quello che stavano cercando?

source: Yeah, one of their head guys showed me a drawing of him.
it: Sì, uno dei loro pupilli mi ha mostrato la sua immagine.

source: He asked me if I knew who it was.
it: Mi ha chiesto se sapessi chi fosse.

source: That's very interesting...
it: Questo è molto interessante ...

source: Suddenly their motives don't seem so cut and dry.
it: Improvvisamente le loro motivazioni non stanno più in piedi.

source: Strange..
it: Strano ..

source: Anyways, not sure if you heard this part, but I'm about to take a little trip.
it: Comunque, non so se avete sentito questa parte, ma sto per fare un piccolo viaggio.

source: No, I didn't hear this.
it: No, non l'ho sentito.

source: Yeah, I'm a little worried about what might happen if someone doesn't get in touch with Milgram.
it: Sì, sono un po' preoccupati per ciò che potrebbe capitare se qualcuno non contattasse Milgram.

source: That old clown was just sabre-rattling about raising a militia.
it: Quel vecchio clown stava facendo lo spaccone sulla formazione di una milizia.

source: You don't think he could actually pull that off, do you?
it: Non pensi lo possa fare realmente, vero?

source: Nah, this town doesn't have the fire for that. Which is a shame in some ways, but ...
it: Nah, questa città non ha la forza per farlo. Per certi versi è una vergogna, ma ...

source: It's probably for the best, really, I can't imagine the mess if people actually got to fighting over stuff they disagreed about.
it: E probabilmente è meglio così, davvero, non riesco ad immaginare il putiferio che nascerebbe se la gente avesse la forza di combattere per tutte le cose in cui sono disaccordo.

source: I guess I'm also worried about the other end; what Milgram is doing, et cetera.
it: Inoltre sono preoccupato anche per l'altra sponda; cosa stia facendo Milgram, eccetera.

source: I don't know; it's a little crazy to do this, but I've kinda been itching for something worthwhile to do.
it: Non lo so, è una idea pazza, ma è da un po' che sto cercando qualcosa di interessante da fare.

source: Good excuse to get out and travel a bit. See the island.
it: Una buona scusa per uscire e viaggiare un po'. Visitare l'isola.

source: Risky business, though, isn't it?
it: Rischioso però, vero?

source: Oh, no question.
it: Oh, niente domande.

source: Can't be worse than the crap I have to deal with just coming into town, though.
it: Però, non può essere peggio della merda con cui ho avuto a che fare appena sono arrivato in città.

source: Who knows? Maybe something good will come of it?
it: Chi lo sa? Forse qualcosa di buono ne verrà fuori?

source: Well, good luck! I'll be around.
it: Beh, buona fortuna! Rimarrò da queste parti.

source: Hello, again! So ... what now?
it: Nuovamente ciao! Quindi ... ora cosa si fa?

source: It seems like some of the kitties are packing up and leaving, actually.
it: Sembra, in realtà, che alcuni dei gattini stiano preparando le valigie e stiano partendo.

source: That's news to me! Where did you see that?
it: Questa è una novità per me! Dove l'hai visto?

source: Actually, nevermind - I'm just trying to figure out what their intentions are.
it: Lascia stare - sto solo cercando di capire quali sono le loro intenzioni.

source: Well, if you're game to find out, I just saw one of Milgram's lieutenants march up to the elder's house.
it: Beh, se ti interessa, ho appena visto uno dei luogotenenti di Milgram in marcia verso la casa del maggiore.

source: Weird. I wonder what they want with the elder?
it: Strano. Mi chiedo che cosa vogliano dall'anziano?

source: I have a notion, but if you're going to go up there, you'd better go whilst the going's good.
it: Ho un'idea, ma se hai intenzione di andare lassù, è meglio che tu vada finchè la strada è libera.

source: Yeah, I'll check it out.
it: Sì, controllerò.

source: So! I've unlocked this gate, here.
it: Allora! Ho sbloccato questo cancello.

source: Finally, a chance to use your degree...
it: Finalmente, una possibilità di usare il tuo grado ...

source: ...Sorry.
it: ... Mi dispiace.

source: Through there, is the way to where Milgram lives.
it: Per di là, c'è la strada per arrivare al covo di Milgram.

source: If I remember right, one way to his castle will take you... hmm.
it: Se ben ricordo, una direzione per il suo castello ti porterà ... hmm.

source: Uh, this'll take you over a bridge, then through an underground passage.
it: Uh, questo ti porterà ad un ponte, poi attraverso un passaggio sotterraneo.

source: Watch your head in there.
it: Fai attenzione là dentro

source: Past that, and you come to the forest.
it: Attraversalo, e arrivarai nella foresta.

source: I haven't been there in a long time, so I'm not sure what's become of it.
it: Non ci vado da molto tempo, quindi non ho idea di cosa sia successo laggiù.

source: I'm rather out of date on my political geography, so you'll just have to ask people as you go.
it: La mia geografia politica è piuttosto obsoleta, dovrai quindi dovrai chiedere alle altre persone che incontrerai.

source: Uhm... well, don't you have any maps or such? Are you going to help outfit me for this?
it: Uhm ... beh, non hai mappe o simili? Mi aiuterai a trovarne?

source: Nope. You're on your own. Good luck.
it: No. Non ti aiuterò. Buona fortuna.

source: Gee, thanks.
it: Accidenti, grazie.

source: Before we part ways, though, one question:
it: Prima di separarci però, ho una domanda da farti:

source: What are we planning to do about the rest of Milgram's army?
it: Che cosa ne faremo del resto dell'esercito di Milgram?

source: Hey guys!
it: Ciao ragazzi!

source: Oh, hey there! Didn't see you coming.
it: Oh, ciao! Non ti ho visto arrivare.

source: Yeah, I couldn't help but overhear, and ... good news: Your problem is solved!
it: Sì, non ho potuto fare a meno di udire, e ... buone notizie: Il tuo problema è risolto!

source: What do you mean?
it: Che cosa vuoi dire?

source: Milgram's crew. When that captain-guy came out of the house here, they all hopped in his airship and left.
it: Quella è la ciurma di Milgram. Quando quel tizio che fa da capitano uscì da questa casa, tutti quanti se ne andarono entrando nel suo dirigibile.

source: Amazing... if you don't mind, I have a few questions for you.
it: Favoloso ... se non ti disturbo, avrei alcune domande da porti.

source: Well, that settles things for me. You two have fun.
it: Bene, questo sistema le cose per me. Buona giornata.

source: Who are you?
it: Chi sei?

source: That's nutty.
it: Sembri svitato.

source: Yes, well, at this particular juncture, who I am isn't very important.
it: Sì, beh, in questo momento, chiunque io sia non è paricolarmente importante.

source: What's important is that I'm not in a cage, so I might be able to do something to help.
it: Ciò che conta è che non sono più in gabbia, quindi potrei fare qualcosa per aiutare.

source: Got any advice?
it: Hai qualche consiglio?

source: Maybe.
it: Forse.

source: Keep an eye out for it!
it: Tienilo d'occhio!

source: Will do. Catch ya around.
it: Ok. Ci vediamo.

source: Does it look like I have a key for your cage?
it: Ti sembra che forse abbia una chiave per la tua gabbia?

source: Ah, I see.. carry on then.
it: Vedo... vai avanti allora.

source: Hey, Hedge, you alright?
it: Hey, Hedge, tutto bene?

source: Eh, I've been better, but yeah, I'm okay.
it: Mmh, sono stato meglio, ma sì, tutto ok.

source: Besides the obvious cage situation.
it: A parte la ovvia faccenda della gabbia.

source: Yeah. Sad to say, I can't pick locks. I got nothing.
it: Ok. Triste da dire, non so scassinare. Non ho niente.

source: So I'm stuck here, huh?
it: Quindi sono bloccato qui, eh?

source: Yep.
it: Si.

source: Phooey.
it: *Phew*

source: Hmm, you know, I know one thing that might help you..
it: Hmm, sai, ho in mente una cosa che potrebbe aiutarti.

source: There's supposedly a secret room in this house.
it: Credo ci sia una stanza segreta in questa casa.

source: Oh really? Where at?
it: Veramente? Dove?

source: If I knew that, it wouldn't be much of a secret, would it?
it: Se sapessi dov'è, non sarebbe una stanza segreta, non credi?

source: Figures. Well, thanks for the help!
it: Logico. Comunque, grazie per l'aiuto!

source: Good luck!
it: Buona fortuna!

source: Jeez, I *swear* this house didn't look THIS big from the outside!
it: Cavolo, *giuro* questa casa non sembrava grande da fuori!

source: Uh, oh, I hear ... trouble.
it: Uh, oh, ho sentito ... guai.

source: The Elevator House
it: La Casa degli Ascensori

source: Central House
it: Casa Centrale

source: Something's odd about this fireplace.
it: C'è qualcosa di strano in questo camino.

source: Wow, you guys look exactly alike.
it: Wow, voi due sembrate identici.

source: We're twins.
it: Siamo gemelli.

source: Is there anything you can do to help us?
it: C'è qualcosa che puoi fare per aiutarci?

source: Not yet. Sorry.
it: Non ancora. Mi dispiace.

source: Hey, I'm trying to help save the town.
it: Hey, sto cercando di contribuire a salvare la città.

source: Can you give me any advice?
it: Nessun consiglio da darmi?

source: Yeah.
it: Già.

source: The elder's house is off to the east, past the town gate.
it: La casa dell'anziano è ad est, fuori dal cancello della città.

source: We saw Milgram's lieutenant go in there.
it: Abbiamo visto il luogotenente di Milgram laggiù.

source: How interesting.
it: Interresante.

source: The Danger House
it: La Casa del Pericolo

source: Argh! Who in the world would design a house like this?
it: Argh! Chi al mondo avrebbe potuto costuire questa casa?

source: Fan House
it: Casa delle Ventole

source: This is decidedly unpleasant.
it: Questo è decisamente sgradevole.

source: You don't say.
it: Non dirmelo.

source: When I stepped in the door, it locked behind me.
it: Quando ho varcato la soglia della porta si è chiusa dietro di me.

source: That's actually a rather clever way to round everyone up.
it: Davvero un ottimo modo per intrappolare la gente.

source: Know anything helpful about this house?
it: Sai qualcosa di utile su questa casa?

source: Unfortunately I don't. I was just visiting.
it: Sfortunatamente no. Ero solo di passaggio.

source: The floorplan is quite loony.
it: Questa casa è completamente matta.

source: Marvelous ventilation, though.
it: Ottima ventilazione, comunque.

source: Anyways, I'd better be off. I'm trying to sort out this mess.
it: Farei meglio ad andare. Sto cercando di rimediare a questo casino.

source: Good luck.
it: Buona fortuna.

source: How's that business with Milgram going?
it: Come sta andando la faccenda su Milgram?

source: I'm working on it.
it: Ci sto lavorando.

source: That's good to hear!
it: Buono a sapersi!

source: For the last time, we *know* you've got the money somewhere.
it: Per l'ultima volta, *sappiamo* che da qualche parte hai il denaro.

source: Make this easy on yourself.
it: Ce la prenderemo con te.

source: I have no idea what you're talking about.
it: Non ho idea di cosa stiate parlando.

source: Er.. Right, uh, it's over here..
it: Ehm... Ok, uh... Da questa parte...

source: Oh, no you don't!
it: Oh, non lo farai!

source: You're not going anywhere, buster! Now, listen up, You're SERIOUSLY testing my patience.
it: Non state andando da nessuna parte! Ora, ascoltate, state SERIAMENTE mettendo a dura prova la mia pazienza.

source: If you don't tell... uh...
it: Se tu non parli... uh...

source: Oh, hi, what's going on here?
it: Oh, salve, che sta succedendo qui?

source: Who the hell are you?
it: E tu chi diavolo sei?

source: Frogatto, at your service.
it: Frogatto, al tuo servizio.

source: I don't have to put up with this.
it: Non è un mio problema.

source: Excuse me whilst I vent a little frustration.
it: Mi perdoni mentre sfogo un po' di frustrazione.

source: Okay, I've had enough! I'm going home.
it: OK, ne ho avuto abbastanza! Vado a casa.

source: Well! That went better than expected.
it: Bene! E' andata meglio del previsto.

source: Say ... What happened to the elder?
it: Quindi... Che è successo al sindaco?

source: Whoa... ... is that what I think it is?
it: Wow... ... è davvero ciò che penso che sia?

source: It is indeed, my boy!
it: Infatti lo è, ragazzo mio!

source: It's my very own safe room.
it: Questa è la mia stanza segreta.

source: Built it for exactly this sort of crisis.
it: Costruita appositamente per questi casi.

source: That's really amazing. Uh...
it: Questo è davvero sorprendente. Uh ...

source: I guess I have to ask: Whatever prompted you to build this?
it: Devo proprio chiedertelo: Che cosa ti ha spinto a costruire questo?

source: This HAD to be expensive. I mean ... really ... expensive.
it: Questo doveva essere costoso. Voglio dire ... davvero ... costoso.

source: Yes. Yes it was.
it: Sì. Sì, lo era.

source: ...And?
it: ... E?

source: And what?
it: E che cosa?

source: I set out for just a routine errand run, you know?
it: Sai, vado solo per fare un incarico di routine?

source: Just gonna run by town, check the news.
it: Mi limiterò a fare un giro in città, per verificare le notizie.

source: Hmm... boy, where do I start?
it: Uhmm ... da dove si comincio?

source: Why don't we start with: Why was that guy asking about money?
it: Perché non iniziare con: Perché quel ragazzo stava chiedendo soldi?

source: Well, I am the mayor, after all, and mayors are well endowed.
it: Beh, io sono il sindaco, dopo tutto, e sindaci sono ben dotati.

source: In fact, clowns like you are the reason we *can't* agree on a mayor, or get anything else done around here.
it: Infatti, i pagliacci come te sono la ragione per cui *non* riusciamo a metterci d'accordo su un sindaco, o a fare qualunque altra cosa.

source: Are you done insulting me, yet?
it: Non hai ancora finito di insultarmi?

source: Nope. Not until you answer my question!
it: No. Non fino a quando non risponderai alla mia domanda!

source: Seriously - I'm on your side, here! I just risked my butt fighting that guy off.
it: Scherzi a parte - io sono dalla tua parte! Ho appena rischiato le chiappe combattendo contro quel tipo.

source: I know you're trying to hide something, but throw me a line here.
it: So che stai cercando di nascondere qualcosa, dammi un indizio.

source: Maybe ... I can actually help you?
it: Forse ... Ti posso aiutare?

source: Okay. What have I got to lose, eh?
it: Okay. Che cosa ho da perdere, eh?

source: I'm afraid if this gets out, the town might blame me for this incident.
it: Ho paura che se venga scoperto le persone in città potrebbero incolparmi di questo incidente.

source: See, some years ago, Milgram approached me with a proposition.
it: Vedi, qualche anno fa, Milgram mi si avvicinò e mi fece una proposta.

source: He was going to invest a sizeable amount of money, here.
it: Voleva investire una somma considerevole di denaro in questa città.

source: Wait, did he think you were actually the mayor?
it: Aspetta, ha pensato che in realtà eri il sindaco?

source: YES!
it: SI!

source: Anyhow, I was all too happy to accept, but it wasn't long before I realized what was really afoot.
it: Comunque, fui troppo frettoloso ad accettare, infatti non passò molto tempo prima che capissi cosa stava veramente pianificando.

source: I realized this was all a scam. He was establishing a claim, you see.
it: Capii che era tutta una truffa. Come puoi vedere, stava semplicemente facendo una rivendicazione.

source: I'm not sure I follow you...
it: Non sono sicuro di seguirti ...

source: Okay, do you know what 'usury' is?
it: Ok, sai che cosa significa 'usura'?

source: Not exactly.
it: Non esattamente.

source: See, Milgram was being what's called a 'loan shark'.
it: Vedi, Milgram non si stava comportando in modo diverso da uno 'strozzino'.

source: He gives me money, then he just 'decides' what I owe him.
it: Lui mi ha dato i soldi, poi arbitrariamente, ha 'deciso' che cosa gli dovevo ridare.

source: That I owe him more money than I could ever repay.
it: Alla fine gli devo più denaro di quanto ne potrei mai ripagare.

source: See, then he can just take whatever he wants, as payment.
it: Vedi, ora, come pagamento, lui può prendere ciò che desidera.

source: He was going to use this as an excuse to take over the town.
it: La stava usando come scusa per prendere in consegna la città.

source: Okay... I guess that sorta makes sense, although it's a bit convoluted.
it: Okay ... Credo che abbia un certo senso, anche se è un po' contorto.

source: I don't see why he'd need an excuse. If he wanted to take over the town, he could just ... do it.
it: Non vedo perché avrebbe bisogno di scusanti. Se voleva prendere la città in consegna, poteva semplicemente ... farlo.

source: No! You always need an excuse. Otherwise, no one would support your claim!
it: No! Hai sempre bisogno di una scusa. Altrimenti, nessuno ti sosterrebbe!

source: Uhh, okay... Anyways, what are we gonna do here?
it: Uhh, va bene ... Comunque, che cosa facciamo qui?

source: Well, I think we should form a militia, and bring the fight to Milgram!
it: Beh, penso che dovremmo formare una milizia, ed andare a combattere Milgram!

source: I don't think that's a good idea! Let's not jump the gun, here!
it: Non credo che sia una buona idea! Cerchiamo di non essere frettolosi!

source: If you ask me, I think we need to go hear Milgram's side of the story.
it: Secondo me, dovremmo andare a sentire la versione di Milgram.

source: Talk it over. See if we can reach some mutually amicable agreement.
it: Discutine. Per vedere se possiamo raggiungere un accordo amichevole.

source: I don't think that would work.
it: Non credo che funzionerebbe.

source: I sure do! Cripes - I tell you what: I'll do it.
it: Certo! Cazzo - sai cosa: lo farò.

source: I'll go talk to Milgram, and get this all sorted out. Okay?
it: Vado a parlare con Milgram, e ottenere questo tutto risolto. Ok?

source: I just think this is a big misunderstanding, and I'd rather not see anyone get hurt.
it: Penso che questo sia solo un grande equivoco, e desidererei che nessuno si faccia male.

source: Well, if you say so, I suppose I can't object. In fact, it might be a good stalling tactic.
it: Beh, se lo dici tu, suppongo che non posso oppormi. Infatti, potrebbe essere una buona tattica di stallo.

source: Why, I'll even show you the way...
it: Perché, io ti mostrerò la strada ...

source: The Elder's House
it: La Casa del Sindaco

source: I better leave this key here.
it: Farei meglio a lasciare questa chiave qui.

source: Glad I caught you! You'd better be aware of this...
it: Meno male ti ho trovato! Devi sapere una cosa...

source: The cave that leads into the town, has a sentry posted in it.
it: La caverna che porta in città, è pattugliata da alcune guardie.

source: Milgram's trying to seal off the town, so no one gets in or out.
it: Milgram sta cercando di isolare la città, così che nessuno possa entrare od uscire.

source: That might have been why he tried to take out that bridge.
it: Ciò spiegherebbe come mai ha provato a distruggere quel ponte.

source: If you're thinking to go in there, you might reconsider.
it: Se pensi di andare là dentro, potresti riconsiderare la cosa.

source: Well, yeah, I was gonna go in there.
it: A dire il vero, stavo proprio andando là dentro.

source: I mean, what are we gonna do, sit on our butts here?
it: Voglio dire, cosa faremo? Staremo qui a grattarci la pancia?

source: No, no... but I was hoping we'd go in in force.
it: No, no... Ma speravo ci muovessimo in forze.

source: Against Milgram? Really?
it: Contro Milgram? Davvero?
