Repository: frogatto/Cube_Trains_Redux
Catalog: po/*.po
Languages: hu_hu, id

source: Frogatto's world is a dangerous place.
hu_hu: Frogatto világa egy veszélyes hely.
id: Dunia Frogatto adalah tempat yang berbahaya.

source: You will encounter many creatures who want to hurt you.
hu_hu: Számos lénnyel találkozol majd, akik megpróbálni bántani Téged.
id: Kamu akan menemui banyak makhluk yang ingin melukaimu.

source: It's often fine to just avoid them, but if you have to fight, Frogatto's best defense is his tongue.
hu_hu: Gyakran elegendő, ha kikerülöd őket, azonban ha harcolni kell, Frogatto legjobb védelmét a nyelve jelenti.
id: Seringkali tidak apa-apa menghindari mereka, tapi jika kamu harus bertarung, pertahanan terbaik Frogatto adalah lidahnya.

source: You can grab enemies with the tongue, and then spit them back out.
hu_hu: Megragadhatod az ellenséget a nyelveddel, majd vissza kiköpheted őket.
id: Kamu bisa menangkap musuh-musuhmu dengan lidah, kemudian memuntahkan mereka keluar.

source: Once spat out, they become a deadly projectile.
hu_hu: Kiköpve veszélyes tölténnyé válnak.
id: Begitu mereka dimuntahkan, mereka akan menjadi peluru mematikan.

source: If they don't hit anything, they'll be stunned for a moment, and then will flip upright again.
hu_hu: Ha nem találnak el semmit, akkor egy pillanatig még mozdulatlanok lesznek, majd megint beindulnak.
id: Jika mereka tidak mengenai apapun, mereka akan sesaat kebingungan, kemudian mereka akan kembali seperti semula.

source: Whilst on their backs, they're vulnerable to being stomped on.
hu_hu: Míg a hátukon fekszenek, addig nem bírják, ha rájuk ugrasz.
id: Saat tubuh mereka menghadap atas, mereka rentan terhadap injakan.

source: Sticking out the tongue and spitting, are both done with the attack key.
hu_hu: A nyelv kiöltése és a kiköpés is a támadás gombbal történik.
id: Memanjangkan lidah dan memuntahkan, keduanya dilakukan dengan tombol menyerang.

source: There are a few ants just ahead. Feel free to try this on them.
hu_hu: Van is egy pár hangya pont előre. Nyugodtan próbáld ki rajtuk.
id: Ada beberapa semut di depan. Coba praktekkan pada mereka.

source: And don't worry - if you die, you'll restart right here.
hu_hu: És ne aggódj - ha meghalsz, ugyaninnen folytathatod.
id: Dan jangan khawatir - jika kamu mati, kamu akan memulai lagi dari sini.

source: A very useful fact, is that you can control the direction in which enemies are spat.
hu_hu: Nagyon hasznos tudni, hogy irányíthatod, hogy mely irányba köpöd ki az ellenséget.
id: Satu info yang sangat bermanfaat, yakni kamu bisa mengontrol ke arah mana musuh dilemparkan.

source: If you hold down the up key while pressing the attack button, you'll spit in a high arc.
hu_hu: Ha a felfele gombot is nyomod, amikor megnyomod a támadás gombot, akkor egy magas ívben köpöd ki.
id: Jika kamu menahan tombol atas sambil menekan tombol serang, kamu akan melemparkan musuhmu ke atas hingga titik tertinggi kemudian jatuh ke bawah.

source: If you hold down the down key while pressing the attack button, you'll spit with very little force.
hu_hu: Ha a lefele gombot nyomod, amikor megnyomod a támadás gombot, akkor nagyon kis erővel köpöd ki.
id: Jika kamu menekan bawah saat menekan tombol serang, maka kamu akan melempar musuh dengan pelan.

source: Also beware that not all enemies can be grabbed with the tongue, and many can't be hurt by it either.
hu_hu: Arra is ügyelj, hogy nem minden ellenséget tudsz megfogni a nyelveddel, és sokukat nem is tudod vele megsebezni.
id: Juga berhati-hatilah karena tidak semua musuh bisa ditangkap dengan lidah, dan juga banyak yang tidak bisa dilukai oleh juluran lidah.

source: You'll need to get creative to deal with those enemies.
hu_hu: Leleményesen kell majd eljárnod ilyen ellenségekkel szemben.
id: Kamu perlu menjadi kreatif saat menghadapi musuh-musuh semacam itu.

source: Last but not least, the tongue can grab useful items too.
hu_hu: Végül, de nem bezárólag, a nyelveddel megfoghatsz hasznos tárgyakat is.
id: Terakhir dan tidak kalah penting, lidah itu dapat meraih barang- barang berguna juga.

source: It's what you use to carry something from one place to another.
hu_hu: Ezzel cipelhetsz valamit egyik helyről a másikra.
id: Lidahlah yang akan kamu gunakan untuk membawa sesuatu dari satu tempat ke tempat lain.

source: Fountains, and other water dispensers, are very helpful.
hu_hu: A szökőkútak és egyéb vízautomaták nagyon hasznosak.
id: Air mancur, dan dispenser air, keduanya sangatlah menolong.

source: If you drink from them, you will restore all of your health!
hu_hu: Ha iszol belőlük, akkor az összes életerőd visszatöltődik.
id: Jika kamu minum dari keduanya, kesehatanmu akan pulih!

source: Certain wooden bridges and stairways, like the one just up ahead, are built so you can jump up, and pass through them.
hu_hu: Egyes fa hídakat és lépcsőket, mint azt, ami pont itt van előtted, úgyépítették, hogy felugorhatsz rájuk és áthaladhatsz rajtuk.
id: Tangga dan jembatan kayu tertentu, seperti yang ada di depan, dibangun supaya kamu bisa menembusnya dengan melompat dari bawahnya.

source: You can also jump down through them.
hu_hu: Le is ugorhatsz rajtuk keresztül.
id: Kamu juga bisa menembusnya dari atas.

source: A special button will appear, whenever this is possible.
hu_hu: Egy különleges gomb fog megjelenni, amikor ez lehetséges.
id: Tombol istimewa akan muncul, setiap kali keadaan memungkinkan.

source: To do so, hold down the down key, and then press jump.
hu_hu: Ehhez nyomd meg a legfele gombot, majd utána az ugrást.
id: Untuk melakukannya, tahan tombol bawah, kemudian tekan lompat.

source: As you've played through this level, you've probably noticed the gold coins.
hu_hu: Ahogy haladtál át ezen a pályán, biztosan feltűntek az arany érmék.
id: Saat kamu bermain di level ini, kamu mungkin menyadari adanya koin emas.

source: You can collect these and any other golden objects, and then use them to buy stuff!
hu_hu: Összegyűjtheted őket és minden egyéb arany tárgyat, majd vehetsz értük cuccokat!
id: Kamu bisa mengumpulkannya dan juga benda-benda dari emas lainnya, kemudian menggunakannya untuk membeli barang-barang!

source: There is a store conveniently located outside of the town.
hu_hu: Van egy praktikusan elhelyezett üzlet a városon kívül.
id: Ada sebuah toko yang terletak di luar kota.

source: Sometimes, you'll run into rather dangerous-looking terrain, such as these brambles.
id: Terkadang, kamu akan menemui tempat yang terlihat berbahaya, misalnya seperti semak berduri ini.

source: As you would expect, stepping on these will hurt a bit.
id: Seperti yang kamu duga, menginjak semak berduri akan terasa sedikit menyakitkan.

source: However, this also hurts the bugs!
hu_hu: Azonban ez a bogarakat is sebzi!
id: Bagaimanapun juga, semak berduri juga menyakitkan bagi serangga!

source: Leading or spitting them onto it is an excellent way to dispatch them.
id: Mengarahkan atau melemparkan mereka ke semak berduri adalah cara yang tepat untuk membunuh mereka.

source: Beware also, any bottomless pits you encounter.
hu_hu: Valamint vigyázz minden feneketlen gödörre, amit találsz.
id: Juga berhati-hatilah, pada setiap jurang yang kamu temui.

source: These are immediately fatal.
hu_hu: Ezek azonnal végzetesek.
id: Jurang-jurang itu mematikan.

source: Up ahead, you'll notice an anthill, which ants constantly come out of.
hu_hu: Előre felé láthatsz egy hangyabolyt, melyből folyamatosan jönnek a hangyák.
id: Di atas sana, kamu akan menemui sarang semut, dari dalam sana semut terus bermunculan.

source: There is no way to stop this; you can't destroy the anthill.
hu_hu: Ezt nem tudod megállítani; nem tudod megsemmisíteni a hangyabolyt.
id: Tidak ada cara untuk menghentikannya; kamu tidak bisa menghancurkan sarang semut itu.

source: Some hazards are like this. You simply have to work around them.
hu_hu: Egyesek akadályok ilyenek. Egyszerűen meg kell kerülnöd őket.
id: Beberapa bahaya memang seperti ini. Kamu hanya harus menyiasatinya.

source: That's it for this tutorial.
hu_hu: Ennyi volt az útmutató.
id: Cukup sekian untuk tutorial ini.

source: Although there's a bit more to playing the game, the rest we can safely let you learn on your own.
hu_hu: Bár még van mit tanulni a játékkal kapcsolatban, de azt már nyuodtan Rád bízzuk, hogy magadnak fedezd fel.
id: Meskipun masih ada beberapa hal lagi yang perlu kamu tahu, kami yakin untuk sisanya kamu bisa pelajari sendiri.

source: Feel free to come back here, if you want to read a hint again.
hu_hu: Nyugodtan visszajöhetsz ide, ha újra el szeretnéd olvasni valamelyik útmutatót.
id: Jika kamu ingin membaca petunjuk ini lagi, silahkan kembali lagi ke sini.

source: Have fun!
hu_hu: Jó szórakozást!
id: Selamat bersenang-senang!

source: If you've seen a conversation before you might be annoyed by having to read it again.
hu_hu: Ha már láttál egy beszélgetést, biztosan zavar, ha ismét el kellene olvasnod.
id: Jika kamu pernah melihat pembicaraan yang sama seperti sebelumnya kamu mungkin tidak suka membacanya lagi.

source: You can skip a conversation, including parts of cutscenes, by pressing the "escape" key.
hu_hu: Átugorhatod a beszélgetéseket, rendezett jeleneteknél is, ha megnyomod az "escape" billentyűt.
id: Kamu bisa melompati pembicaraan, termasuk bagian cerita permainan, dengan menekan tombol "escape".

source: And yes, this applies to the question marks on this level, too.
hu_hu: És igen, ez érvényes az itt található kérdőjelekre is.
id: Dan ya, hal ini berlaku pada tanda tanya pada level ini, juga.

source: Hanging Platforms
hu_hu: Függeszkedő emelvények
id: Platform Gantung

source: Well, I guess I'm entering Milgram's castle now. I made it through the caves!
hu_hu: Nos, úgy néz ki, mostmár Milgram várába érek. Átértem a barlangokon!
id: Hm, sepertinya aku sekarang memasuki kastilnya Milgram. Aku telah berhasil melewati gua-gua itu!

source: Hidden Depths
hu_hu: Rejtett mélységek
id: Terlalu Dalam

source: I'd better be careful.
hu_hu: Jobb hagy vigyázok.
id: Aku harus berhati-hati.

source: This is a very deep chasm...
hu_hu: Ez egy nagyon mély szakadék...
id: Lubang ini sangat dalam

source: AAAAAAH! I CAN'T FLY!
hu_hu: AAAAAAH! NEM TUDOK REPÜLNI!
id: AAAAAAH! AKU TIDAK BISA TERBANG!

source: Killer Bunnies
hu_hu: Gyilkos nyuszik
id: Kelinci Pembunuh

source: That guy sure doesn't look glad to meet me!
hu_hu: Az a fazon aztán tényleg úgy néz ki, mint aki nem örül nekem.
id: Dia benar-benar terlihat tidak suka bertemu denganku!

source: It's locked. Of course... It couldn't be easy to get out of here!
hu_hu: Zárva van. Egyértelműen... Nem lehet egyszerű az kijutás innen!
id: Ini terkunci. Tentu saja... Tidak akan mudah untuk keluar dari sini!

source: Well I guess I have to give it to you, kid, you saved us!
hu_hu: Nos gondolom, ezt meg kell adnom Neked, kölyök, megmentettél minket!
id: Ya aku rasa aku harus memberimu ini, nak, kau telah menyelamatkan kami!

source: Give it to me? Give what to me? Money?
hu_hu: Megadni nekem? Mit kell megadnod? Pénzt?
id: Memberiku? Memberiku apa? Uang?

source: Sheesh, so mercenary! It's just an expression.
hu_hu: Ajj te, te zsoldos! Ez csak egy szavajárás.
id: Ya ampun, dasar mata duitan! Itu hanyalah ungkapan.

source: I know, I'm just poking fun at you.
hu_hu: Tudom, csak csipkelődöm.
id: Aku tahu, aku hanya menggodamu.

source: I am glad things worked out, though.
hu_hu: Örülök, hogy jól végződtek a dolgok, viszont.
id: Tapi aku senang semuanya baik-baik saja.

source: Hey, what's new?
hu_hu: Hé, mi újság?
id: Hei, ada berita baru?

source: Oh, just cleaning up after that ruckus.
hu_hu: Oh, csak rendet rakok a felfordulás után.
id: Oh, baru bersih-bersih setelah kekacauan barusan.

source: So nice to have things back to normal.
hu_hu: Olyan jó, hogy minden a megszokott szerint megy.
id: Baguslah kalau semua sudah kembali seperti sedia kala.

source: You bet.
hu_hu: Naná.
id: Begitulah.

source: Speaking of which, am I imagining it or is this house actually smaller now?
hu_hu: Ha már szóba került, most képzelődöm, vagy ez a ház tényleg kisebb lett?
id: Omong-omong, cuma imajinasiku atau rumah ini sekarang jadi lebih kecil?

source: Of course not. That's just nutty.
hu_hu: Persze, hogy nem. Ez őrültség.
id: Tentu saja tidak. Itu tidak mungkin.

source: Hey, thanks for saving the town!
hu_hu: Hé, köszönet a város megmentéséért!
id: Hei, terima kasih telah menyelamatkan kota ini.

source: All in a day's work.
hu_hu: Csupán a napi teendőmet végeztem.
id: Ini pekerjaanku sehari-hari koq.

source: Where's your sibling, by the way?
hu_hu: Hol a testvéred, egyébként?
id: Omong-omong dimana saudaramu?

source: At the store.
hu_hu: Az üzletnél.
id: Di toko.

source: I see.
hu_hu: Értem.
id: Oh begitu.

source: Lobby
hu_hu: Előcsarnok
id: Lobi

source: World Map
hu_hu: Világtérkép
id: Peta Dunia

source: This looks kinda ominous. I bet Milgram is right up there! I guess this is my last chance to go back if there's anything I want to do before I confront him.
hu_hu: Ez eléggé ominózusan néz ki. Fogadni mernék, ott fent van Milgram! Gondolom ez az utolsó esélyem, hogy még elintézzek bármit, mielőtt szembekerülök vele.
id: Ini terlihat agak menyeramkan. Aku yakin Milgram di atas sana! Aku rasa ini adalah kesempatan terakhirku untuk kembali jika ada sesuatu yang ingin kulakukan sebelum aku melawannya.

source: Milgram's Throne Room
hu_hu: Milgram trónterme
id: Ruang Singgasana Milgram

source: No! You can't be...
hu_hu: Nem! Te nem lehetsz...
id: Tidak! Kamu khan...

source: Hi, I'm Frogatto.
hu_hu: Hello, Frogatto vagyok.
id: Hai, aku adalah Froggato.

source: Oh crap, oh crap! Boss! He's here!
hu_hu: Fenébe, szarban vagyunk! Főnök! Itt van!
id: Oh tidak, oh tidak! Bos! Dia di sini!

source: Who's here?
hu_hu: Ki van itt?
id: Siapa yang di sini?

source: Frogatto! He's RIGHT HERE!
hu_hu: Frogatto! Pont ITT van!
id: Frogatto! Dia SUDAH DI SINI!

source: This had better be some kind of joke.
hu_hu: Jobb, ha ez csak valamiféle vicc.
id: Seseorang pasti bercanda.

source: We... We tried to stop him, but he's...
hu_hu: Mi... Mi próbáltuk megállítani, de ő...
id: Kami... Kami sudah mencoba menghentikan dia, tapi dia...

source: Bah, what's the point in subordinates if I have to deal with everything myself?!
hu_hu: Bah, mi haszna az alattvalóknak, ha mindent magamnak kell elintéznem?!
id: Bah, apa gunanya anak buah jika pada akhirnya aku yang harus mengurus semuanya?!

source: Get out of the way, it's clobbering time!
hu_hu: Félre az útból, fölbe döngöllek!
id: Minggir semuanya, saatnya menghajar seseorang!

source: Ugh! You do put up quite a fight!
hu_hu: Ugh! Valóban kiemelkedő kihívást jelentesz!
id: Uh! Kau ternyata sangat hebat!

source: Will you hear me out now?
hu_hu: Meghallgatod mostmár a mondandómat?
id: Maukah kau mendengarkan aku?

source: Yes.
hu_hu: Igen.
id: Ya.

source: What was it you wanted?
hu_hu: Mit is akartál?
id: Apa yang kau inginkan?

source: I want you to call your goons off! Stop harassing the town folk and all!
hu_hu: Azt akarom, hogy állítsd le a banditáid! Hagyd abba a városlakók zaklatását meg minden!
id: Aku ingin kau membawa pergi berandalan-berandalanmu itu! Berhentilah memeras orang-orang kota dan semua orang!

source: The town folk?
hu_hu: A városlakokat?
id: Orang-orang kota?

source: *That's* what this is all about? Well, perhaps we could talk it over?
hu_hu: *Erről* van hát szó? Nos, esetleg megbeszélhetnénk a dolgot?
id: Semua ini tentang *itu*? Mungkin, kita bisa berdiskusi tentang itu?

source: Talk it over? Like gentlemen?
hu_hu: Megbeszélni? Mint úriemberek?
id: Berdiskusi? Seperti orang beradab?

source: Yes, like gentlemen. Over tea.
hu_hu: Igen, mint úriemberek. Tea mellett.
id: Ya, seperti orang beradab. Sambil minum teh.

source: Wait a minute, it's you, isn't it?
hu_hu: Várj csak, Te vagy az, nemde?
id: Tunggu dulu, kau orangnya khan?

source: Yup, I'm Frogatto!
hu_hu: Bizony, Frogatto vagyok!
id: Yup, akulah Frogatto!

source: I was expecting something a bit more ...
hu_hu: Amire számítottam, az valami...
id: Aku pikir kau sedikit lebih ...

source: Threatening? I can do threatening!
hu_hu: Félelmetesebb? Tudok félelmetes lenni!
id: Berbahaya? Aku bisa sangat berbahaya!

source: I'm here to teach you a lesson!
hu_hu: Azért jöttem, hogy megleckéztesselek!
id: Aku di sini untuk memberimu pelajaran!

source: HAHAHA! Why, I like you already, little frog. You're quite a laugh.
hu_hu: HAHAHA! Nohát, máris megkedveltelek, kis béka. Egy jó kacagásra való vagy.
id: HAHAHA! Sungguh, aku menyukaimu, kodok kecil. Kau sangat lucu.

source: Hey, I'm serious, here! Will you hear me out?
hu_hu: Hé, én komolyan gondoltam! Meghallgatod a mondandómat?
id: Hei, aku serius! Maukah kau mendengarkanku?

source: Nope.
hu_hu: Nem.
id: Tidak.

source: Either you get off my property, or I clean your clock.
id: Pergilah dari rumahku, atau kau akan kuhajar habis-habisan.

source: Fine.
hu_hu: Rendben.
id: Baiklah.

source: Pinecone Park
hu_hu: Fenyőtoboz park
id: Taman Pinecone

source: Plagued Mine
hu_hu: Fertőzött bánya
id: Tambang Bencana

source: These crazy bombers are everywhere!
hu_hu: Ezek az őrült bombázók mindenütt ott vannak!
id: Para Pengebom Gila

source: Yikes!
hu_hu: Juj!
id: Yaiks!

source: Rock-a-Fort
id: Benteng Karang

source: Woah! A flying plant!
hu_hu: Hű! Egy repülő virág!
id: Wow! Ada tanaman terbang!

source: Rocky Roots
hu_hu: Köves gyökérzet
id: Akar Berbatu

source: Bleh. A locked door.
hu_hu: Bleh. Egy zárt ajtó.
id: Sial. Pintunya terkunci.

source: There must be a way around it.
hu_hu: Csak van egy megkerülő út.
id: Pasti ada suatu cara.

source: Secluded Hut
hu_hu: Félreeső kunyhó
id: Gubuk Terpencil

source: Hello there.
hu_hu: Üdv ottan.
id: Halo.

source: A pleasure to meet you. I am Mortimer.
hu_hu: Örülök, hogy találkoztunk. Mortimer vagyok.
id: Senang bertemu denganmu. Aku ini Mortimer

source: That's nice.
hu_hu: Ez kedves.
id: Nama yang bagus.

source: Uhm, I hope you don't mind my asking, but what on earth ARE you, anyway?
hu_hu: Öhm, remélem nem bánod, ha megkérdem, de mi az atyaég VAGY te, egyébként?
id: Um, kuharap kau tidak keberatan dengan pertanyaanku ini, tapi kau ini sebenarnya APA?

source: Ostensibly, I am a mole.
hu_hu: Mint látható, egy vakond.
id: Seperti yang bisa kau lihat, aku ini tikus tanah.

source: ... Okay.
hu_hu: ... Rendben.
id: ... Baiklah.

source: Perhaps more importantly, I am a bit of an astronomer and biologist, by trade.
hu_hu: Bár ettől lényegesebb, hogy egyfajta csillagász és biológus vagyok.
id: Maksudku, sebenarnya aku ini semacam ahli astronomi dan biologi, itulah pekerjaanku.

source: That is why I live all the way up here. You can see quite a bit from this height.
hu_hu: Ezért lakom ilyen egész magasan. Elég sok minden látható ilyen magasságból.
id: Makanya aku tinggal di tempat yang sangat tinggi seperti ini. Ada banyak hal yang bisa dilihat dari ketinggian ini.

source: ...and I guess you have these ants in cages to study them?
hu_hu: ...és gondolom ezeket a hangyákat azért fogtad be, hogy tanulmányozd?
id: ... dan aku menebak kau mengurung semut-semut ini untuk mempelajari mereka bukan?

source: That's right. Unfortunately, my collection lacks the rarer golden ant.
id: Itu benar. Sayangnya di koleksiku masih belum ada semut emas yang langka.

source: Oh, what a shame.
hu_hu: Oh, milyen kár.
id: Oh, sayang sekali.

source: You know, you look rather well-traveled. If you could bring me a golden ant and stick it in one of my cages, I'd reward you handsomely.
hu_hu: Tudod, kellően jól tájékozottnak tűnsz. Ha tudnál nekem hozni egy arany hangyát, és beraknád a ketrecembe, akkor busás jutalomra számíthatsz!
id: Kau tahu, sepertinya kau suka bepergian. Jika kau bisa membawakanku seekor semut emas dan memasukkannya ke dalam salah satu kandangku, aku akan memberimu hadiah yang menarik.

source: Handsomely you say? I'm on it!
hu_hu: Azt mondod, busás jutalom? Máris rajta vagyok!
id: Menarik katamu? Akan kulakukan!

source: Oh! You got the golden ant for me. It's beautiful, beautiful!
hu_hu: Oh! Elhoztad nekem az arany hangyát. Egyszerűen gyönyörű, gyönyörű!
id: Oh! Kau telah membawakan semut emas untukku. Ini indah sekali, indah sekali!

source: Mmmmmhmmmm. Now you were talking about a reward?
hu_hu: Ahhhaaam. Nos beszéltél valamiféle jutalomról?
id: Mmmmhmmm. Lalu bagaimana dengan hadiahku?

source: Oh yes, a reward! Here you go...
hu_hu: Oh igen, jutalom! Tessék...
id: Oh ya, hadiahnya! Ini dia...

source: What's that you say? The golden ant is in your stomach? Quick, spit it out into the cage!
id: Apa kau bilang? Semut emasnya ada dalam perutmu? Cepat, muntahkan ke dalam kandang!

source: I don't suppose you've had any luck with getting a golden ant yet?
hu_hu: Gyanítom még nem jártál sikerrel az arany hangyát illetően?
id: Aku rasa kau belum beruntung dalam mendapatkan semut emas bukan begitu?

source: I'm working on it. Those things pack a pretty mean bite, you know.
id: Aku masih berusaha. Asal kau tahu, semut-semut itu menggigit dengan ganas.

source: I do hope you are enjoying exploring the island. There are so many wonderful creatures on it.
id: Aku harap kau menikmati menjelajahi pulau ini. Ada begitu banyak flora & fauna yang indah di dalamnya.

source: I'm assuming you're talking about all the creatures that keep trying to kill me.
id: Aku rasa yang kau maksud adalah hewan-hewan dan tumbuhan-tumbuhan yang selalu berusaha membunuhku di luar sana.

source: I say! Who's there?
hu_hu: Nocsak! Ki van ott?
id: Aku bilang! Siapa di sana?

source: Are you quite alright?
hu_hu: Minden rendben veled?
id: Apakah kau baik-baik saja?

source: Yeah. Who WAS that guy?!
hu_hu: Igen. Ki VOLT ez a fazon?
id: Yeah. Siapa SIH orang itu?

source: One of Milgram's henchmen, no doubt.
hu_hu: Kétségkívül Milgram egyik csatlósa.
id: Tidak salah lagi, salah satu anak buahnya Milgram.

source: They may have seen me talking to you, I can't be sure.
hu_hu: Lehet meglátták, hogy veled beszélek, nem tudom biztosan.
id: Mereka mungkin pernah melihatku berbicara denganmu, aku tidak begitu yakin.

source: Wait, what? Milgram?
hu_hu: Várj, micsoda? Milgram?
id: Tunggu dulu, apa? Milgram?

source: What's he doing on this side of the island?
hu_hu: Mit keres Ő itt, a sziget ezen oldalán?
id: Apa yang sedang dia lakukan di sisi pulau bagian ini?

source: You still haven't heard, then.
hu_hu: Akkor még nem hallottad.
id: Oh, kau belum tahu ya?

source: Milgram's men showed up early this morning, in town. They've taken the whole place hostage; something about "collecting on a debt."
hu_hu: Milgram emberei megjelentek a városban ma kora reggel. Foglyul ejtettek mindenkit; valami "adósság behajtás" történik.
id: Anak buah Milgram menampakkan batang hidungnya pagi ini,di kota. Mereka telah menyandera semuanya; sesuatu terkait "menagih hutang."

source: I don't know the details. I flew out of there as soon as I could, looking for anyone who could help.
hu_hu: Nem ismerem a részleteket. Amilyen gyorsan csak tudtam kirepültem onnan, keresve bárkit, aki segíthet.
id: Aku tidak tahu detilnya. Aku kabur secepat yang kubisa, mencari siapapun yang bisa menolong.

source: That certainly... changes my plans for the day.
hu_hu: Ez aztán... változtat a mai napi tervemen.
id: Itu benar-benar... merubah rencanaku untuk hari ini.

source: Wow, uhm... I'd sure like to help, but ... I just don't see what I could do.
hu_hu: Hű, öhm... Szívesen segítenék, de... Nem igazán tudom, hogyan is tudnék.
id: Wow, uhm... Aku sungguh ingin membantu, tapi ... Aku tidak tahu bagaimana.

source: I don't think I can promise anything, but if the opportunity presents itself, who knows?
hu_hu: Nem hiszem, hogy ígérhetek bármit is, de ha a lehetőség előáll, ki tudja?
id: Aku tidak janji, tapi jika ada kesempatan, siapa tahu?
