Repository: frogatto/Cube_Trains_Redux
Catalog: po/*.po
Languages: hu_hu, id

source: Version 1.1.1:
hu_hu: Verzió 1.1.1:
id: Versi 1.1.1:

source: Fixed some crashing bugs.
hu_hu: Néhány összeomlást előidéző hiba javítva.
id: Beberapa kesalahan fatal diperbaiki.

source: Fixed The Long Haul (compiled mode)
hu_hu: A Hosszú menet kijavítva (arcade pálya)
id: Perjalanan Panjang diperbaiki (mode terkompilasi)

source: Fixed instructions on titlescreen (iOS)
hu_hu: Üdvözlőképernyőn az útmutató kijavítva (iOS).
id: Perbaikan instruksi pada layarjudul (iOS)

source: New translation: Italian
hu_hu: Új nyelvre fordítva: olasz.
id: Terjemahan baru: bahasa Itali

source: Added automatic language selection for Windows
hu_hu: Windows alatti automatikus nyelvválasztás hozzáadása.
id: Penambahan pemilihan bahasa otomatis untuk Windows

source: Version 1.1:
hu_hu: Verzió 1.1:
id: Versi 1.1:

source: Added arcade mode.
hu_hu: Arcade játékmód hozzáadása.
id: Mode arcade ditambahkan.

source: Redid graphics for forest trees.
hu_hu: Erdei fák grafikájának újrarajzolása.
id: Grafis untuk pepohonan di hutan didekor-ulang

source: Redid graphics for forest background
hu_hu: Erdei háttér grafikájának újrarajzolása.
id: Grafis untuk latar belakang hutan didekor-ulang

source: Redid graphics for dungeon wall tiles
hu_hu: A tömlöc fali csempék újrarajzolása.
id: Grafis untuk dinding kastil didekor-ulang

source: Redid graphics for basement wall tiles
hu_hu: Az alagsori fali csempék újrarajzolása.
id: Grafis untuk ubin dinding bawah-tanah didekor-ulang

source: Added a bunch of interior props
hu_hu: Egy rakat beltéri tárgy hozzáadása.
id: Banyak pendukung interior ditambahkan

source: Reworked "darkness" for improved appearance
hu_hu: A "sötétség" átdolgozva a jobb megjelenés érdekében
id: "Kegelapan" dikerjakan ulang untuk tampilan yang lebih baik

source: Added new palettes to forest and seaside areas.
hu_hu: Új erdei és tengerparti textúrapaletták hozzáadva.
id: Penambahan palet baru untuk area hutan dan sisi lautan.

source: Added some unique enemies to the forest.
hu_hu: Az erdőkhöz néhány egyedi ellenség hozzáadva.
id: Penambahan beberapa musuh unik untuk hutan.

source: Refactored damage and monster type systems to make behavior more consistent and eliminate some rare buggy behavior.
hu_hu: A sebzés és szörny típusok újradolgozva, hogy a viselkedések konzisztensebbé váljanak és néhány ritka hibás viselkedést így elkerüljünk.
id: Pemfaktoran-ulang sistem kerusakan dan tipe monster agar perilaku lebih konsisten dan menghilangkan beberapa kesalahan perilaku yang jarang terjadi.

source: Added translation support, with 4 complete translations: French, Brazilian Portuguese, Chinese (Simplified), and Japanese.
hu_hu: Fordítások támogatása hozzáadáva, 4 teljes fordítással együtt: francia, brazíliai portugál, kínai (egyszerűsített) és japán.
id: Penambahan dukungan terjemahan, dengan 4 terjemahan baru: Bahasa Prancis, Portugis Brazil, Cina (Disederhanakan), dan Jepang.

source: Version 1.0.3:
hu_hu: Verzió 1.0.3:
id: Versi 1.0.3:

source: Fixed crash when picking up max heart pieces.
hu_hu: Összeomlási hiba kijavítva, amikor egy max. szívrészt felveszünk.
id: Program berhenti saat mengambil potongan jantung maks telah diperbaiki

source: Other small bug fixes.
hu_hu: Egyéb apróbb hibák kijavítva.
id: Perbaikan kesalahan-kesalahan kecil lainnya.

source: Version 1.0.2:
hu_hu: Verzió 1.0.2:
id: Versi 1.0.2:

source: Added support for "darkness" in levels.
hu_hu: "Sötétség" támogatása a pályákon.
id: Penambahan dukungan untuk "kegelapan" dalam level.

source: Added support for WVGA.
hu_hu: WVGA megjelenítési mód támogatása.
id: Penambahan dukungan untuk WVGA.

source: Made player status not show on the titlescreen or world map.
hu_hu: A játékosállapot nem jelenik meg az üdvözlőképernyőn és a világtérképen.
id: Status pemain tidak ditampilkan pada layarjudul atau peta dunia.

source: Made golden ants less ambiguous.
hu_hu: Az arany hangyák mostmár kevésbé kétértelműek.
id: Semut emas menjadi sedikit lebih rancu.

source: Fixed bug making certain music always play at full volume (iPhone).
hu_hu: Hiba kijavítva, melynek hatására egyes aláfestő zenék teljes hangerőn szóltak (iPhone).
id: Perbaikan kesalahan dimana musik selalu dimainkan pada volume penuh (iPhone).

source: Added option to reverse positions of A and B buttons (iPhone).
hu_hu: Opció hozzáadva, hogy az A és B betűket felcserélhessük (iPhone).
id: Penambahan pilihan untuk menukar posisi tombol A dan B (iPhone).

source: Added support for repeating levels (for arcade modes).
hu_hu: A végtelen szintek támogatásának hozzáadása (arcade játékmódokban).
id: Penambahan dukungan untuk mengulangi level (untuk mode arcade).

source: Pressing jump while in the air pressing against a wall now makes you cling to the wall.
hu_hu: Mostmár a levegőben egy fal mellett az ugrás gomb megnyomására a falhoz kapaszkodunk.
id: Menekan lompat saat di udara di dekat dinding akan membuatmu menempel di dinding.

source: Made it so you can skip dialogs sequences.
hu_hu: Beszélgetések átugrásának lehetősége implementálva.
id: Sekarang urutan dialog dapat dilewati.

source: Fixed lots of z-order issues.
hu_hu: Számos z-tengelymenti megjelenítési hiba kijavítva.
id: Banyak masalah z-order telah diperbaiki.

source: Fixed bug causing ambient sounds to not work.
hu_hu: A környezeti zajok hibás működését előidéző hiba kijavítva.
id: Kesalahan yang menyebabkan suara sekitar tidak bekerja telah diperbaiki.

source: Improved forest background, and made it go upwards infinitely.
hu_hu: Erdei háttér feljavítva, és felfelé a végtelenségig terjed mostmár.
id: Latar belakang hutan telah ditingkatkan, dan telah dibuat supaya ikut ke atas tanpa batas.

source: Made hearts heal a full heart, rather than just half.
hu_hu: Szívek mostmár egy teljes szívet gyógyítanak, az eddigi fél helyett.
id: Menjadikan jantung menyembuhkan satu jantung utuh, ketimbang hanya separuh.

source: Changed tilesets to make water look better.
hu_hu: Csempeszettek módosíta, hogy a víz sokkal jobban nézzen ki.
id: Merubah set ubin untuk mempercantik air.

source: Many small bug fixes.
hu_hu: Számos egyéb apróbb hiba kijavítva.
id: Banyak perbaikan kesalahan kecil.

source: Version 1.0.1 (iPhone only):
hu_hu: Verzió 1.0.1 (kizárólag iPhonera):
id: Versi 1.0.1 (hanya iPhone):

source: Significantly improved controls, both functionally and graphically (iPhone).
hu_hu: A vezérlés nagymértékű feljavítása, mind funkcionálisan és grafikailag is (iPhone).
id: Peningkatan kendali secara signifikan, baik dari segi fungsi maupun grafis (iPhone).

source: Fixed auto-saving on iOS4 where multitasking is supported (iPhone).
hu_hu: Automatikus-mentés kijavítva iOS4 alatt, ahol az egyidejű többfeladatos kezelés támogatott (iPhone).
id: Perbaikan pada auto-penyimpanan untuk iOS4 dimana multitasking didukung (iPhone).

source: Fixed bug where a dialog could repeat forever.
hu_hu: Hiba kijavítva, amely egy beszélgetés végtelenségig folytatását eredményezte.
id: Kesalahan dimana dialog mengulang terus-menerus telah diperbaiki.

source: Fixed crash in world map when you hold down while entering it.
hu_hu: Hiba kijavítva, ahol a a játék összeomlott amikor a világtérképre belépéskor a lefele gombot nyomva tartottuk.
id: Perbaikan kesalahan dimana program berhenti dalam peta dunia saat anda menekan bawah ketika memasukinya.

source: Fixed fullscreen mode (Mac/Windows).
hu_hu: Teljesképernyős megjelenítési mód kijavítva (Mac/Windows).
id: Perbaikan mode layarpenuh (Mac/Windows).

source: Fixed controlpad issues for computers.
hu_hu: Számítógépeknél kontrolpad hiba kijavítva.
id: Perbaikan masalah tombol kendali untuk komputer.

source: Added music and sound volume controls to pause screen.
hu_hu: A pause képernyőn a zene és hangeffektek hangerejének szabályozhatósága hozzáadva.
id: Penambahan kendali volume musik dan suara pada layar jeda.

source: Added customizable controls.
hu_hu: Vezérlőbillentyűk állíthatósága hozzáadva.
id: Penyetelan kendali ditambahkan.

source: Added half-hearts.
hu_hu: Félszívek hozzáadása.
id: Separuh-jantung ditambahkan.

source: Added scons script for compiling.
hu_hu: Fordításnál scons szkript hozzáadva.
id: Penambahan skrip scons untuk kompilasi.

source: Minor level changes.
hu_hu: Apróbb változtatások a terepeken.
id: Perubahan tingkat minor.

source: Updated music.
hu_hu: Zenék frissítve.
id: Musik di-update.

source: An old-school 2d platformer game, starring a certain quixotic frog. From the creators of Battle for Wesnoth comes this exciting jump-and-run platformer. Frogatto has gorgeous, high-end pixel art, pumping arcade tunes, and all the gameplay nuance of a classic console title. Run and jump over pits and enemies. Grab enemies with your tongue, swallow them, and then spit them out at other enemies as projectiles! Fight dangerous bosses, and solve vexing puzzles. Collect coins and use them to buy upgrades and new abilities in the store. Talk to characters in game, and work to unravel Big Bad Milgram's plot against the townsfolk! At over 30 levels set in 4 different environments, Frogatto is not a flash in the pan, and has the play-time you'd expect from a real videogame.
hu_hu: Egy régifajta 2d platformer játék, egy bizonyos bámulatos békával a főszerepben. A Battle for Wesnoth készítői elhozták ezt az izgazlmas ugrás-és-futás platformert. A Frogatto pompás, csúcsminőségű pixel grafikával jelenik meg, arcade dallamokat közvetít, és biztosítja a remek élményeket, amelyeket egy klasszikus konzol játéktól elvárhatunk. Fuss és ugorj át szakadékokat és ellenségeket. Fogd meg az ellenséget a nyelveddel, nyeld le, majd köpd vissza őket más ellenségekre, mintha lövedékek lennének! Harcolj veszélyes vezérek ellen és oldj meg furfangos fejtörőket! Gyűjts érméket, melyekkel fejlesztéseket és új képességeket vehetsz az üzletben. Beszélj a játékban fellelhető karakterekkel és serénykedj, hogy leleplezd a Nagy Gonosz Milgram tervét, amelyet a városlakók ellen sző! Több, mint 30 pályával, melyek 4 különböző környezetben játszódnak, a Frogatto nem csak egy gyorsan múló szikra, és biztosítja azt a játékhosszt, amit egy igazi videójátékotól elvárnánk.
id: Permainan platform jadul 2d, dibintangi kodok khayalan. Pencipta Battle for Wesnoth menghadirkan permainan lompat-dan-lari di atas platform yang menyenangkan ini. Frogatto menampilkan gambar yang enak dilihat, seni piksel yang canggih, setelan arcade bertingkat, serta suasana permainan seperti permainan konsol klasik. Berlari dan melompati lubang dan musuh. Menangkap musuh dengan lidahmu, menelan mereka, dan memuntahkan mereka keluar sebagai peluru ke arah musuh lainnya! Bertarung melawan bos-bos berbahaya, dan memecahkan teka-teki yang menjengkelkan. Mengumpulkan koin dan menggunakannya untuk membeli upgrade dan kemampuan baru di toko. Berbicara pada karakter-karakter dalam permainan, dan menggagalkan rencana jahat Milgram terhadap penduduk kota! Ada lebih dari 30 level yang disiapkan dalam 4 lingkungan berbeda, Frogatto bukanlah sekedar gembar-gembor tapi mlempem, dan memiliki waktu bermain seperti yang anda harapkan dari sebuah videogame sungguhan.

source: Frogatto was made by a group of big-time fans of classic videogames, who are hoping to bring back the magic in a new, original game design with unconventional gameplay mechanics - a fun break from the usual clones.
hu_hu: A Frogattot egy klasszikus videójátékokat kedvelő csoport hozta létre, azzal a szándékkal, hogy visszahozzák a régi varázst egy új, eredeti játék formájában, mely a megszokottól eltérő játékmenetet biztosít - a szokásos klónoktól egy kellemes szünetet biztosítva.
id: Frogatto dibuat oleh sekelompok penggemar luar biasa dari videogame klasik, yang berharap dapat mengembalikan sihir dalam sebuah rancangan permainan yang baru dan orisinil dengan mekanika permainan yang tidak biasa - sebuah intermezo dari salinan-salinan pada umumnya.

source: keywords:
hu_hu: kulcsszavak:
id: kata kunci:

source: Pocket Money
hu_hu: Zsebpénz
id: Uang Saku

source: Collect ten coins.
hu_hu: Gyűjts össze tíz érmét.
id: Kumpulkan sepuluh koin.

source: Nature Boy
hu_hu: Természet fiú
id: Bocah Pecinta Alam.

source: Put a water beetle back in water.
hu_hu: Egy vízibogarat helyezz vissza a vízbe.
id: Mengembalikan kumbang air ke dalam air.

source: Nice Try...
hu_hu: Szép próbálkozás...
id: Usaha yang bagus...

source: But that's not a secret area.
hu_hu: De ez nem is egy titkos hely.
id: Tapi itu bukan area rahasia.

source: Gold Hoarder
hu_hu: Aranygyűjtő
id: Penimbun Emas

source: Collect all the coins.
hu_hu: Gyűjtsd össze az összes érmét.
id: Kumpulkan semua koinnya.

source: Speed Trader
hu_hu: Villámkereskedő
id: Pedagang Ulung

source: Playing the economy game, eh?
id: Mencoba berbisnis dalam permainan, ya?

source: Speedrun
hu_hu: Gyorsmenet
id: Pelari-cepat

source: Complete the game within 1 hour.
hu_hu: Teljesítsd a játékot 1 órán belül.
id: Menyelesaikan permainan dalam 1 jam.

source: Win!
hu_hu: Győzelem!
id: Menang!

source: Congratulations, you just won the game!
hu_hu: Gratulálunk, épp megnyerted a játékot!
id: Selamat, kamu baru saja memenangkan permainan ini!

source: Rampage!
hu_hu: Tombolás!
id: Mengamuk!

source: Kill 5 enemies in 10 seconds.
hu_hu: Ölj meg 5 ellenséget 10mp alatt.
id: Membunuh 5 musuh dalam 10 detik.

source: Cube Chain
hu_hu: Kocka lánc
id: Rangkaian Kubus

source: Collect 15 points cubes in a row.
hu_hu: Gyűjts egymás után 15 pontkockát.
id: Mengumpulkan 15 poin kubus berturut-turut.

source: Grudge
id: Pendendam

source: Kill 10 of the same type of enemy in a row.
hu_hu: Egymás után ölj meg 10-et azonos típusú ellenséget.
id: Membunuh 10 musuh yang sama berturut-turut.

source: Jackalope
id: Kelinci Lompat

source: Bound, bound, bound and rebound!
id: Lompat, lompat, lompat dan melompat!

source: Try to eat all kinds of enemies.
hu_hu: Egyél meg különféle ellenségeket.
id: Mencoba memakan segala jenis musuh.

source: Dream on...
hu_hu: Álmodj csak...
id: Mengigau...

source: That's the infinite cage.
hu_hu: Az a végtelen ketrec.
id: Itulah kurungan tanpa batas.

source: Geosynchronous Orbit Achieved
id: Pencapaian Orbit Geosinkron

source: Now applying artificial gravity.
hu_hu: Mesterséges gravitáció bekapcsolása.
id: Sekarang menerapkan gravitasi buatan.

source: Stonepipe Bridge
id: Jembatan Stonepipe

source: Ambush!
hu_hu: Csapda!
id: Penyergapan!

source: Victory!
hu_hu: Győzelem!
id: Menang!

source: Blocks Run
id: Lari Balok

source: You got {level.player.score} points in the Blocks Run!
id: Kamu mendapat {level.player.score} poin di Lari Balok!

source: This is a new high score!
hu_hu: Túlszárnyaltad az előző top pontszámot!
id: Ini adalah high score yang baru!

source: The high score is {registry.arcade_blocks_high_score}.
hu_hu: A jelenlegi legnagyobb pontszám {registry.arcade_blocks_high_score}.
id: High score-nya adalah {registry.arcade_blocks_high_score}.

source: Down the Rabbit Hall
hu_hu: Lefelé a nyúl termébe
id: Melewati Sarang Kelinci

source: You got {level.player.vars.score} points going down the rabbit hall!
id: Kamu mendapat {level.player.vars.score} poin saat melewati sarang kelinci!

source: The high score is {registry.arcade_down_the_rabbit_hall_high_score} points.
hu_hu: A jelenlegi legnagyobb pontszám {registry.arcade_down_the_rabbit_hall_high_score}.
id: High score-nya adalah {registry.arcade_down_the_rabbit_hall_high_score} poin.

source: Maintenance Shaft
hu_hu: Szervízakna
id: Lorong Perawatan

source: You got {level.player.vars.score} points in the maintenance shaft!
id: Kamu mendapat {level.player.vars.score} poin di lorong perawatan!

source: The high score is {registry.arcade_maintenance_shaft_high_score} points.
hu_hu: A jelenlegi legnagyobb pontszám {registry.arcade_maintenance_shaft_high_score}.
id: High score-nya adalah {registry.arcade_maintenance_shaft_high_score} poin.

source: You got {level.player.vars.score} points in the Nutty Factory!
id: Kamu mendapat {level.player.vars.score} poin di Pabrik Kegilaan!

source: The high score is {registry.arcade_nutty_factory_high_score} points.
hu_hu: A jelenlegi legnagyobb pontszám {registry.arcade_nutty_factory_high_score}.
id: High score-nya adalah {registry.arcade_nutty_factory_high_score} poin.

source: The Long Haul
hu_hu: A hosszú menet
id: Perjalanan Panjang

source: You got {level.player.vars.score} points in the long haul!
id: Kamu mendapat {level.player.vars.score} poin di perjalanan panjang!

source: The high score is {registry.arcade_the_long_haul_high_score} points.
hu_hu: A jelenlegi legnagyobb pontszám {registry.arcade_the_long_haul_high_score}.
id: High score-nya adalah {registry.arcade_the_long_haul_high_score} poin.

source: Upper Deck
hu_hu: Felső fedélzet
id: Dek Atas

source: You got {level.player.vars.score} points on the Upper Deck!
id: Kamu mendapat {level.player.vars.score} poin di dek atas!

source: This is a new record!
hu_hu: Új rekordot állítottál be!
id: Rekor baru terpecahkan!

source: The high score is {registry.arcade_upper_deck_high_score} points.
hu_hu: A jelenlegi legnagyobb pontszám {registry.arcade_upper_deck_high_score}.
id: High score-nya adalah {registry.arcade_upper_deck_high_score} poin.

source: Wild New Wonder
hu_hu: Vad új csoda
id: Keajaiban Baru Alam Liar

source: You got {level.player.vars.score} points in the Wild New Wonder!
id: Kamu mendapat {level.player.vars.score} poin di keajaiban baru alam liar!

source: The high score is {registry.arcade_wild_new_wonder_high_score} points.
hu_hu: A jelenlegi legnagyobb pontszám {registry.arcade_wild_new_wonder_high_score}.
id: High score-nya adalah {registry.arcade_wild_new_wonder_high_score} poin.

source: Autumn Town
hu_hu: Ősz város
id: Kota Musim Gugur

source: Bombing Fools
id: Pengebom Gila

source: Well, you made it! Now just up ahead there is a gate. If you can get through it you'll make it to the limestone caverns. There is said to be an entry way directly into Milgram's compound from the caverns.
hu_hu: Nos, túljutottál! Pont egyesen van egy kapu. Ha túl tudsz jutni rajta, eléred a mészkő barlangokat. Úgy hírlik, hogy van egy közvetlen bejárat Milgram táborába a barlangból.
id: Bagus, kamu berhasil! Nah di atas sana ada sebuah gerbang. Jika kamu berhasil melaluinya kamu akan sampai di gua Limestone. Ada yang bilang kalau dalam gua itu ada jalan tembus menuju markasnya Milgram.

source: Whoah, a bunch of caverns now? This seems like it's harder than what the elder led me to believe!
hu_hu: Hűű, egy csomó barlang mostmár? Ez nehezebbnek tűnik, mint amit a rangidős sejttetett velem!
id: Wow, kenapa guanya banyak sekali? Ini nampaknya lebih sulit dari yang tetua katakan padaku!

source: I guess the forests have become infested over the years. Hopefully the caverns won't be too much worse!
hu_hu: Gondolom az erdő az évek során megfertőződtek. Remélhetőleg a barlangok nem lesznek rosszabbak!
id: Aku rasa hutannya telah penuh sesak dalam beberapa tahun belakangan. Semoga saja guanya tidak jauh lebih buruk daripada ini!

source: I hope not. Thank you for guiding me and meeting me here.
hu_hu: Remélem nem. Köszönöm, hogy kísértél és találkoztál itt velem.
id: Aku harap tidak. Terima kasih telah membimbingku dan menemuiku di sini.

source: You're welcome, friend. Naturally I won't be able to fly into the caverns, so this is the last you will see of me. Take care and teach Milgram a lesson for us all!
hu_hu: Szívesen, barátom. Természetesen a barlangban már nem tudok repülni, így itt elválnak útjaink. Vigyázz magadra s tanítsd móresre Milgramot mindannyiunk nevében.
id: Sama-sama kawan. Karena aku tidak bisa terbang ke dalam gua, maka ini adalah kali terakhir kau bisa menemuiku. Berhati-hatilah dan beri Milgram pelajaran untuk kami semua!

source: Bug Mining
hu_hu: Bogár bányászat
id: Penambangan Serangga

source: Burn and Bubble
hu_hu: Égetés és pukkanás
id: Bakar dan Berbuih

source: Burning Stone
hu_hu: Ízzó kő
id: Batu Membara

source: I need to go up... There must be a way to activate this elevator.
hu_hu: Felfelé kell haladnom...Biztosan tudom valahogy aktiválni a liftet.
id: Aku harus naik ke atas... Pasti ada cara untuk mengaktifkan lift ini.

source: Caverns of Holes
hu_hu: Lyukasüreg
id: Gua Penuh Lubang

source: Chopple's General Store
hu_hu: Chopple mindenes boltja
id: Toko Serba Ada Chopple

source: Crevice Bridge
hu_hu: Hasadék híd
id: Jembatan Crevice

source: Crevice Village
hu_hu: Hasadék falva
id: Desa Crevice

source: What the...
hu_hu: Mi a...
id: Apa yang...

source: You!!
hu_hu: Te!!
id: Kau!

source: Yes
hu_hu: Igen
id: Ya

source: You're an intruder, aren't you?!
hu_hu: Egy betolakodó vagy, nemde?
id: Kamu ini penyusup ya?

source: I thought so!
hu_hu: Ahogy sejtettem!
id: Sudah kuduga!

source: No
hu_hu: Nem
id: Tidak

source: There's no fooling me.
hu_hu: Nem versz át olyan könnyen.
id: Jangan bodohi aku.

source: You look like a very suspicious character.
hu_hu: Ez kimondottan gyanús személynek tűnsz.
id: Kau nampak seperti orang yang sangat mencurigakan.

source: Could you just step aside?
hu_hu: Félre tudnál lépni az útból?
id: Bisakah kamu minggir dari situ?

source: I need to take care of something in town.
hu_hu: El kell intéznem valamit a városban.
id: Aku harus membereskan sesuatu di kota.

source: Well, I can't let anyone past this gate.
hu_hu: Nos, nem engedhetek senkit sem át ezen a kapun.
id: Begitukah, aku tidak bisa membiarkan siapapun melewati gerbang ini.

source: Without this key, you're not getting anywhere.
hu_hu: E kulcs nélkül nem jutsz innen sehová.
id: Tanpa kunci ini, kau tidak mungkin sampai ke tempat yang kau tuju.

source: Okay. Will you please lend me that key?
hu_hu: Ok. Kölcsön adod kérlek azt a kulcsot?
id: Baiklah. Sekarang bisakah kau pinjamkan kunci itu?

source: No way! Over my dead body!
hu_hu: Hogy képzeled!? Csak a testemen keresztül!
id: Yang benar saja! Langkahi dulu mayatku!

source: We can do that.
hu_hu: Ez menni fog.
id: Aku bisa lakukan itu.

source: Hidden Cave
hu_hu: Rejtett barlang
id: Gua Tersembunyi

source: Ahh, good, you made it through there in one piece!
hu_hu: Ahh, helyes, sikerült egy darabban idejutnod!
id: Ahh, bagus, kau telah berhasil melaluinya dengan selamat!

source: Yeah, those goons had a little ambush set up.
hu_hu: Igen, azok a banditák egy kisebb csapdát állítottak fel.
id: Yah, penjahat-penjahat itu telah menyiapkan beberapa penyergapan.

source: So, now what?
hu_hu: Na, akkor hogyan tovább?
id: Jadi, apa selanjutnya?

source: Well, as you know, the town is split into two halves.
hu_hu: Nos, amint tudod, a város két részre van felosztva.
id: Ya, seperti yang kau tahu, kota ini telah terbagi menjadi dua.

source: Milgram has this half of the town locked down tight, and he has most of the residents held prisoner.
hu_hu: Milgram szorosan zár alatt tartja a város ezen felét és a lakók többségét foglyul ejtette.
id: Milgram telah mengunci kota bagian ini dengan rapat, dan dia telah menyandera hampir semua penduduk kota.

source: They're tied up inside the houses, under guard. If you free them, I'm sure they can help you.
hu_hu: Megkötözve őrizetben tartja őket a házakban. Ha sikerül kiszabadítanod őket, biztosan segítenek Neked.
id: Mereka diikat dalam rumah-rumah dan dijaga. Jika kamu membebaskan mereka, aku yakin mereka akan membantumu.

source: Makes sense.
hu_hu: Logikusan hangzik.
id: Masuk akal.

source: Your big problem will be that the gate connecting the two halves of town has been locked.
hu_hu: A legnagyobb gondod az lesz, hogy hogy a két város felet összekötő kaput lezárták.
id: Masalah terbesarmu adalah gerbang yang menghubungkan kedua belah kota telah dikunci.

source: And I don't think there's a guard next to it, whom you can steal the key from.
hu_hu: És nem hiszem, hogy lenne mellette őr, akitől ellophatnád a kulcsot.
id: Dan kurasa tidak ada penjaga di dekatnya, yang kuncinya bisa kau curi darinya.
