Repository: frogatto/Cube_Trains_Redux
Catalog: po/*.po
Languages: hu_hu, id

source: They've probably hidden it in one of the houses, but I don't know which one.
hu_hu: Valószínűleg az egyik házban rejthették el, nem tudom melyikben.
id: Mungkin telah disembunyikan oleh mereka di salah satu rumah-rumah itu, tapi aku tidak tahu yang mana.

source: Asking one of the prisoners is probably our best bet for a clue.
hu_hu: A foglyok kikérdezése lesz a legjobb lehetőséged megtudni valamit.
id: Mungkin menanyai salah satu tahanan adalah cara terbaik untuk mendapatkan petunjuk.

source: Nope, it's locked.
hu_hu: Nem, zárva van.
id: Tidak, masih terkunci.

source: Hey! Over here!
hu_hu: Hé! Ide gyere!
id: Hei! Sebelah sini!

source: So! I've unlocked this gate, here.
hu_hu: Nos! Kinyitottam ezt a kaput!
id: Baiklah! Aku telah membuka gerbang ini.

source: Through there, is the way to where Milgram lives.
hu_hu: Arra át vezet az út oda, ahol Milgram lakik.
id: Melewati sana, adalah jalan menuju kediaman Milgram.

source: Watch your head in there.
hu_hu: Vigyázz a fejedre ott bent.
id: Hati-hati dengan kepalamu saat di dalam sana.

source: Past that, and you come to the forest.
hu_hu: Azokat elhagyod, és megérkezel az erdőhöz.
id: Lalui itu, dan kau akan sampai di hutan.

source: I haven't been there in a long time, so I'm not sure what's become of it.
hu_hu: Már régóta nem jártam arra, nem tudom hát, milyen állapotban lehet.
id: Aku sudah lama tidak ke sana, jadi aku tidak yakin kalau tempat itu masih seperti dulu.

source: The Elevator House
hu_hu: A liftház
id: Rumah Lift.

source: Who are you?
hu_hu: Te ki vagy?
id: Siapa kau?

source: I'm the hero. I'm gonna save this town!
id: Aku adalah sang pahlawan. Aku akan menyelamatkan kota ini!

source: That's my new job.
id: Itu adalah pekerjaanku yang baru.

source: That's nutty.
hu_hu: Ez bolondság!
id: Itu gila.

source: Nevertheless, let's pretend that I might actually pull it off.
id: Setidaknya, mari berpura-pura bahwa aku benar-benar melakukannya.

source: Got any advice?
hu_hu: Van bármi ötleted?
id: Ada saran?

source: Keep an eye out for it!
hu_hu: Tartsd nyitva a szemed érte!
id: Berhati-hatilah

source: Maybe.
hu_hu: Talán.
id: Mungkin.

source: OH! One other thing.. the key that opens the town gate is a SILVER key.
id: OH! Satu hal lagi... kunci untuk gerbang kota adalah kunci yang PERAK.

source: Yeah, that key right next to you - I think that unlocks a house that has the key to the town gate.
hu_hu: Igen, az a kulcs ott melletted - azt hiszem az nyitja annak a háznak a zárját, ahol a városkapu kulcsa van.
id: Yeah, kunci yang di sebelahmu itu aku rasa untuk membuka rumah yang di dalamnya terdapat kunci untuk gerbang kota.

source: Will do. Catch ya around.
hu_hu: Meglesz. Még később találkozunk.
id: Baiklah. Sampai jumpa.

source: HEY, WAIT! What about me?!
hu_hu: HÉ, VÁRJ! Velem mi lesz?!
id: HEY, TUNGGU! Bagaimana denganku?!

source: Do I look like I have a key for your cage?
id: Memangnya aku punya kunci untuk kurunganmu itu?

source: Ah, I see.. carry on then.
hu_hu: Ah, értem.. folytasd csak akkor.
id: Ah, begitu.. kau bisa pergi.

source: Thank God it's you!
hu_hu: Hál' Isten, hogy Te vagy az!
id: Syukurlah kau datang!

source: Hey, Hedge, you alright?
hu_hu: Hé, Hedge, minden rendben?
id: Hei, Hedge, kau tidak apa-apa?

source: Besides the obvious cage situation.
hu_hu: Mármint a nyilvánvaló ketrec dolgot leszámítva.
id: Selain masalah kurungan ini.

source: Eh, I've been better, but yeah, I'm okay.
hu_hu: Eh, volt már jobb is, de megvagyok.
id: Eh, aku kurang nyaman, tapi yah, aku baik-baik saja.

source: Yeah. Sad to say, I can't pick locks. I got nothing.
hu_hu: Ja. Bár szomorú, de nem tudok zárakat feltörni. Nincs semmim hozzá.
id: Yah, Sayangnya, aku tidak bisa membobol kunci. Jadi aku tidak bisa berbuat apa-apa.

source: So I'm stuck here, huh?
hu_hu: Akkor itt ragadtam, mi?
id: Jadi aku tidak bisa keluar?

source: Yep.
hu_hu: Bizony.
id: Yup.

source: Hmm, you know, I know one thing that might help you..
hu_hu: Hmm, tudod, van valami, ami lehet, hogy segítene Neked...
id: Hmm, kau tahu, Aku tahu satu hal yang mungkin dapat menolongmu..

source: Phooey.
hu_hu: Hajaj.
id: Alamak.

source: There's supposedly a secret room in this house.
hu_hu: Állítólag van a házban egy titkos szoba.
id: Seharusnya ada ruang rahasia dalam rumah ini.

source: Oh really? Where at?
hu_hu: Igazán? És merre?
id: Oh benarkah? Ada di mana?

source: If I knew that, it wouldn't be much of a secret, would it?
hu_hu: Ha tudnám, akkor már nem igazán lenne titkos, nemde?
id: Jika aku mengetahuinya, maka bukan rahasia lagi namanya, bukan begitu?

source: Figures. Well, thanks for the help!
hu_hu: Jogos. Nos, köszönöm a segítséget!
id: Kau benar. Terima kasih atas bantuannya!

source: Good luck!
hu_hu: Sok szerencsét!
id: Semoga beruntung!

source: Jeez, I *swear* this house didn't look THIS big from the outside!
hu_hu: Jesszus, *esküszöm* kívülről nem volt EKKORA ez a ház!
id: Ya ampun, aku *bersumpah* rumah ini tidak sebesar INI saat dilihat dari luar!

source: Uh, oh, I can hear a lot of feet tromping around...
id: Uh huh, Aku bisa mendengar banyak suara langkah kaki di dekat sini...

source: Central House
hu_hu: Központi ház
id: Rumah Utama

source: Something's odd about this fireplace.
hu_hu: Valami furcsa ezen a kandallón.
id: Ada yang aneh dengan perapian ini.

source: Wow, you guys look exactly alike.
hu_hu: Óó, pont ugyanúgy néztek ki.
id: Wow, kalian berdua sangat mirip.

source: We're twins.
hu_hu: Ikrek vagyunk.
id: Kami kembar.

source: Is there anything you can do to help us?
hu_hu: Van esetleg valami amiben tudnál segíteni nekünk?
id: Adakah yang bisa kau lakukan untuk menolong kami?

source: Not yet. Sorry.
hu_hu: Még nincs. Sajnálom.
id: Belum ada. Maaf.

source: Hey, I'm trying to help save the town.
hu_hu: Hé, a város megmentésében próbálok segédkezni.
id: Hei, aku sedang mencoba menyelamatkan kota.

source: Can you give me any advice?
hu_hu: Van valami tanács számomra?
id: Bisakah kalian memberiku saran?

source: The elder's house is off to the east, past the town gate.
hu_hu: A rangidős háza keletre található, a városkapun túl.
id: Rumah tetua jauh di sebelah timur, melalui gerbang kota

source: We saw Milgram's lieutenant go in there.
hu_hu: Láttuk Milgram egyik hadnagyát bemenni oda.
id: Kami melihat letnannya Milgram masuk ke dalam sana.

source: How interesting.
hu_hu: Milyen érdekes.
id: Menarik sekali.

source: The Danger House
hu_hu: A vesélyes ház
id: Rumah Bahaya

source: Fan House
hu_hu: Szellőző ház
id: Rumah Kipas Angin

source: Argh! Who in the world would design a house like this?
hu_hu: Ah! Ki a fene tervezne egy ilyen házat?
id: Aaahh! Siapa sih yang mendesain rumah seperti ini?

source: It seems I'm trapped inside this house.
hu_hu: Úgy tűnik beragadtam a házban.
id: Sepertinya aku terperangkap dalam rumah ini.

source: I guess the only way out is in!
hu_hu: Úgy néz ki, hogy az egyetlen kiút az befele vezet!
id: Aku rasa satu-satunya jalan keluar ada di dalam!

source: This is decidedly unpleasant.
hu_hu: Ez kétségkívül kellemetlen.
id: Ini benar-benar tidak menyenangkan.

source: You don't say.
hu_hu: Nem mondod..
id: Jangan bilang.

source: When I stepped in the door, it locked behind me.
hu_hu: Amikor beléptem az ajtón, az azonnal becsukódott mögöttem.
id: Saat aku masuk melewati pintu, tiba-tiba pintunya terkunci.

source: That's actually a rather clever way to round everyone up.
hu_hu: Ez igazából egy elég ötletes módja, hogy az embereket összegyűjtse.
id: Itu sebenarnya adalah cara yang cukup pintar untuk mengurung orang.

source: Know anything helpful about this house?
hu_hu: Tudsz bármi hasznosat erről a házról?
id: Tahu sesuatu yang berguna tentang rumah ini?

source: Unfortunately I don't. I was just visiting.
hu_hu: Sajnálatosan nem. Csak látogatóba jöttem.
id: Sayangnya tidak. Aku hanya berkunjung ke sini.

source: The floorplan is quite loony.
hu_hu: Eléggé őrült az alaprajza.
id: Rancangan bangunan ini benar-benar gila.

source: Marvelous ventilation, though.
hu_hu: Ellenben lenyűgöző a szellőztetés.
id: Tapi, ventilasinya keren juga.

source: Anyways, I'd better be off. I'm trying to sort out this mess.
hu_hu: Mindenesetre jobb, ha megyek. Próbálom megoldani ezt a zűrt!
id: Pokoknya, aku harus keluar. Aku akan mencoba membereskan kekacauan ini.

source: Good luck.
hu_hu: Egy kalappal.
id: Semoga beruntung.

source: The Elder's House
hu_hu: A rangidős háza
id: Rumah Tetua

source: How's that business with Milgram going?
hu_hu: Hogy mennek dolgok Milgrammal?
id: Bagaimana urusanmu dengan Milgram?

source: I'm working on it.
hu_hu: Dolgozom rajta.
id: Masih kukerjakan.

source: That's good to hear!
hu_hu: Ezt jó hallani!
id: Baguslah kalau begitu!

source: Ugh.
hu_hu: Uh.
id: Uh.

source: For the last time, we *know* you've got the money somewhere.
hu_hu: Utoljára mondom, *tudjuk*, hogy itt van a pénzed valahol.
id: Ini adalah kali terakhir, kami "tahu" kau menyimpan uang itu di suatu tempat.

source: Make this easy on yourself.
hu_hu: Könnyítsd meg a helyzetet magadnak.
id: Demi keselamatanmu sendiri.

source: I have no idea what you're talking about.
hu_hu: Fogalmam sincs, hogy miről beszéltek.
id: Aku tidak tahu apa yang sedang kau bicarakan.

source: Er.. Right, uh, it's over here..
hu_hu: Öö..Rendben, hm, itt erre van...
id: Um.. Benar, um, uangnya ada di sebelah sini..

source: Oh, no you don't!
hu_hu: Oh, eszedbe ne jusson!
id: Hei, mau ke mana kau!

source: If you don't tell... uh...
hu_hu: Ha nem mondod.... uh...
id: Jika kau tidak mengatakan... em...

source: You're not going anywhere, buster! Now, listen up, You're SERIOUSLY testing my patience.
hu_hu: Nem mész sehova, öcskös! És most, figyelj csak, ELÉGGÉ keményen próbára teszed a türelmemet.
id: Kau tidak akan kemana-mana, sialan! Sekarang, dengar, Kau BENAR-BENAR menguji kesabaranku.

source: Oh, hi, what's going on here?
hu_hu: Oh, hello, mi folyik itt?
id: Oh, hai, ada apa ini?

source: Who the hell are you?
hu_hu: Ki a fene vagy?
id: Siapa kau ini?

source: Frogatto, at your service.
hu_hu: Frogatto, szolgálatodra.
id: Frogatto, siap melayani.

source: I don't have to put up with this.
hu_hu: Nem vagyok hajlandó ezt elviselni.
id: Aku sudah tidak tahan lagi.

source: Excuse me whilst I vent a little frustration.
hu_hu: Bocsáss meg, amíg levezetem egy kicsit a dühömet.
id: Permisi sebentar aku sedang menangani rasa frustasiku.

source: Okay, I've had enough! I'm going home.
hu_hu: Rendben, elegem van! Megyek haza.
id: Oke, cukup sudah! Aku pulang.

source: Well! That went better than expected.
hu_hu: Nos! Ez jobban ment, mint gondoltam.
id: Ya! Semua berjalan dengan lancar.

source: Say ... What happened to the elder?
hu_hu: Mondd... Mi lett a rangidőssel?
id: Jadi... Apa yang terjadi pada tetua?

source: Whoa... ... is that what I think it is?
hu_hu: Eej.... ...ez az, aminek gondolom?
id: Wow... ... apakah itu seperti yang kupikirkan?

source: It is indeed, my boy!
hu_hu: Valóban az, fiacskám!
id: Kau benar, anakku!

source: It's my very own safe room.
hu_hu: A különbejáratú biztonságiszobám!
id: Ini adalah ruang rahasiaku.

source: Built it for exactly this sort of crisis.
hu_hu: Épp egy ilyen krízis idejére építettem.
id: Sengaja dibangun untuk keadaan genting seperti ini.

source: I better leave this key here.
hu_hu: Jobb, ha itt hagyom ezt a kulcsot.
id: Aku sebaiknya meninggalkan kunci ini di sini.

source: Hey!
hu_hu: Hé!
id: Hei!

source: Glad I caught you! You'd better be aware of this...
hu_hu: Örülök, hogy utolértelek! Jobb, ha tudsz róla, hogy...
id: Untung aku berhasil mengejarmu! Kau sebaiknya waspada...

source: The cave that leads into the town, has a sentry posted in it.
hu_hu: A város felé vezető barlangban egy őrszem van szolgálatban.
id: Di gua yang menuju ke kota, ada penjaga di dalamnya.

source: Milgram's trying to seal off the town, so no one gets in or out.
hu_hu: Milgram próbálja lezárni a várost, így se be, se ki nem juthat senki.
id: Orang-orang Milgram mencoba mengisolasi kota itu, jadi tidak ada yang bisa keluar-masuk.

source: That might have been why he tried to take out that bridge.
hu_hu: Lehet pont emiatt próbálta azt a hidat megsemmisíteni.
id: Itu mungkin adalah alasan mengapa dia berusaha menghancurkan jembatan itu.

source: If you're thinking to go in there, you might reconsider.
hu_hu: Ha azt tervezted, hogy bemész oda, lehet jobb, ha újra megfontolod.
id: Jika kau berpikir untuk masuk ke sana, mungkin kau akan berpikir dua kali.

source: Well, yeah, I was gonna go in there.
hu_hu: Nos, igen, úgy terveztem, hogy bemegyek oda.
id: Ya, memang, aku berencana masuk ke sana.

source: I mean, what are we gonna do, sit on our butts here?
hu_hu: Úgy értem, mit fogunk tenni, csak ülünk itt a fenekünkön?
id: Maksudku, apa yang akan kita lakukan, berdiam diri saja di sini?

source: No, no... but I was hoping we'd go in in force.
hu_hu: Nem, nem... de reméltem, hogy több magunkkal rontunk be.
id: Bukan, bukan... hanya saja aku berharap kita masuk ke dalam dengan pasukan yang banyak.

source: Against Milgram? Really?
hu_hu: Milgram ellen? Valóban?
id: Melawan Milgram? Benarkah?

source: I mean... on paper, that sounds like a good enough plan,
hu_hu: Úgy értem... papíron ez egy eléggé jó tervnek hangzik,
id: Maksudku... di atas kertas, itu terdengar seperti rencana yang cukup bagus,

source: but I'm gonna be a jerk here, and poke some holes in it.
hu_hu: de egy tökfilkó leszek, és meglékelem az egészet egy kicsit.
id: Tapi aku tidak suka rencana itu, besar kemungkinan rencana itu tidak akan berhasil.

source: Fair enough. I'm not particularly fond of it, myself.
hu_hu: Végülis igaz. Az én tetszésemet sem nyerte el különösebben.
id: Baiklah. Aku sendiri juga tidak menyukai rencana itu.

source: Firstly, Milgram's got LOTS of followers. Tons of em. He runs an entire city.
hu_hu: Először is, Milgramnak RENGETEG követője van. Tonnaszámnyi. Egy egész város van az irányítása alatt.
id: Pertama, Milgram memiliki BANYAK pengikut. Luar biasa banyaknya. Dia mengendalikan seisi kota.

source: I mean, even if we armed the whole town, they'd grossly outnumber us.
hu_hu: Úgy értem, még ha az egész várost felfegyvereznénk, akkor is undorító emberfölényben lennének.
id: Maksudku, bahkan jika kita mempersenjatai seisi kota, jumlah mereka tetap jauh lebih banyak.

source: Plus, they're pretty mobile, too. Planes and such.
hu_hu: Ráadásul ők eléggé mobilisak. Repülők meg ilyesmi.
id: Ditambah lagi, mereka cepat bergerak pula. Berkat pesawat dll.

source: We might get the drop on them for a bit, but we'd get surrounded in no time.
hu_hu: Lehet, hogy rajtaütéssel sikerülne egy darabig felülkerekednünk, de seperc alatt körbekerítenének minket.
id: Kita mungkin bisa mengalahkan beberapa dari mereka, tapi kita pasti akan langsung dikepung dalam sekejap.

source: Brute force against brute force won't work.
hu_hu: A nyers erő nem nyerhet a nyers erő ellen.
id: Kekuatan fisik lawan kekuatan fisik tidak akan berhasil.

source: We'd be like ... a bull butting heads with a freight train.
hu_hu: Olyan lenne...mintha bikaként egy tehervonattal mennénk ölre.
id: Perumpaannya seperti ... Kita ini adalah banteng yang beradu dengan kereta barang.

source: Yes... oh dear. I see what you mean.
hu_hu: Igen...oh istenem. Értem mire gondolsz.
id: Ya... ya ampun. Aku mengerti yang kau katakan.

source: There's got to be something we can use to our advantage, but "numerical superiority" isn't it.
hu_hu: Biztosan lennie kell valaminek, amit előnyünkre fordíthatunk, de a "számbeli fölény" nem az.
id: Pasti ada sesuatu yang bisa kita andalkan, tapi "jumlah yang lebih banyak" bukanlah jawabannya.

source: Anyways, about the cave ahead... it's just one guy, right?
hu_hu: Egyébként, a barlangra visszatérve... csak egy ember van bent, igaz?
id: Omong-omong, gua yang di depan... cuma dijaga satu orang, khan?

source: To my knowledge, yes.
hu_hu: Tudtommal, igen.
id: Setahuku, ya.

source: Maybe I can talk my way around him?
hu_hu: Talán kibeszélhetem magam, hogy átengedjen?
id: Mungkin aku bisa bernegosiasi dengannya?

source: Worse comes to worse, I can just run for it. Right?
hu_hu: Ha minden kötél szakad, akkor egyszerű elfuthatok. Igaz?
id: Jika keadaan semakin buruk, aku bisa saja kabur. Bukan begitu?

source: I do hope so. Good luck!
hu_hu: Remélem is. Sok szerencsét!
id: Aku harap begitu. Semoga berhasil!

source: Dark Corridor
hu_hu: Sötét folyosó
id: Koridor yang Gelap

source: Now what?
hu_hu: Most mi legyen?
id: Apalagi sekarang?

source: Darkness Central
hu_hu: Sötétség központ
id: Pusat Kegelapan

source: Descent to Town
hu_hu: Leereszkedés a városba
id: Menurun ke Kota

source: It says, "Chopple's General Store, just ahead.
hu_hu: Azt mondja, "Chopple Mindenes Boltja, egyenesen előre.
id: Tertulis, "Toko Serba Ada Chopple, tepat di depan.

source: Honest trade and thrifty prices!"
hu_hu: Őszinte kereskedelem és gazdaságos árak!"
id: Dapat dipercaya dan murah!"

source: Downhill
hu_hu: Lesiklás
id: Menuruni lembah

source: Dungeon Blocks
id: Blok Kastil

source: Dungeon Crawling
hu_hu: Tömlöc kúszás
id: Merangkak di Kastil

source: The Entrance
hu_hu: A bejárat
id: Jalan Masuk

source: Eerie Arbor
hu_hu: Kísérteties lugas
id: Teduh dan Menyeramkan

source: Fast Lane
hu_hu: Gyorssáv
id: Jalur Cepat

source: Flooded Caverns
hu_hu: Elárasztott barlangok
id: Sungai Bawah Tanah

source: Foreboding Forest
hu_hu: Baljóslatú erdő
id: Hutan Pemberi Pertanda Buruk

source: Frogatto's Room
hu_hu: Frogatto szobája
id: Kamar Frogatto

source: Ahh, what a beautiful .. ..Afternoon?!
hu_hu: Ahh, milyen kellemes... ...délután?!
id: Ahh, benar-benar siang yang indah .. ..Siang?!

source: Oh geez! I overslept!
hu_hu: Istenem! Bealudtam!
id: Ya ampun! Aku kesiangan!

source: Frogatto's House
hu_hu: Frogatto háza
id: Rumah Frogatto

source: Hey, how's breakfast coming?
hu_hu: Hé, hogy áll a reggeli?
id: Hei, bagaimana dengan sarapannya?

source: Breakfast? ..bud, we're on lunch.
hu_hu: Reggeli?..öreg, már ebédre készülünk.
id: Sarapan? ..sobat, kita ini akan makan siang.

source: You need to get up earlier.
hu_hu: Hamarabb kellene felkelned.
id: Kau seharusnya bangun lebih awal.

source: Okay, then how's lunch coming?
hu_hu: Ok, akkor hogy áll az ebéd?
id: Oke, kapan makan siangnya siap?

source: Getting there. It's gonna be a while, though.
hu_hu: Mindjárt kész. De még eltart egy darabig.
id: Sedang dibuat. Tapi akan makan waktu lama.

source: I'll check back later, then.
hu_hu: Akkor visszanézek később.
id: Kalau begitu aku akan kembali lagi nanti.

source: So, what happened to lunch?
hu_hu: Nos, mi történt az ebéddel?
id: Jadi, bagaimana dengan makan siangnya?

source: I got tired of waiting, and ate by myself.
hu_hu: Meguntam a várakozást, és megettem egyedül.
id: Aku sudah tidak sabar, jadi aku makan sendiri.

source: Leftovers are in the fridge.
hu_hu: A maradékok a hűtőben vannak.
id: Sisanya kumasukkan kulkas.

source: Okay, uhm, thanks.
hu_hu: Ok, ööö, kösz.
id: Oke, um, terima kasih.

source: Hey, Frogatto.
hu_hu: Hé, Frogatto.
id: Hei, Frogatto.

source: Uhm... yes?
hu_hu: Öö...igen?
id: Um... ya?

source: At least TRY to get a job today, alright?
hu_hu: Legalább ma PRÓBÁLJ meg munkát szerezni, jó?
id: Setidaknya COBALAH dapatkan pekerjaan hari ini, oke?

source: We need some help around here.
hu_hu: Szükségünk van egy kis segítségre.
id: Kita di sini harus bekerjasama.

source: Yeah, I know. I'll try.
hu_hu: Igen, tudom. Megpróbálom.
id: Yah, aku tahu. Akan kucoba.

source: See to it.
hu_hu: Láss hozzá.
id: Pokoknya aku tunggu.

source: Not like I need to be up,
hu_hu: Nem mintha fent kéne lennem,
id: Sebenarnya aku tidak perlu bangun,

source: but it's the principle of the thing.
hu_hu: de ennek most így kell lennie.
id: Tapi apa kata orang nanti.

source: Pato's Room
hu_hu: Pato szobája
id: Kamar Pato

source: Ahh, what a beautiful ..
hu_hu: Ahh, milyen kellemes...
id: Ahh, selamat ..

source: ..Afternoon?!
hu_hu: ...délután?!
id: ..Siang?!

source: Yowzers, I overslept!
hu_hu: Juj, bealudtam!
id: Ya ampun, aku ketiduran!

source: it's the principle of the thing.
hu_hu: így kell lennie.
id: apa kata orang nanti.

source: I know!
hu_hu: Tudom már!
id: Aku tahu!

source: I can stop in at Nene's house on the way to town!
hu_hu: A városba menet benézek Nenéhez a házába.
id: Aku bisa mampir ke rumah Nene saat menuju ke kota!

source: Such a beautiful view from here.
hu_hu: Olyan gyönyörű a kilátás innen.
id: Di sini pemandangannya sangat indah.

source: Nothing to see in my backyard.
hu_hu: Semmi látnivaló a kertemben.
id: Tidak ada apa-apa di belakang rumahku.

source: Gloomy Glade
hu_hu: Bús tisztás
id: Tanah Lapang Rimba yang Muram

source: Gnarled Knoll
hu_hu: Bütykös dombtető
id: Bukit tak Beraturan

source: Grassy Path
hu_hu: Füves ösvény
id: Jalur Berumput

source: On this level, we give advice on how to play.
hu_hu: Ezen a pályán tanácsokat adunk a játékhoz.
id: Pada tingkat ini, kami akan memberikan saran tentang bagaimana cara bermain.

source: Each question mark has its own hint.
hu_hu: Mindegyik kérdőjelhez tartozik egy tipp.
id: Setiap tanda tanya memiliki petunjuknya masing-masing.

source: If you already know how to play, then just walk to the next level.
hu_hu: Ha már tudod, hogyan kell játszani, akkor nyugodtan sétálj a következőre.
id: Jika kamu sudah tahu cara bermain, silahkan langsung berjalan menuju tingkat selanjutnya.

source: To save the game, use one of these convenient restrooms.
hu_hu: A játék elmentéséhez használd az ilyen kényelmes illemhelyeket.
id: Untuk menyimpan permainan, gunakan salah satu ruang istirahat yang nyaman ini.

source: There is only one save file, so be careful not to overwrite it!
hu_hu: Csak egy mentési állomány van, vigyázz tehát, nehogy felülírd!
id: Hanya ada satu berkas penyimpanan, jadi hati-hati jangan sampai berkasnya ditimpa.

source: Some jumps are too high to clear with just a normal jump.
hu_hu: Egyes helyek túl magasak ahhoz, egy egy normál ugrással elérd.
id: Beberapa lompatan tidak bisa dicapai dengan lompatan biasa.

source: Fortunately, Frogatto can jump off of walls, too!
hu_hu: Szerencsére Frogatto el tud rugaszkodni a falakról!
id: Untungnya, Frogatto bisa melompat di dinding, juga!

source: To do this, do a walking jump into the wall.
hu_hu: Ehhez ugorj a falra séta közben.
id: Untuk melakukan ini, berjalan dan melompat ke dinding.

source: If you bump into the wall at the crest of the jump, Frogatto will cling to the wall and slowly slide down.
id: Jika kamu menabrak dinding saat melompat, Frogatto akan menempel di dinding dan meluncur ke bawah dengan perlahan.

source: If you don't get a running start you can still cling on, if you tap the arrow toward the wall, and press jump.
hu_hu: Ha nem sikerül nekifutni, még akkor is megkapaszkodhatsz a falban, ha megnyomod a nyilat a fal felé és ugrasz.
id: Jika kamu tidak memulainya dengan berlari maka kamu masih bisa menempel, jika kamu menekan tombol panah ke arah dinding, dan menekan lompat.

source: Whilst you are clinging to the wall, pressing jump will make you rebound off.
hu_hu: Miközben a falra kapaszkodsz, az ugrás újboli megnyomására elrugaszkodsz ismét.
id: Saat kamu menempel di dinding, menekan lompat akan membuatmu memantul lagi.

source: If two walls are facing each other, this is very useful, because then you can rebound over and over between them.
hu_hu: Ha két fal szemben áll egymással, akkor ez nagyon hasznos lehet, mivel ekkor folyamatosan tudsz oda-vissza ugrálni.
id: Jika ada dua dinding yang saling berhadapan, maka situasi ini bisa dimanfaatkan, karena kamu bisa melompat-lompat di antara keduanya.

source: This lets you ascend vertical columns.
hu_hu: Ennek segítségével feljuthatsz függőleges oszlopokra.
id: Dengan begitu kau bisa memanjat di lorong vertikal.
