Repository: frogatto/Cube_Trains_Redux
Catalog: po/*.po
Languages: hu_hu, id

source: Yes, it's unreasonable to expect someone to just charge in there.
hu_hu: Igen, ésszerűtlen azt várni bárkitől is, hogy csak rontson be oda.
id: Ya, mengharapkan seseorang menyerang ke sana itu memang tidak masuk akal.

source: I'm at a loss for a plan, myself.
hu_hu: Jómagam is ötlet hiányában szenvedek.
id: Aku sendiri sudah kehabisan akal.

source: Nevertheless, I'd better be going. Hopefully, we'll fix that bridge soon. Impressive how fast they can do that, with modular construction and all.
hu_hu: Mindenesetre jobb, ha megyek. Remélhetőleg nemsokára megjavítjuk azt a hídat. Lenyűgöző, hogy milyengyorsan rendbe tudják tenni akészelemeknek köszönhetően.
id: Setidaknya, aku sebaiknya segera berangkat. Semoga saja, kita bisa memperbaiki jembatan itu segera. Menakjubkan melihat mereka memperbaikinya dengan begitu cepat, berkat konstruksi modular dan teknologi-teknologi lainnya.

source: In the meantime, you might benefit from visiting the fellow who lives here.
hu_hu: Addig is, javadra lehet, ha el- látogatsz az itt lakó fickóhoz.
id: Sementara itu, kau mungkin akan memperoleh keuntungan dengan mengunjungi seorang kawan yang tinggal di sini.

source: Bit of a recluse, but he's quite sharp. He lives on top of this rock column.
hu_hu: Kicsit zárkózott, de elég ravasz. Ennek a kőpillérnek a tetején él.
id: Dia suka menyendiri, tapi dia sangat cerdas. Dia tinggal di puncak bukit ini.

source: And I get up there... how?
hu_hu: És oda ...hogy jutok fel?
id: Aku naik kesana... caranya?

source: Simple, just take to the air!
hu_hu: Egyszerű, csak szárnyalj!
id: Mudah, tinggal terbang!

source: You ... do realize I can't fly?
hu_hu: De...ugy tisztában vagy vele, hogy nem tudok repülni?
id: Kau ... tahu khan aku tidak bisa terbang?

source: Splash, Hop
hu_hu: Csobbanás, szökellés
id: Splash, Lompat

source: Starlit Cave
hu_hu: Csillagfényes barlang
id: Gua Starlit

source: Stonepipe Meadow
id: Padang Rumput Stonepipe

source: Mac/Windows/iPhone Packager
hu_hu: Mac/Windows/iPhone csomagoló
id: Pengemas Mac/Windows/iPhone

source: Programmer (esp. helping with iPhone integration)
hu_hu: Programozó (főleg segítés az iPhone integrációval)
id: Programer (terutama yang membantu integrasi iPhone)

source: Minor Object Scripter and Level Designer
hu_hu: Al objektum szkripter és pálya designer
id: Perancang Obyek Minor dan Perancang Level

source: So let me get this straight...
hu_hu: Tehát ha jól értem ezt...
id: Jadi langsung saja ke pokok permasalahan...

source: What you're saying, is that the elder borrowed all this money from you,
hu_hu: Azt mondod, hogy a rangidős kölcsökérte ezt a rengeteg pénzt tőled,
id: Kau bilang, bahwa tetua meminjam semua uang ini darimu,

source: and it was meant to be used on civil projects for the town?
hu_hu: és a város javára civil beruházásokra lett volna?
id: Dan seharusnya uang itu digunakan untuk proyek-proyek pembangunan di kota?

source: Exactly!
hu_hu: Pontosan!
id: Tepat sekali!

source: In fact, I came to him with the idea. It was meant to be philanthropy.
hu_hu: Lényegében, én kerestem fel az ötlettel. Emberbarátiságot próbáltam gyakorolni.
id: Bahkan, aku sendiri yang menawarkan ide itu. Aku bermaksud untuk menyumbangkan uang itu.

source: I thought a 'mayor' would be responsible, but instead he's spending it all on himself!
hu_hu: Azt hittem egy 'polgármester' talán felelőségteljesebb lesz, de ehelyett mindet magára költi!
id: Aku pikir seorang 'walikota' akan bertanggungjawab, tapi kenyataannya dia justru menghamburkan semua uang itu untuk dirinya sendiri.

source: And now he's refusing to repay you?
hu_hu: Most meg nem hajlandó visszafizetni?
id: Dan sekarang dia menolak untuk mengembalikan semua uangmu itu?

source: That's right!
hu_hu: Így van!
id: Itu benar!

source: I never thought him to be the charismatic type,
id: Aku tidak pernah membayangkan bahwa dia adalah tipe orang yang karismatik,

source: In fact, I rather thought him to be a buffoon.
id: Bahkan, aku sempat berpikir dia ini pelawak.

source: Ah, there we are...
hu_hu: Ah, erről van szó...
id: Ah, ini dia...

source: Fetch some for our guest, would you, kindly?
id: Tolong beri juga untuk tamu kita, jika kau tidak keberatan?

source: As I was saying, he doesn't seem to be the type,
id: Seperti yang kukatakan, dia tidak seperti yang kupikirkan,

source: But somehow, he's turned the entire town against me,
id: Tapi entah bagaimana, dia berhasil menghasut seisi kota untuk melawanku,

source: He convinced them that I'm running some sort of protection racket.
id: Dia meyakinkan mereka bahwa aku sedang menjalankan pungli.

source: Which I'll admit... ...isn't too hard to believe.
id: Yang harus kuakui... ... tidaklah sulit untuk dipercaya.

source: Uh.. yeah.
hu_hu: Uh...igen.
id: Ya.. memang.

source: I mean, you did send thugs in to shake him down.
hu_hu: Úgy értem, mégis csak beküldtél banditákat, hogy helyre tegyék.
id: Maksudku, kenyataannya kau memang mengirim berandalan-berandalan untuk menakuti dia.

source: That REALLY does look bad.
hu_hu: Az TÉNYLEG nem fest túl jól.
id: Itu BENAR-BENAR terlihat jahat.

source: Oh absolutely! It makes me look beastly!
hu_hu: Oh, teljes mértékben! Engem tűntet fel agresszívnak!
id: Oh tentu! Itu membuatku terlihat buas!

source: But consider this... What other option did I have?
hu_hu: De gondolj bele... Milyen más lehetőségem maradt?
id: Tapi coba pikir... Cara apa lagi yang bisa kulakukan?

source: I'd have sent the police in, but.. ..there AREN'T ANY police!
hu_hu: Beküldtem volna a rendőrséget, de... ...NINCS SEMMIFÉLE rendőrség!
id: Aku mencoba mengirim polisi, tapi.. .. di sana TIDAK ADA polisi!

source: There's not even any government!
hu_hu: Még csak kormányunk sincs!
id: Pemerintahan saja tidak ada!

source: The town elder wasn't VOTED as mayor, he just decided he's old enough that everyone should just do what he says.
hu_hu: A rangidőst nem SZAVAZTÁK meg polgármesternek, csupán eldöntötte, hogy kellően idős ahhoz, hogy mindenki azt tegye, amit mond.
id: Tetua kota tidaklah DIPILIH orang-orang sebagai walikota, dia diangkat hanya karena dialah yang paling tua sehingga semua orang menuruti semua yang dia katakan.

source: Not that anyone listens to him anyways.
hu_hu: Nem mintha bárki is hallgatna rá.
id: Tapi sebenarnya tidak semua orang mengikuti yang dia katakan.

source: They don't have a fire department, they don't have any schools, it's all just this absurd mess!
hu_hu: Nincs tűzoltóságuk, nincsenek iskoláik, az egész egy abszurd zűrzavar!
id: Mereka tidak punya pemadam kebakaran, mereka tidak punya sekolah sama sekali, keadaannya benar-benar kacau!

source: This ... is true.
hu_hu: Ez...igaz.
id: Itu ... memang benar.

source: Blast it all!
hu_hu: A fenébe az egésszel!
id: Dasar sialan!

source: Where I run things, there's some actual law and order. Decent, civilized society!
hu_hu: Ahol én uralkodom, ott rend és törvény van. Tisztességes, civilizált társadalom!
id: Saat aku menjalankan sesuatu, maka akan ada hukum dan aturan yang nyata. Masyarakat yang beradab dan bermoral!

source: Thank you Jeeves, that will do nicely.
hu_hu: Köszönöm Jeeves, ez így pompás.
id: Terima kasih Jeeves, itu sudah cukup.

source: So, anyhow, when I finally sent the lads to deal with things, it got rather messy.
hu_hu: Nos, mindenesetre, amikor végre beküldtem a srácokat intézkedni, akkor eldurvult a helyzet.
id: Jadi, entah bagaimana, saat aku akhirnya mengirimkan orang-orang untuk membereskan masalah, keadaan jadi agak kacau.

source: But you'll note, you'll note carefully.. ..besides being manhandled, no one did actually get hurt.
hu_hu: De megfigyelheted, igazán megfigyelheted.. ..bár meg lettek kötözve, de igazából senki sem sérült meg.
id: Tapi kau akan ingat, kau akan ingat baik-baik.. ..selain sedikit kekerasan, tidak ada orang yang benar-benar terluka.

source: I *did* notice that. That kind of piqued my suspicions.
hu_hu: Az *valóban* feltűnt. Az egyébként gyanút keltett bennem.
id: Aku *memang* menyadari itu. Itu membangkitkan rasa curigaku.

source: Now, you on the other hand... You've really clobbered a few people!
hu_hu: Viszont, ha rólad van szó... Te tényleg agyonvertél pár embert!
id: Kemudian, di sisi lain... Kau benar-benar telah menghajar beberapa orang!

source: I'm really kinda sorry about that now!
hu_hu: Azt már tényleg nagyon sajnálom.
id: Aku benar-benar agak menyesalinya sekarang!

source: I appreciate the apology. And don't worry about the kitties.
hu_hu: Méltányolom a bocsánatkérést. És ne aggódj a cicusok miatt.
id: Aku hargai permintaan maafmu. Dan jangan khawatirkan anak-anak kucing itu.

source: They'll bounce back just fine; They are mass-produced after all.
hu_hu: Gond nélkül visszapattognak majd; tömeggyártásban vannak végülis.
id: Mereka akan baik-baik saja; Lagipula mereka diproduksi secara masal.

source: I ... see.
hu_hu: Én...értem.
id: Oh ... begitu.

source: Well, now that I know the whole story, I think I can help you out, big time.
hu_hu: Nos így, hogy már ismerem a teljes történetet, azt hiszem rendkívül ki tudnálak segíteni.
id: Yah, karena aku sekarang tahu cerita utuhnya, Aku rasa aku bisa membantumu, bantuan yang hebat.

source: See, I think I know where all the money is,
hu_hu: Érted, azt hiszem tudom, hol van az a sok pénz,
id: Begini, Aku rasa aku tahu di mana semua uang itu.

source: I'm hoping we can come to some mutually beneficial arrangement, regarding it.
hu_hu: bízom benne, hogy egy kölcsönösen előnyös megegyezésre tudunk jutni ez ügyben.
id: Aku harap kita bisa membuat semacam perjanjian yang bisa menguntungkan kita berdua, terkait hal ini.

source: An arrangement, hmmm? Do tell.
hu_hu: Ez megegyzés, hmm? Beszélj csak.
id: Perjanjian, hmmm? Coba katakan.

source: Well, I actually suspect that rather than spending all your money, he's hoarding it.
hu_hu: Nos, úgy gyanítom, hogy a pénzed elherdálása helyett csak halmozza.
id: Begini, aku sebenarnya curiga bahwa uangmu sebenarnya tidak dihabiskan olehnya, tapi ditimbun olehnya.

source: How bizarre.
hu_hu: Milyen bizarr.
id: Aneh sekali.

source: Yeah, it's crazy. He's... a bit crazy.
hu_hu: Igen, őrültség. Ő... is őrült picit.
id: Yeah, memang gila. Dia... agak gila.

source: But it's good news, because I think he still has all your money and a bunch more besides!
id: Tapi ini adalah berita bagus, karena kupikir dia memiliki semua uangmu dan selain itu ada banyak uang lainnya!

source: So I propose that we go and get it!
id: Jadi aku usulkan kita pergi dan mengambilnya!

source: Plus a hefty bit of interest. Penalty Fees. Late Fees. Any other fees banks normally charge.
id: Ditambah sedikit bunga. Denda. Biaya Keterlambatan. Dan biaya-biaya lain yang biasa diberikan oleh bank.

source: I like your way of thinking!
id: Aku suka cara berpikirmu!

source: Yup, and I can show you where it all is in exchange for a small consideration.
id: Yup, dan aku bisa menunjukkan padamu di mana lokasinya dan sebagai gantinya aku minta sedikit bagian.

source: A small consideration eh?
id: Sedikit bagian eh?

source: Yes - a quarter of what we get from him.
id: Ya - seperempat dari yang kau dapat darinya.

source: *sigh* I knew you didn't really mean small. Very well frog, let's do business.
id: *menghela nafas* Aku tahu yang kau maksud tidaklah benar-benar kecil. Baiklah kodok, mari berbisnis.

source: All's well that ends well then, huh?
id: Akhir cerita yang bahagia bukan?

source: Yeah, I do think everyone's made out pretty well.
id: Yeah, aku pikir semua orang mendapatkan akhir yang bahagia.

source: Except the elder.
hu_hu: A rangidőst leszámítva.
id: Kecuali sang tetua.

source: Lead Programmer
hu_hu: Vezető programozó
id: Programmer Utama

source: Scripting Language Designer
hu_hu: Szkriptnyelv designer
id: Perancang Bahasa Skrip

source: Object Scripter
hu_hu: Objektum szkriptelő
id: Perancang Obyek

source: Minor Level Designer
hu_hu: Al-pályadesigner
id: Perancang Level Minor

source: The End
hu_hu: Vége
id: Tamat

source: Creative Director - created characters/setting/story
hu_hu: Kreatív igazgató - karakterek/szituáció/történet létrehozása
id: Pengarah Kreatif - pencipta karakter/seting/cerita

source: Artist - Characters, Monsters, and Props
hu_hu: Grafikus - karakterek, szörnyek és tárgyak
id: Artis - Karakter, Monster, dan Peran Pendukung

source: Artist - Terrain (house interiors and exteriors, seaside background)
hu_hu: Grafikus - terep (épület bel- és külterek, tengerparti háttér)
id: Artis - Kondisi alam (interior dan eksterior rumah, latar belakang laut)

source: Level Designer (esp. forest, cave, and dungeon levels)
hu_hu: Pálya designer (főleg erdei, barlangi és tömlöc pályák)
id: Perancang level (terutama level hutan, gua dan kastil)

source: The IRC Crew
hu_hu: Az IRC Csapat
id: Kru IRC

source: Bug Reports/Fixes
hu_hu: Hiba jelentések/javítások
id: Pelaporan/Perbaikan Kesalahan Pemrograman

source: Technical Advice
hu_hu: Technikai tanácsadás
id: Saran Teknis

source: Level Design and Object Scripting
hu_hu: Pálya design és objektum szkriptelés
id: Perancang Level dan Perancang Obyek

source: Devil's Advocacy
hu_hu: Az Ördög képviselete
id: Para Pendebat

source: Translation Coordinator
hu_hu: Fordítás koordinátor
id: Koordinator Penerjemah

source: Minor Bug Fixer
hu_hu: Al-hibajavító
id: Tukang Perbaikan Kesalahan Kecil

source: Translation Code and Coordination
id: Pengkoordinasi dan Kode Penerjemah

source: Key Remapping Code/Interface
id: Antarmuka/Kode Penyesuaian Kendali

source: OpenPandora Port
hu_hu: OpenPandora átírat
id: Konversi untuk OpenPandora

source: Lead Content Wrangler and Object Scripter, Programmer
hu_hu: Vezető tartalomkerítő és objektum szkriptelő, programozó
id: Pemimpin Pengatur Isi dan Pemimpin Perancang Obyek, Programer

source: Artist - Terrain (seaside, forest, cave, and dungeon)
hu_hu: Grafikus - terep (tengerparti, erdei, barlangi és tömlöc pályák)
id: Artis - Kondisi alam (sisi laut, hutan, gua dan kastil)

source: Level Designer (esp. seaside, town, and forest stages)
hu_hu: Pálya designer (főleg tengerparti, városi és erdei jelenetek)
id: Perancang Level (terutama sisi laut, kota, dan tatanan hutan)

source: Musician
hu_hu: Zeneszerző
id: Pemusik

source: Sound Effect Designer
hu_hu: Hang effekt designer
id: Perancang Efek Suara

source: SPECIAL THANKS:
hu_hu: KÜLÖN KÖSZÖNET:
id: TERIMA KASIH ISTIMEWA:

source: (Level Template)
hu_hu: (Pálya sablon)
id: (Templat Level)

source: (Test Level)
hu_hu: (Próba pálya)
id: (Uji Coba Level)

source: Test Level 10
id: Uji Coba Level 10

source: Each machine has a different arcade-style challenge.
hu_hu: Az egyes gépek különböző féle arcade-stílusú kihivást nyújtanak.
id: Setiap mesin memiliki tantangan gaya-arcade tersendiri.

source: Show us what you can do!
hu_hu: Mutasd, mit tudsz!
id: Tunjukkan kemampuanmu!

source: EXIT
hu_hu: KILÉPÉS
id: KELUAR

source: Select a level:
hu_hu: Válassz egy pályát:
id: Pilih level:

source: (cancel)
hu_hu: (mégse)
id: (Batalkan)

source: CLIMB
hu_hu: MÁSZÁS
id: MEMANJAT

source: RUN
hu_hu: FUTÁS
id: BERLARI

source: Coin Race
hu_hu: Érme verseny
id: Balap Koin

source: COIN RACE
hu_hu: ÉRME VERSENY
id: BALAP KOIN

source: LOAD GAME
hu_hu: JÁTÉK BETÖLTÉSE
id: MUAT PERMAINAN

source: NEW GAME
hu_hu: ÚJ JÁTÉK
id: PERMAINAN BARU

source: Press {LEFT_KEY} or {RIGHT_KEY} to walk.
hu_hu: '{LEFT_KEY}' vagy '{RIGHT_KEY}' segítségével tudsz sétálni.
id: Tekan {LEFT_KEY} atau {RIGHT_KEY} untuk berjalan.

source: Press {UP_KEY} to talk, and use things like doors.
hu_hu: '{UP_KEY}' segítségével tudsz beszélni és használni dolgokat, mint az ajtókat.
id: Tekan {UP_KEY} untuk berbicara, dan menggunakan benda-benda seperti pintu.

source: Press {DOWN_KEY} to crouch.
hu_hu: '{DOWN_KEY} segítségével tudsz guggolni.
id: Tekan {DOWN_KEY} untuk tiarap.

source: Quickly press {LEFT_KEY} or {RIGHT_KEY} twice to run.
hu_hu: '{LEFT_KEY}' vagy '{RIGHT_KEY}' kétszeri gyors nyomásával tudsz futni.
id: Tekan dua kali {LEFT_KEY} atau {RIGHT_KEY} dengan cepat untuk berlari.

source: Press {JUMP_KEY} to jump.
hu_hu: '{JUMP_KEY}' segítségével ugrasz.
id: Tekan {JUMP_KEY} untuk melompat.

source: Press {TONGUE_KEY} to use a character's attacks.
hu_hu: '{TONGUE_KEY}' segítségével tudsz a karaktereddel támadni.
id: Tekan {TONGUE_KEY} untuk menggunakan serangan.

source: Walk in front of a door or person, and press
hu_hu: Sétálj egy ajtóhoz vagy szeméylhez és nyomd
id: Berjalan di depan pintu atau orang, lalu tekan

source: the button that appears to interact with them.
hu_hu: meg a megjelenő billentyűt, hogy kapcsolatba lépj vele.
id: tombol yang muncul untuk berinteraksi dengan mereka.

source: Nene's House
hu_hu: Nene háza
id: Rumah Nene

source: Hey Nene, what's cooking?
hu_hu: Hé Nene, mi fortyog?
id: Hai Nene, sedang masak apa?

source: I'm making a cake. Would you like to have some?
hu_hu: Egy tortát készítek. Megszeretnéd kóstolni?
id: Aku sedang membuat kue, Kamu mau?

source: Nah, I'd better get to town.
hu_hu: Neeem, jobb, ha sietek a városba.
id: Nggak ah, aku harus ke kota.

source: I have serious business to attend to.
hu_hu: Komoly dolgokat kell elintéznem.
id: Aku ada urusan serius yang musti kuselesaikan.

source: Oh, well maybe before you go you could look at my basement.
hu_hu: Oh, nos mielőtt mész, talán megnézhetnéd a pincémet.
id: Oh, baiklah mungkin sebelum kamu pergi kamu bisa pergi ke ruang bawah-tanahku.

source: Your basement?
hu_hu: A pincédet?
id: Ruang bawah-tanahmu?

source: Yes, here's the key. There're some ants down there.
hu_hu: Igen, itt a kulcsa. Hangyák vannak odalent.
id: Ya, ini kuncinya. Ada beberapa semut di sana.

source: They're freaking me out.
hu_hu: A hideg is kiráz tőlük.
id: Mereka membuatku takut.

source: Sure thing. I need a job!
hu_hu: Persze. Kellett is valami munka!
id: Tentu saja. Aku butuh pekerjaan!

source: How much were you figuring on paying for a pest exterminator?
hu_hu: Mennyit gondoltál fizetni egy kártevőírtónak?
id: Menurutmu pembasmi hama kira-kira dibayar berapa ya?

source: Well sheesh, I thought you'd do it for free for a friend!
hu_hu: Na mondhatom, azt hittem ingyen is megcsinálnád egy barátnak!
id: Ya ampuun, aku pikir kamu akan melakukannya secara cuma-cuma untuk temanmu ini!

source: But if you're going to be like that I think I left a health capsule down there. If you can clear it out, it's yours.
hu_hu: De ha így akarsz hozzáállni, akkor azt hiszem lent hagytam egy szívkapszulát. Ha sikerül kitakarítanod, a Tied lehet.
id: Tapi kalau kamu tetap bersikeras Aku rasa aku meninggalkan kapsul kesehatan di bawah sana. Jika kamu berhasil, kapsul itu jadi milikmu.

source: So, did you end up taking care of those ants down there?
hu_hu: Na, sikerült végül elintézned azokat a hangyákat odalent?
id: Jadi, kamu sudah selesai membereskan semut-semut itu?

source: Of course. I don't disappoint!
hu_hu: Hát persze. Nem okozok csalódást!
id: Tentu saja. Aku tidak akan mengecewakan!

source: And thanks for the gift, by the way.
hu_hu: És köszönöm az ajándékot, mellesleg.
id: Omong-omong, terima kasih atas hadiahnya.

source: You're welcome.
hu_hu: Szívesen.
id: Sama-sama.

source: Can't a guy sneak into his neighbor's basement uninvited these days?
hu_hu: Nem tudom már manapság az ember beosonni a szomszédja pincéjébe?
id: Jaman sekarang tidak bolehkah seseorang mengendap-endap masuk ke ruang bawah-tanah milik tetangga?

source: Well, dangit, this door is locked.
hu_hu: Na, a fenébe, az ajtó zárva van.
id: Hum, sialan, pintunya terkunci.

source: To Nene's House
hu_hu: Nene házához
id: Menuju Rumah Nene

source: There's Nene's house, right up there!
hu_hu: Ott van Nene háza, pont arra!
id: Itu dia rumahnya Nene, di atas sana!

source: A moment of your time sir?
hu_hu: Egy percre feltarthatom, uram?
id: Boleh minta waktunya sebentar tuan?

source: Sorry, I'm off to town! Not interested!
hu_hu: Sajnálom, a város felé tartok! Nem érdekel!
id: Maaf, aku sedang menuju kota! Tidak tertarik!

source: But the town, you see ...
hu_hu: De pont ez az, a város, tudja...
id: Tetapi, kotanya ...

source: Not. Interested. Buzz off.
hu_hu: Nem. Érdekel. Tűnj el.
id: Tidak. Tertarik. Pergilah.

source: I don't care what you're preaching, go sell it to someone else.
hu_hu: Nem érdekel, miről prédkiálsz, menj sózd rá másra.
id: Aku tidak peduli kau mau omong apa, tawarkan ke orang lain saja.

source: Very well.
hu_hu: Hát legyen akkor.
id: Baiklah.

source: Someday, those door-to-door people will realize that kind of hard-sell tactic just annoys people.
hu_hu: Egy nap majd rájönnek ezek a házalók, hogy ez az izomból- árusító technika csak megörjíti az embereket.
id: Kelak, para penjual yang berjualan dari pintu-ke-pintu akan menyadari bahwa cara menjual seperti itu hanya akan mengganggu orang.

source: The sooner, the better.
hu_hu: Minél hamarabb, annál jobb.
id: Lebih cepat, lebih baik.

source: Twisted Trees
hu_hu: Torzult fák
id: Pohon-pohon Berlilitan

source: Underground Pool
hu_hu: Földalatti tó
id: Kolam Bawah Tanah

source: Waiting Room
hu_hu: Váróterem
id: Ruang Tunggu

source: Wandering Passage
hu_hu: Vándorló átjáró
id: Jalur Pengembara

source: Watery Alley
hu_hu: Vízes sikátor
id: Lorong Berair

source: Wither Wind
hu_hu: Hervasztó szél
id: Angin Gersang

source: The price is {final_price} coins.
hu_hu: Az ára {final_price} érme.
id: Harganya {final_price} koin.

source: You don't have enough money.
hu_hu: Nincs elegendő pénzed.
id: Anda tidak punya cukup uang.

source: Do you want to buy the {consts.name}?
hu_hu: Megszeretnéd venni a {consts.name} tárgyat?
id: Anda ingin membeli {consts.name}?

source: This is a blank tile. It doesn't do anything.
hu_hu: Ez egy üres csempe. Nem csinál semmit.
id: Ini adalah ubin kosong. Ini bukan apa-apa.

source: You made it to level {level.player.difficulty} of the coin race!
id: Kamu telah mencapai level {level.player.difficulty} pada balap koin!

source: You made it to level {level.player.difficulty} of the coin race.
id: Kamu telah mencapai level {level.player.difficulty} pada balap koin.

source: The furthest that has been reached is level {registry.arcade_coin_race_high_score}.
id: Level terjauh yang pernah dicapai adalah {registry.arcade_coin_race_high_score}.

source: You have acquired a heart capsule. Your maximum HP has increased by one!
hu_hu: Szereztél egy szívkapszulát. A maximális életerőd eggyel nőtt!
id: Kamu mendapatkan kapsul jantung. HP maksimum-mu bertambah satu!

source: You've found part of a heart capsule. Collect another three to increase your maximum HP by one!
hu_hu: Megtaláltál egy szívkapszula részt. Gyűjts össze további hármat, hogy eggyel növeld a maximális életerőd!
id: Kamu telah menemukan bagian dari kapsul jantung. Kumpulkan tiga lagi untuk meningkatkan HP maksimum-mu agar bertambah satu!

source: You've found part of a heart capsule. Collect another two to increase your maximum HP by one!
hu_hu: Megtaláltál egy szívkapszula részt. Gyűjts össze további kettőt, hogy eggyel növeld a maximális életerőd!
id: Kamu telah menemukan bagian dari kapsul jantung. Kumpulkan dua lagi untuk meningkatkan HP maksimum-mu agar bertambah satu!

source: You've found part of a heart capsule. Collect another one to increase your maximum HP by one!
hu_hu: Megtaláltál egy szívkapszula részt. Gyűjts össze még egyet, hogy eggyel növeld a maximális életerőd!
id: Kamu telah menemukan bagian dari kapsul jantung. Kumpulkan satu lagi untuk meningkatkan HP maksimum-mu agar bertambah satu!

source: You've collected enough parts to make a whole new heart capsule! Your maximum HP has increased by one!
hu_hu: Elegendő részt gyűjtöttél össze egy új szívkapszula összerakásához!A maximális életerőd eggyel nőtt!
id: Kamu telah mengumpulkan bagian- bagian yang cukup untuk membuat satu kapsul jantung yang utuh! HP maksimum-mu bertambah satu!

source: gliding wings
hu_hu: siklószárnyak
id: Sayap Luncur
