Repository: frogatto/Cube_Trains_Redux
Catalog: po/*.po
Languages: hu_hu, id

source: The gliding wings will allow you to glide through the air.
hu_hu: A siklószárnyakkal a levegőben tudsz siklani.
id: Sayap Luncur akan membuatmu meluncur di udara.

source: heart
hu_hu: szív
id: jantung

source: The heart will give you an extra health point.
hu_hu: A szív egy egységnyit gyógyít.
id: Jantung akan memberimu HP tambahan.

source: The power boots will make you jump higher.
hu_hu: Az erőbakkancstól magasabbra tudsz ugrani.
id: Boots bertenaga akan membuat lompatanmu lebih tinggi.

source: invincibility crystal
hu_hu: sérthetetlenség kristály
id: kristal sakti mandraguna

source: The invincibility crystal unlocks invincibility powerups. Invincibility powerups will make you invincible for a short time.
hu_hu: A sérthetetlenségkristály felszabadítja a sérthetetlenség erőnövelőket. A sérthetetlenség erőnövelők hatására rövid időre halhatatlanná válsz.
id: Kristal sakti mandraguna membuka kekuatan sakti. Kekuatan sakti membuatmu tidak terkalahkan dalam waktu yang singkat.

source: hyper crystal
hu_hu: hiper kristály
id: kristal hyper

source: The hyper crystal unlocks hyper powerups. Hyper powerups will heighten your reflexes, making the world seem to slow down around you.
hu_hu: A hiperkristály felszabadítja a hiper erőnövelőket. A hiper erőnövelők hatására a reflexeid élesebbé válnak, körülötted a világ mintha lelassulna.
id: Kristal hyper membuka kekuatan hyper. Kekuatan hyper akan meningkatkan refleks, membuat dunia di sekitarmu terasa pelan.

source: energy crystal
hu_hu: energia kristály
id: kristal energi

source: The energy crystal unlocks energy powerups. Energy powerups will allow you to shoot bolts of energy.
hu_hu: Az energiakristály felszabadítja az energia erőnövelőket. Az energia erőnövelők hatására energianyalábokat lövelhetsz ki.
id: Kristal energi membuka kekuatan energi. Kekuatan energi memberikanmu kemampuan untuk menembakkan sambaran energi.

source: The energy shield protects you from damage when you crouch.
hu_hu: Az energiapajzs megvéd a sérülésektől amikor leguggol.
id: Tameng energi menjagamu dari kerusakan saat kamu tiarap.

source: The speed boots will make you faster.
hu_hu: A sebességbakkancstól gyorsabban tudsz haladni.
id: Boot kecepatan membuatmu lebih cepat.

source: spit strengthener
hu_hu: köpés erősítő
id: penguat lemparan

source: The spit strengthener will extend the range you can spit.
hu_hu: A köpés erősítő megnöveli a köpéseid hatótávját.
id: Penguat lemparan akan menambah jangkauan lemparanmu.

source: tongue extender
hu_hu: nyelvhosszabító
id: pemanjang lidah

source: The tongue extender will extend the length of your tongue.
hu_hu: A nyelvhosszabító megnöveszti a nyelvednyújtásod távolságát.
id: Pemanjang lidah akan menambah panjang lidahmu.

source: Milgram's Castle
hu_hu: Milgram vára
id: Kastil Milgram

source: Do you want to save the game?
hu_hu: El kívánod menteni a játékot?
id: Kamu ingin menyimpan permainan?

source: The game has been saved.
hu_hu: A játék elmentve.
id: Permainan telah disimpan.

source: Hi, Chopple.
hu_hu: Hello, Chopple.
id: Hai, Chopple.

source: Hey. Welcome to the store.
hu_hu: Hé! Üdv az üzletben.
id: Hai. Selamat datang di toko ini.

source: Take your time, look around.
hu_hu: Ne siess, nyugodtan nézz körbe.
id: Silahkan lihat-lihat.

source: Hi, Kinguin, what's up?
hu_hu: Szia, Kinguin, hogy s mint?
id: Hai, Kinguin, apa kabar?

source: Loading Frogatto character
hu_hu: Frogatto karakter betöltése
id: Memuat karakter Frogatto

source: Loading door object
hu_hu: Ajtó objektum betöltése
id: Memuat obyek pintu

source: Loading energy shot
hu_hu: Energialövés betöltése
id: Memuat tembakan energi

source: Frogatto was made by a group of big-time fans of classic videogames, who are hoping to bring back the magic in a new, original game design with unconventional gameplay mechanics - a fun break from the usual clones. We're a small group of indie developers, hoping this game becomes one of the definitive platform games on iOS - and you can make that happen!
id: Frogatto dibuat oleh sekelompok penggemar luar biasa dari videogame klasik, yang berharap dapat mengembalikan sihir dalam sebuah rancangan permainan yang baru dan orisinil dengan mekanika permainan yang tidak biasa - sebuah intermezo dari salinan-salinan pada umumnya. Kami adalah sekelompok kecil yang terdiri dari pengembang-pengembang indie, yang berharap permainan ini bisa menjadi permainan platform terlengkap untuk iOS - dan anda bisa membantu mewujudkannya!

source: To find out more about the game or to play the PC/Mac version for free, please visit http://www.frogatto.com/
hu_hu: Ha többet szeretnél megtudni a játékról, vagy a PC/Mac-es változat is érdekelne, látogatass el http://www.frogatto.com/ oldalra.
id: Untuk info lebih lengkap tentang permainan ini atau bagaimana cara memainkan versi PC/Mac secara gratis, silahkan kunjungi http://www.frogatto.com/

source: Fixed The Long Haul (arcade level)
hu_hu: A Hosszú menet kijavítva (arcade pálya)
id: Perjalanan Panjang (level arcade) diperbaiki

source: Fixed instructions on titlescreen
hu_hu: Üdvözlőképernyőn az utasítások kijavítva.
id: Instruksi pada layarjudul diperbaiki

source: Directions
hu_hu: Irányok
id: Arah

source: Jump
hu_hu: Ugrás
id: Lompat

source: Tongue
hu_hu: Nyelvkiöltés
id: Lidah

source: Attack
hu_hu: Támadás
id: Serang

source: Back
hu_hu: Vissza
id: Kembali

source: Achievement Unlocked!
hu_hu: Achievement feloldva!
id: Pencapaian Didapat!

source: Initializing custom object
hu_hu: Egyedi objektumok betöltése
id: Memulai obyek kostum

source: Initializing custom object functions
hu_hu: Egyedi objektumok működésének betöltése
id: Memulai fungsi-fungsi obyek kostum

source: Initializing tiles
hu_hu: Csempék betöltése
id: Memulai ubin

source: Initializing GUI
hu_hu: GUI betöltése
id: Memulai GUI

source: Loading level
hu_hu: Pálya betöltése
id: Memuat level

source: Music Volume:
hu_hu: Zenék hangereje:
id: Volume Musik:

source: Sound Volume:
hu_hu: Hanghatások hangereje:
id: Volume Suara:

source: Resume
hu_hu: Folytatás
id: Lanjutkan

source: Controls...
hu_hu: Vezérlőgombok...
id: Kendali...

source: Return to Titlescreen
hu_hu: Vissza a kezdőképernyőhöz
id: Kembali ke Layarjudul

source: Exit Game
hu_hu: Kilépés a játékból
id: Keluar dari Permainan

source: Reverse A and B
hu_hu: A és B felcserélése
id: Tukar A dan B

source: Frogourmet
hu_hu: Frogasztronóm

source: Wow.
hu_hu: Tyűha!

source: *ahem*
hu_hu: *köhm*

source: -ouch-
hu_hu: -áó-

source: Frogatto Grotto
hu_hu: Frogatto grotta

source: Webmaster
hu_hu: Webmester

source: Yeah.. uhm..
hu_hu: Ja...öhm...
